[
  {
    "id": "744000102063975",
    "title": "Senior Business Analyst - Logistics (f/m/x)",
    "company": "AUTO1 Group",
    "url": "https://www.auto1-group.com/jobs/744000102063975",
    "location": "Berlin, BE, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "2026-01-07T11:32:02.260Z",
    "updated_time": null,
    "source": "Auto1Scraper",
    "scraped_at": "2026-01-12T09:09:45.716415",
    "description": "Support our supplier logistics team in aligning their needs with business growth objectives\nAnalyse data to identify opportunities for improving logistics processes, supporting market growth strategies, and enhancing network efficiency\nEvaluate business development KPIs to identify trends and recommend process improvements for operational excellence within the Logistics department\nContribute to the development of growth strategies and tenders to support international growth and operational scalability\nConduct internal audits of logistics systems to ensure accurate implementation of contract details and compliance\nDeliver reports, dashboards, and ad-hoc analyses that provide actionable insights\nChallenge assumptions and guide stakeholders by combining data with business context to recommend the most relevant KPIs and solutions\nEnsure data clarity, consistency, and reliability to empower informed, insight-driven logistics decisions",
    "salary": null,
    "job_type": null,
    "department": "Logistics",
    "archived_at": "2026-01-15T20:14:33.320430"
  },
  {
    "id": "744000103677225",
    "title": "(Senior) Machine Learning Platform/Ops Engineer, Remote/Europe (f/m/x)",
    "company": "AUTO1 Group",
    "url": "https://www.auto1-group.com/jobs/744000103677225",
    "location": "Berlin, BE, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "2026-01-15T09:25:23.918Z",
    "updated_time": null,
    "source": "Auto1Scraper",
    "scraped_at": "2026-01-15T15:48:29.599218",
    "description": "Job Description\nOwn the ML lifecycle: Design, implement, and maintain robust, containerized, and reproducible pipelines for model training, evaluation, and deployment—across both batch and real-time settings.\nOperationalize models at scale: Build and manage ML services, APIs, and model serving infrastructure using tools like MLflow, Amazon SageMaker, and Feature Store.\nAutomate and monitor: Set up and maintain monitoring, observability, and alerting systems to ensure high availability and performance (including model/data drift, feature logging, and inference latency).\nAccelerate experimentation: Develop and maintain internal libraries, templates, and platform tooling to improve reproducibility and simplify deployment workflows for all model teams.\nEnsure reliability and quality: Implement CI/CD pipelines for model and data workflows using Docker, Terraform, and Jenkins and share best practices, mentor less experienced engineers, and foster strong collaboration across teams.\nStay current: Continuously evaluate emerging MLOps technologies to improve efficiency, scalability, and reliability.\n&#xa0;",
    "salary": null,
    "job_type": null,
    "department": "Technology",
    "archived_at": "2026-01-15T20:14:33.320430"
  },
  {
    "id": "744000097290741",
    "title": "Intern Financial Planning & Analytics (m/w/d)",
    "company": "AUTO1 Group",
    "url": "https://www.auto1-group.com/jobs/744000097290741",
    "location": "Berlin, BE, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "2025-12-05T15:49:38.578Z",
    "updated_time": null,
    "source": "Auto1Scraper",
    "scraped_at": "2026-01-12T09:09:45.716427",
    "description": "Work closely with the Director Production Europe and with teams across Europe to gather, prepare, and analyze mission-critical data.\nSupport the strategic and operational planning of production processes across 12 European centers, impacting over 1000 colleagues.\nExtend, improve, and maintain our production models and reporting landscape.\nAnalyze data, identify opportunities, develop actionable plans, and drive initiatives with stakeholders across Europe.\nEstimate and present the financial effects of new projects and strategies.",
    "salary": null,
    "job_type": null,
    "department": "Production",
    "archived_at": "2026-01-15T20:14:33.320430"
  },
  {
    "id": "R0042824",
    "title": "Computer Vision Engineer",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/London-United-Kingdom/Computer-Vision-Engineer_R0042824-1",
    "location": "London, United Kingdom",
    "city": "London",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.725109",
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null,
    "archived_at": "2026-01-15T15:48:38.425397"
  },
  {
    "id": "2722231",
    "title": "Senior Applied Scientist (all genders)",
    "company": "Zalando",
    "url": "https://jobs.zalando.com/en/jobs/2722231-Senior-Applied-Scientist-(all-genders)",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "ZalandoScraper",
    "scraped_at": "2026-01-12T09:09:44.468038",
    "description": "EN\nDE",
    "salary": null,
    "job_type": null,
    "department": "Applied Science & Research",
    "archived_at": "2026-01-15T09:07:54.222217"
  },
  {
    "id": "744000102530241",
    "title": "Team Lead Data Science (f/m/x)",
    "company": "AUTO1 Group",
    "url": "https://www.auto1-group.com/jobs/744000102530241",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "2026-01-09T09:07:25.206Z",
    "updated_time": null,
    "source": "Auto1Scraper",
    "scraped_at": "2026-01-12T09:09:45.716396",
    "description": "Collaborate closely with your team and key stakeholders to convert business requirements into Machine Learning solutions\nFoster a culture that values data-driven decision-making within the organization and aid in the enhancement of our data platform\nOffer ML and engineering expertise and ensure your team builds, deploys and maintains high standards models\nDrive innovation and creativity within your team, encouraging them to explore new data science techniques and approaches\nEmpower your team by supporting members to grow and take ownership of data science projects\nCultivate and demonstrate an action-oriented approach, encouraging your team to experiment, iterate,&#xa0;drive initiatives forward, even amidst ambiguite and continually assess and improve the team's performance, setting clear expectations and providing constructive feedback\n&#xa0;",
    "salary": null,
    "job_type": null,
    "department": "Technology",
    "archived_at": "2026-01-14T21:12:22.221709"
  },
  {
    "id": "3123072",
    "title": "Principal Engineer - Systems for ML Inference and Training Optimization, Deep Science for Systems and Services",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3123072",
    "location": "DE, Tubingen",
    "city": "Tubingen",
    "country": "Germany",
    "posted_date": "November  7, 2025",
    "updated_time": "2 months",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233603",
    "description": "We are seeking an exceptional Principal Engineer specializing in ML Systems, training, and inference optimization to lead our technical strategy and implementation for next-generation AI performance at scale. This role requires deep expertise in performance engineering, distributed systems architecture, low-level systems optimization, and the ability to drive technical excellence across multiple teams. You will set the technical direction for kernel-level optimizations, define architectural strategies for heterogeneous compute platforms, architect multi-GPU and multi-node training systems, and lead the delivery of solutions that fundamentally change how AWS serves ML training and inference workloads.<br/>As a Principal Engineer in DS3, you will be a key technical leader responsible for organization-level architecture and performance strategy spanning the entire ML lifecycle—from distributed training of frontier models to high-throughput inference serving. You will work at the lowest levels of the software stack—defining standards for CUDA kernel development, optimizing assembly-level code (e.g. Nvidia PTX code), architect cross-platform acceleration strategies including GPUs and AWS Neuron, designing efficient multi-node communication patterns, and inventing novel approaches to achieve 10× or greater performance improvements. Your work will directly influence AWS's competitive position in AI infrastructure and set the standard for ML systems engineering across the industry.<br/><br/>Utility Computing (UC) <br/>AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.<br/><br/><br/>Key job responsibilities<br/>Technical Strategy & Vision: Define and drive the technical strategy and architectural roadmap for ML inference and training optimization across multiple teams within your organization. Bring systems architecture and performance engineering context to strategic business decisions.<br/>Cross-Platform Performance Leadership: Lead the design and architecture of kernel-level optimizations spanning NVIDIA GPUs, AWS Inferentia/Trainium, and emerging AI accelerators. Establish standards and best practices for low-level optimization across the organization.<br/>Intrinsically Hard Problems: Tackle the most difficult performance challenges—endemic bottlenecks, architectural complexity that prevents innovation, and critical business/technical problems requiring order-of-magnitude improvements (10× or greater).<br/>Systems-Level Innovation: Drive the design, implementation, and delivery of performance solutions at the program level that address significantly large or endemic customer and business problems across your organization and potentially others.<br/>Hardware-Software Co-Design: Establish deep understanding of new SoCs, GPUs, and AI accelerators; derive guidelines for optimal utilization and influence hardware selection decisions based on facts-driven analysis and resource budgeting.<br/>Technical Excellence & Force Multiplication: Set the standard for engineering excellence in your organization. Create mechanisms, tools, and processes that enable performance measurement, analysis, and optimization at scale across multiple teams.<br/>Organization-Level Influence: Align teams across your organization toward coherent performance strategies and architectural decisions. Drive adoption of new optimization approaches, concepts, and paradigms. Lead the most important and complex technical reviews.<br/>Team Development: Guide the career growth of senior engineers in your organization. Mentor and develop the next generation of performance engineering leaders. Participate in Principal promotion assessments and help grow the Principal Engineering community.<br/>Hands-On Technical Leadership: Remain a practitioner—personally writing critical-path code, designing zero-overhead portable libraries, and prototyping solutions that inform technical direction for your organization.<br/><br/>About the team<br/>Deep Science for Systems and Services (DS3) is a science organization within AWS Compute & ML Services focused on advancing AI/ML technologies at the systems level. Our team works at the intersection of machine learning and high-performance computing, developing optimizations for large model inference across diverse hardware platforms. We push the boundaries of what's possible in ML inference performance, working directly with CUDA, AWS Neuron, and other low-level compute abstractions to deliver order-of-magnitude performance improvements and industry-leading cost-performance for AWS customers deploying AI at scale.<br/><br/>About AWS<br/>Diverse Experiences <br/>Amazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. <br/><br/>Why AWS <br/>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/>Work/Life Balance <br/>We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. <br/>Inclusive Team Culture <br/>Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.<br/>Mentorship and Career Growth<br/>We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. <br/>",
    "salary": null,
    "job_type": "full-time",
    "department": null,
    "archived_at": "2026-01-14T21:12:22.221709"
  },
  {
    "id": "6590961",
    "title": "Senior Data Analyst - Grow & Engage",
    "company": "N26",
    "url": "https://n26.com/en-eu/careers/positions/6590961?gh_jid=6590961",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "2025-02-04T06:41:16-05:00",
    "updated_time": "2026-01-12T12:08:36-05:00",
    "source": "N26Scraper",
    "scraped_at": "2026-01-12T20:27:49.771772",
    "description": "<h2><strong>Senior Data Analyst - Grow &amp; Engage</strong></h2>\n<p>We are seeking an organised and self-motivated Senior Data Analyst to work embedded in our Grow &amp; Engage domain, one of our cross-functional areas shaping the development of one of the world’s leading FinTech products. In this role, you will lead, mentor, and coach other analysts, fostering a culture of collaboration, continuous learning, and <strong>causal, impact-focused decision making</strong> across the team.</p>\n<p><em><span style=\"text-decoration: underline;\">This is a hybrid role based in Barcelona or Berlin.</span></em></p>\n<h2><strong>About the opportunity</strong></h2>\n<p>As a Senior Data Analyst, you will enable our Product &amp; Business Segments (Acquire, Memberships, and Engagement) in the Growth and Engage domain to make <strong>causally sound, evidence-based decisions</strong>. You will be responsible for ensuring initiatives are evaluated using <strong>robust experimental and causal inference approaches</strong>, with a clear focus on <strong>incremental impact and counterfactual outcomes</strong>, rather than surface-level metrics. You will establish a strong data mindset and foster a culture of continuous learning and improvement, working cross-functionally with analysts, engineers, designers, and product managers.</p>\n<h2>In this role, you will:</h2>\n<ul>\n<li><strong>Help us set the right goals: </strong>Develop clear and measurable targets based on an initiatives’ scope.</li>\n<li><strong>Be a strategic partner for Senior Leadership: </strong>Driving end to end high complexity analysis on a strategic level in which the business domain is critical to drive overall company success.</li>\n<li><strong>Handle stakeholders:</strong> Be an internal go-to-person for your teams when it comes to data related questions.&nbsp;</li>\n<li><strong>Evaluate initiatives:</strong> Support Product experimentation &amp; testing initiatives; design test plans, obtain cross-functional alignment, e...",
    "salary": null,
    "job_type": null,
    "department": null,
    "archived_at": "2026-01-14T21:12:22.221709"
  },
  {
    "id": "2722729",
    "title": "Applied Scientist - ZEOS Data Science and Algorithms (all genders)",
    "company": "Zalando",
    "url": "https://jobs.zalando.com/en/jobs/2722729-Applied-Scientist---ZEOS-Data-Science-and-Algorith",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "ZalandoScraper",
    "scraped_at": "2026-01-12T20:27:48.847481",
    "description": "EN\nDE",
    "salary": null,
    "job_type": null,
    "department": "Applied Science & Research",
    "archived_at": "2026-01-14T09:08:40.151192"
  },
  {
    "id": "R0043706",
    "title": "Spectacles Student Worker - Computer Vision Engineering",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/Vienna-Austria/Computer-Vision-Engineering-Intern_R0043706",
    "location": "Vienna, Austria",
    "city": "Vienna",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.726106",
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null,
    "archived_at": "2026-01-13T23:00:58.173344"
  },
  {
    "id": "R0043402",
    "title": "Computer Vision engineer, Sensor Fusion",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/Vienna-Austria/Computer-Vision-engineer--Sensor-Fusion_R0043402-2",
    "location": "Vienna, Austria",
    "city": "Vienna",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.726106",
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null,
    "archived_at": "2026-01-13T23:00:58.173344"
  },
  {
    "id": "R0041312",
    "title": "Computer Vision Engineer, SLAM",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/Vienna-Austria/Computer-Vision-Engineer--Data_R0041312",
    "location": "Vienna, Austria",
    "city": "Vienna",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.726106",
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null,
    "archived_at": "2026-01-13T23:00:58.173344"
  },
  {
    "id": "R0043705",
    "title": "Spectacles Student Worker- Computer Vision Engineering",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/Vienna-Austria/Computer-Vision-Engineering-Intern_R0043705",
    "location": "Vienna, Austria",
    "city": "Vienna",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.726106",
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null,
    "archived_at": "2026-01-13T23:00:58.173344"
  },
  {
    "id": "R0043708",
    "title": "Computer Vision Engineering Intern",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/Vienna-Austria/Computer-Vision-Engineering-Intern_R0043708-1",
    "location": "Vienna, Austria",
    "city": "Vienna",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.726106",
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null,
    "archived_at": "2026-01-13T23:00:58.173344"
  },
  {
    "id": "R0043401",
    "title": "Software Engineer, C++ (Computer Vision)",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/Vienna-Austria/Computer-Vision-Engineer_R0043401-1",
    "location": "Vienna, Austria",
    "city": "Vienna",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.726106",
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null,
    "archived_at": "2026-01-13T23:00:58.173344"
  },
  {
    "id": "R0043709",
    "title": "Computer Vision Engineering Intern",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/Vienna-Austria/Computer-Vision-Engineering-Intern_R0043709",
    "location": "Vienna, Austria",
    "city": "Vienna",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.726106",
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null,
    "archived_at": "2026-01-13T23:00:58.173344"
  },
  {
    "id": "1271178801",
    "title": "Working Student (f/m/d) - Release Management for Signavio Security, Compliance and Governance Team",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/Berlin-Working-Student-%28fmd%29-Release-Management-for-Signavio-Security%2C-Compliance-and-Governance-Team-10557/1271178801/",
    "location": "Berlin, DE, 10557",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-01-12T09:09:47.586742",
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null,
    "archived_at": "2026-01-13T22:51:04.857959"
  },
  {
    "id": "3144837",
    "title": "Applied Scientist, Agentic AI",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3144837",
    "location": "DE, BE, Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "December 17, 2025",
    "updated_time": "27 days",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233593",
    "description": "Are you interested in machine learning, deep learning, automated reasoning or optimization? If so, we want to hear from you! We are looking for scientists with interest in using a variety of domain expertise",
    "salary": null,
    "job_type": "full-time",
    "department": null,
    "archived_at": "2026-01-13T22:51:04.857959"
  },
  {
    "id": "2723045",
    "title": "Data Engineer - Partner Tech",
    "company": "Zalando",
    "url": "https://jobs.zalando.com/en/jobs/2723045-Data-Engineer---Partner-Tech",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "ZalandoScraper",
    "scraped_at": "2026-01-12T09:09:44.468018",
    "description": null,
    "salary": null,
    "job_type": null,
    "department": "Software Engineering - Data",
    "archived_at": "2026-01-13T09:08:01.137887"
  }
]