[
  {
    "id": "744000106252995",
    "title": "Team Lead Data Science (f/m/x)",
    "company": "AUTO1 Group",
    "url": "https://jobs.smartrecruiters.com/auto1/744000106252995",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2026-01-29T09:08:00.433Z",
    "updated_time": null,
    "source": "SmartRecruiters:auto1",
    "scraped_at": "2026-01-29T09:16:03.790569",
    "domain": "auto1-group.com",
    "description": "Collaborate closely with your team and key stakeholders to convert business requirements into Machine Learning solutions\nFoster a culture that values data-driven decision-making within the organization and aid in the enhancement of our data platform\nOffer ML and engineering expertise and ensure your team builds, deploys and maintains high standards models\nDrive innovation and creativity within your team, encouraging them to explore new data science techniques and approaches\nEmpower your team by supporting members to grow and take ownership of data science projects\nCultivate and demonstrate an action-oriented approach, encouraging your team to experiment, iterate,&#xa0;drive initiatives forward, even amidst ambiguite and continually assess and improve the team's performance, setting clear expectations and providing constructive feedback\n&#xa0;",
    "salary": null,
    "job_type": null,
    "department": "Technology"
  },
  {
    "id": "744000106252249",
    "title": "(Senior) Machine Learning Platform/Ops Engineer, Remote/Europe (f/m/x)",
    "company": "AUTO1 Group",
    "url": "https://jobs.smartrecruiters.com/auto1/744000106252249",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2026-01-29T09:09:04.419Z",
    "updated_time": null,
    "source": "SmartRecruiters:auto1",
    "scraped_at": "2026-01-29T09:16:03.016234",
    "domain": "auto1-group.com",
    "description": "Own the ML lifecycle: Design, implement, and maintain robust, containerized, and reproducible pipelines for model training, evaluation, and deployment—across both batch and real-time settings.\n\nOperationalize models at scale: Build and manage ML services, APIs, and model serving infrastructure using tools like MLflow, Amazon SageMaker, and Feature Store.\n\nAutomate and monitor: Set up and maintain monitoring, observability, and alerting systems to ensure high availability and performance (including model/data drift, feature logging, and inference latency).\n\nAccelerate experimentation: Develop and maintain internal libraries, templates, and platform tooling to improve reproducibility and simplify deployment workflows for all model teams.\n\nEnsure reliability and quality: Implement CI/CD pipelines for model and data workflows using Docker, Terraform, and Jenkins and share best practices, mentor less experienced engineers, and foster strong collaboration across teams.\nStay current: Continuously evaluate emerging MLOps technologies to improve efficiency, scalability, and reliability.\n&#xa0;",
    "salary": null,
    "job_type": null,
    "department": "Technology"
  },
  {
    "id": "744000106245485",
    "title": "Duales Studium Data Science – in Kooperation mit der DHBW Stuttgart",
    "company": "Sixt",
    "url": "https://jobs.smartrecruiters.com/sixt/744000106245485",
    "location": "Munich, de",
    "city": "Munich",
    "country": "de",
    "posted_date": "2026-01-29T08:25:16.368Z",
    "updated_time": null,
    "source": "SmartRecruiters:sixt",
    "scraped_at": "2026-01-29T09:15:56.696276",
    "domain": "sixt.com",
    "description": "Du hast (bald)&#xa0;Dein Abitur&#xa0;in der Tasche und interessierst Dich für Daten, Analysen und Programmierung? Du willst direkt in die Praxis einsteigen und gleichzeitig ein Studium absolvieren?&#xa0;Dann starte dein duales Studium&#xa0;Data Science&#xa0;bei SIXT in Kooperation mit der DHBW Stuttgart.&#xa0;\nBei SIXT&#xa0;wirst Du vom ersten Tag an Teil unseres&#xa0;internationalen Unternehmens.&#xa0;Du erhältst Einblicke in alle zentralen Bereiche rund um das Thema Data Science&#xa0;und lernst praxisnah&#xa0;wie Du im Team datengetriebene Lösungen entwickelst und so aktiv zur digitalen Transformation unseres Unternehmens beiträgst.&#xa0;\nDabei kombinierst Du Theorie und Praxis auf ideale Weise und legst damit den Grundstein für Deine Karriere im&#xa0;Data Science. Klingt interessant? Dann bewirb Dich jetzt!&#xa0;\nHinweis: Bitte füge Deiner Bewerbung Dein Schulabschlusszeugnis bzw. eine aktuelle Notenübersicht bei.&#xa0;\nStartdatum: 01.09.2026\nDEIN DUALES STUDIUM&#xa0;\nDu absolvierst Dein duales Studium mit Theoriephasen an der DHBW Stuttgart und Praxisphasen bei SIXT am Campus bei München in einem Blockmodell (jeweils 3 Monate)&#xa0;\nDu kombinierst fundierte&#xa0;BWL-Kenntnisse&#xa0;(z. B. Business Administration, Economics,&#xa0;Finanzierung und Rechnungswesen,&#xa0;Recht)&#xa0;mit&#xa0;spezifischen&#xa0;Kenntnissen&#xa0;innerhalb&#xa0;Wirtschaftsinformatik&#xa0;&#xa0;\nDu erwirbst praxisnahes Wissen in&#xa0;Wirtschaft und Data Management&#xa0;und vertiefst zugleich&#xa0;deine Kenntnisse in der&#xa0;Programmierung, Datenbanken und&#xa0;künstliche Intelligenz und Big Data&#xa0;\nDu arbeitest bei SIXT aktiv&#xa0;an&#xa0;spannenden&#xa0;Projekten&#xa0;mit und erhältst Einblicke in verschiedene Geschäftsbereiche&#xa0;\nDu hast die Möglichkeit, eine&#xa0;Praxisphase im Ausland&#xa0;an einem internationalen SIXT-Standort zu absolvieren&#xa0;\nDu wirst durch&#xa0;Mentoring und Trainings&#xa0;individuell gefördert&#xa0;\nDEINE SPEZIALISIERUNG&#xa0;\nIn Deinem Studium kannst d...",
    "salary": null,
    "job_type": null,
    "department": "TECH & Engineering"
  },
  {
    "id": "744000106245685",
    "title": "Duales Studium Data Science – in Kooperation mit der DHBW Stuttgart",
    "company": "Sixt",
    "url": "https://jobs.smartrecruiters.com/sixt/744000106245685",
    "location": "Stuttgart, de",
    "city": "Stuttgart",
    "country": "de",
    "posted_date": "2026-01-29T08:25:41.476Z",
    "updated_time": null,
    "source": "SmartRecruiters:sixt",
    "scraped_at": "2026-01-29T09:15:56.029049",
    "domain": "sixt.com",
    "description": "Du hast (bald)&#xa0;Dein Abitur&#xa0;in der Tasche und interessierst Dich für Daten, Analysen und Programmierung? Du willst direkt in die Praxis einsteigen und gleichzeitig ein Studium absolvieren?&#xa0;Dann starte dein duales Studium&#xa0;Data Science&#xa0;bei SIXT in Kooperation mit der DHBW Stuttgart.&#xa0;\nBei SIXT&#xa0;wirst Du vom ersten Tag an Teil unseres&#xa0;internationalen Unternehmens.&#xa0;Du erhältst Einblicke in alle zentralen Bereiche rund um das Thema Data Science&#xa0;und lernst praxisnah&#xa0;wie Du im Team datengetriebene Lösungen entwickelst und so aktiv zur digitalen Transformation unseres Unternehmens beiträgst.&#xa0;\nDabei kombinierst Du Theorie und Praxis auf ideale Weise und legst damit den Grundstein für Deine Karriere im&#xa0;Data Science. Klingt interessant? Dann bewirb Dich jetzt!&#xa0;\nHinweis: Bitte füge Deiner Bewerbung Dein Schulabschlusszeugnis bzw. eine aktuelle Notenübersicht bei.&#xa0;\nStartdatum: 01.09.2026\nDEIN DUALES STUDIUM&#xa0;\nDu absolvierst Dein duales Studium mit Theoriephasen an der DHBW Stuttgart und Praxisphasen bei SIXT am Campus bei München in einem Blockmodell (jeweils 3 Monate)&#xa0;\nDu kombinierst fundierte&#xa0;BWL-Kenntnisse&#xa0;(z. B. Business Administration, Economics,&#xa0;Finanzierung und Rechnungswesen,&#xa0;Recht)&#xa0;mit&#xa0;spezifischen&#xa0;Kenntnissen&#xa0;innerhalb&#xa0;Wirtschaftsinformatik&#xa0;&#xa0;\nDu erwirbst praxisnahes Wissen in&#xa0;Wirtschaft und Data Management&#xa0;und vertiefst zugleich&#xa0;deine Kenntnisse in der&#xa0;Programmierung, Datenbanken und&#xa0;künstliche Intelligenz und Big Data&#xa0;\nDu arbeitest bei SIXT aktiv&#xa0;an&#xa0;spannenden&#xa0;Projekten&#xa0;mit und erhältst Einblicke in verschiedene Geschäftsbereiche&#xa0;\nDu hast die Möglichkeit, eine&#xa0;Praxisphase im Ausland&#xa0;an einem internationalen SIXT-Standort zu absolvieren&#xa0;\nDu wirst durch&#xa0;Mentoring und Trainings&#xa0;individuell gefördert&#xa0;\nDEINE SPEZIALISIERUNG&#xa0;\nIn Deinem Studium kannst d...",
    "salary": null,
    "job_type": null,
    "department": "TECH & Engineering"
  },
  {
    "id": "3168637",
    "title": "Working Student - Customer Solutions Manager, CSM Germany",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3168637",
    "location": "DE, BY, Munich",
    "city": "Munich",
    "country": "Germany",
    "posted_date": "January 28, 2026",
    "updated_time": "about 18 hours",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-28T19:57:36.837256",
    "domain": null,
    "description": "Join Amazon Web Services (AWS) in leading the cloud revolution.<br/><br/>We are looking for individuals who are passionate about improving processes with technical, cloud based tools. As a Working Student AWS Customer Solutions Manager (CSM) you will work with a team of CSMs responsible for helping customers along their multi-year journey to the cloud. Our CSMs guide the customer through the operational, educational and governance aspects of a successful AWS cloud journey. In this new, highly visible, role you will be ensuring that all AWS teams are working together effectively and efficiently to deliver outcomes for the customer.<br/><br/><br/>At AWS, a CSM works with customers and AWS leadership, driving collaboration between multiple teams, including sales, solutions architects, professional service consultants and support teams, to plan and support workload migrations in a step by step manner. Our interns or working students are encouraged to think big, invent and take ownership on customer challenges. You will not only bring the best of AWS/ Amazon to our customers, you will proactively help solve the customer’s challenges through new ideas, tools and mechanisms.<br/><br/>As a working student, you will receive AWS technical training, immerse yourself in cloud computing develop business acumen, and learn more about Amazon culture. You will work on projects with mentors and peers, complete the AWS Cloud Practitioner Certification and attend professional development events.<br/><br/>Amazon working student role are part-time (20 hours/week) and normally run for 1 year with timelines dependent on country locations.<br/><br/>Successful candidates will have a technical background, problem solving abilities, be detail driven, and have great communication skills. They should be passionate about delivering a great customer experience while contributing to the day-to-day management of the customer’s successful migration to AWS.<br/><br/><br/>Work/Life Balance<br/>Our team also puts a high value on work-life balance. Striking a healthy balance between your personal and professional life is crucial to your happiness and success here, which is why we aren’t focused on how many hours you spend at work or online. Instead, we’re happy to offer a flexible schedule so you can have a more productive and well-balanced life.<br/><br/>Mentorship & Career Growth<br/>Our team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional and enable them to take on more complex tasks in the future. ",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "8364210002",
    "title": "(Senior) Data Engineer",
    "company": "SumUp",
    "url": "https://sumup.com/careers/positions/8364210002?gh_jid=8364210002",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-28T11:23:32-05:00",
    "source": "Greenhouse:sumup",
    "scraped_at": "2026-01-28T19:56:59.964721",
    "domain": "sumup.com",
    "description": "As part of the Platform tribe, you will help build a self-service, AI-Ready Data Platform. The Data Platform team supports our next big bets: Data, AI, and real-time analytics. We are a team focused on building scalable, reliable infrastructure to enable our global data community.\n\nWhat you’ll do\n\nBuild and maintain a best-in-class data infrastructure to support critical processes\n\nDevelop features to improve platform self-service capabilities, including ETL and orchestration\n\nOptimize processes to improve compute resource efficiency and reduce costs\n\nImplement automations to ensure our infrastructure remains highly available 24/7\n\nContribute to the design and implementation of new services within our platform\n\nYou’ll be great for this role if\n\nYou have 3+ years of experience with a modern data stack, including DBT, Airflow, and Snowflake.\n\nYou are proficient in Software Engineering using Python or GoLang.\n\nYou have experience building and maintaining performant API layers.\n\nYou possess a pragmatic mindset and a \"team-first\" attitude.\n\nYou are self-motivated and able to work independently while managing stakeholder needs.\n\nAbout SumUp&nbsp;\n\nWe believe in the everyday hero. Small business owners are at the heart of all we do, so we're creating tools that help them run their businesses. With a founder’s mentality and a 'team-first’ attitude, our diverse teams across Europe, South America, and the United States work together to ensure that the small business owners we partner with can be successful doing what they love. SumUp is an Equal Employment Opportunity employer that proudly pursues and hires a diverse workforce. SumUp does not make hiring or employment decisions on the basis of race, colour, religion or religious belief, ethnic or national origin, nationality, sex, gender, gender identity, sexual orientation, disability, age or any other basis protected by applicable laws or prohibited by company policy. SumUp also strives for a healthy and safe workplace and ...",
    "salary": null,
    "job_type": null,
    "department": "Data Engineer/Scientist"
  },
  {
    "id": "7559778",
    "title": "Data Engineer, Global Data Products (f/m/x)",
    "company": "HelloFresh",
    "url": "https://careers.hellofresh.com/global/en/job/7559778?gh_jid=7559778",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-28T09:10:17-05:00",
    "source": "Greenhouse:hellofresh",
    "scraped_at": "2026-01-28T19:56:13.463942",
    "domain": "hellofresh.com",
    "description": "The role\n\nWe are a cross-functional team that integrates data engineers and data analysts. Our objective is to establish a dependable groundwork for data-driven decision-making. This role holds significance across the organization, tasked with constructing foundational data assets and metrics.\n\nAs a Data Engineer in Global Data Products, you will be collaborating to build robust and highly reliable data products using cutting-edge technologies (Snowflake, Databricks, DBT, Spark, Kafka etc). You will drive continuous improvement to our current data processing workflows; whilst engaging with the data producers and consumers to align business requirements with our roadmap.\n\nAbove all, we are looking for people who will&nbsp;make HelloFresh&nbsp;better.&nbsp;We believe there are many different ways of developing skills and we love diverse experiences! So even if you don’t “tick all the boxes” but think you’d thrive in this role, we would really like to learn more about you.\n\nWhat you’ll do\n\nBuild and maintain complex and scalable ETL pipelines\n\nWork closely with the data producers and software developers\n\nCollaborate closely with different stakeholders such as Marketing, Product Analytics, etc.\n\nDrive data quality and governance&nbsp;\n\nWork together with our cross-organizational data engineering chapter to adapt the latest tools and techniques to the needs of HelloFresh.\n\nWhat you’ll bring\n\nStrong understanding of engineering fundamentals and able to design, implement and deliver maintainable and high-quality code\n\nStrong problem-solving acumen&nbsp;\n\nProficiency in SQL and Python stack\n\nStrong written and verbal communication skills, ability to build effective communication structures in a fast-growing engineering organization\n\nBonus points:\n\nYou treat data quality issues as engineering problems to solve, not business problems to escalate\n\nYou’ve debugged a Spark pipeline and know the satisfaction of finding the root cause\n\nDemonstrated experience with data modeling te...",
    "salary": null,
    "job_type": null,
    "department": "Tech "
  },
  {
    "id": "7454717",
    "title": "Senior Data Scientist (all genders)",
    "company": "HelloFresh",
    "url": "https://careers.hellofresh.com/global/en/job/7454717?gh_jid=7454717",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-27T11:00:25-05:00",
    "source": "Greenhouse:hellofresh",
    "scraped_at": "2026-01-27T20:28:16.539542",
    "domain": "hellofresh.com",
    "description": "The role\n\nAs a Senior Data Scientist in our Global Consumer Alliance, you will be at the forefront of creating the right ecosystem at HelloFresh so that we are truly customer centric in everything we do. Our Global Customer Experience (GCX) team’s mission is to understand our customers’ journeys and empower market leads with insights and intelligent solutions that improve satisfaction, retention, and efficiency. We build scalable models and GenAI systems that turn unstructured feedback into actionable sentiment insights, personalize compensation to balance cost with loyalty, and enhance every customer interaction — from self-serve automation to agent-led support.\n\nWe are looking for a Senior Data Scientist with experience in translating complex customer and behavioral data into measurable business impact — skilled in predictive modeling, NLP or GenAI, and passionate about using data to shape meaningful customer experiences. If you enjoy working with diverse data sources, solving open-ended problems, and driving tangible improvements for millions of customers, this could be the perfect role for you — and you might just be our missing ingredient.\n\nAbove all, we are looking for people who will make HelloFresh better. We believe there are many different ways of developing skills and we love diverse experiences! So even if you don’t “tick all the boxes” but think you’d thrive in this role, we would really like to learn more about you.\n\nWhat you’ll do\n\nPartner with data scientists and other engineers in a cross-functional team.\n\nDesign, implement, and deploy full-stack scalable machine learning models with a focus on maintainability, observability, scalability and stability.\n\nMaintain high-quality, version-controlled code repositories for the various working environments and products.\n\nConduct code and model reviews of peers, providing actionable feedback to ensure a high quality of standard\n\nDrive day-to-day operations for our complex, ambiguous and large scale AI/ML pro...",
    "salary": null,
    "job_type": null,
    "department": "Insights & Experience"
  },
  {
    "id": "6590961",
    "title": "Senior Data Analyst - Grow & Engage",
    "company": "N26",
    "url": "https://n26.com/en-eu/careers/positions/6590961?gh_jid=6590961",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-27T14:37:08-05:00",
    "source": "Greenhouse:n26",
    "scraped_at": "2026-01-27T20:28:16.317628",
    "domain": "n26.com",
    "description": "Senior Data Analyst - Grow &amp; Engage\n\nWe are seeking an organised and self-motivated Senior Data Analyst to work embedded in our Grow &amp; Engage domain, one of our cross-functional areas shaping the development of one of the world’s leading FinTech products. In this role, you will lead, mentor, and coach other analysts, fostering a culture of collaboration, continuous learning, and causal, impact-focused decision making across the team.\n\nThis is a hybrid role based in Barcelona or Berlin.\n\nAbout the opportunity\n\nAs a Senior Data Analyst, you will enable our Product &amp; Business Segments (Acquire, Memberships, and Engagement) in the Growth and Engage domain to make causally sound, evidence-based decisions. You will be responsible for ensuring initiatives are evaluated using robust experimental and causal inference approaches, with a clear focus on incremental impact and counterfactual outcomes, rather than surface-level metrics. You will establish a strong data mindset and foster a culture of continuous learning and improvement, working cross-functionally with analysts, engineers, designers, and product managers.\n\nIn this role, you will:\n\nHelp us set the right goals: Develop clear and measurable targets based on an initiatives’ scope.\n\nBe a strategic partner for Senior Leadership: Driving end to end high complexity analysis on a strategic level in which the business domain is critical to drive overall company success.\n\nHandle stakeholders: Be an internal go-to-person for your teams when it comes to data related questions.&nbsp;\n\nEvaluate initiatives: Support Product experimentation &amp; testing initiatives; design test plans, obtain cross-functional alignment, execute robust analysis, and deliver actionable insights. Share these learnings through clear documentation and concise and empathic communication.\n\nContribute to self-serve data platform: Help building the right analytics foundations ,by pairing up with technical peers, so our product and business team...",
    "salary": null,
    "job_type": null,
    "department": "Operations"
  },
  {
    "id": "744000105804720",
    "title": "Associate Machine Learning Engineer l (2026 Tech Grad Program)",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000105804720",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2026-01-27T09:37:53.812Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-27T15:58:35.932274",
    "domain": "deliveryhero.com",
    "description": "Job Description\nAbout the Opportunity\nWe are on the lookout for talented&#xa0;Associate Machine Learning Engineer&#xa0;to join our&#xa0;2026 Tech Grad Program, on our journey to always deliver amazing experiences.\nOur Tech Grad Program offers you a unique environment for you to learn and develop your skills, and to contribute to the development of our cutting-edge tech solutions. You will have some of the most talented and experienced software engineers in the industry as mentors to help you ramp up, and a support group you can go to for help and connection.\nOur Engineering organization consists of over 1,500 talented engineers distributed across our major verticals. Our tech employees are divided into different teams across the following areas: Consumer Data Products, FinTech, Logistics, Pandora, Platform, Quick Commerce, and Vendor Tech. They work on a range of major topics from boosting customer acquisition and retention to creating efficient experiences for our vendors, building an excellent logistics ecosystem across the delivery lifecycle, providing financial empowerment to our stakeholders and much more.&#xa0;\nIf you are an Engineering graduate looking for an opportunity to grow in the tech industry and make a difference, our Tech Graduate Program is for you!&#xa0;You can also visit our Early Careers @ Delivery Hero website for more information!\n&#xa0;\nImportant information about this Position\nPlease note that we are pursuing a new, pilot hiring model for 2026. We are opening this job opportunity temporarily, during which time we will collect your applications.&#xa0;\nIf we choose to proceed with your application, you will go through our standard interview process (recruiter call, coding, technical concepts interview, hiring manager interview). When overall feedback is positive, we will place you in a pool of offerable candidates and reach out for next steps as soon as an Associate Machine Learning role becomes available in the org.\nThis role will stay open fo...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000105805721",
    "title": "Data Engineer l (2026 Tech Grad Program)",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000105805721",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2026-01-27T09:42:28.844Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-27T15:58:35.314194",
    "domain": "deliveryhero.com",
    "description": "About the Opportunity\nWe are on the lookout for talented&#xa0;Data Engineer l, to join our&#xa0;2026 Tech Grad Program, on our journey to always deliver amazing experiences.\nOur Tech Grad Program offers you a unique environment for you to learn and develop your skills, and to contribute to the development of our cutting-edge tech solutions. You will have some of the most talented and experienced software engineers in the industry as mentors to help you ramp up, and a support group you can go to for help and connection.\nOur Engineering organization consists of over 1,500 talented engineers distributed across our major verticals. Our tech employees are divided into different teams across the following areas: Consumer Data Products, FinTech, Logistics, Pandora, Platform, Quick Commerce, and Vendor Tech. They work on a range of major topics from boosting customer acquisition and retention to creating efficient experiences for our vendors, building an excellent logistics ecosystem across the delivery lifecycle, providing financial empowerment to our stakeholders and much more.&#xa0;\nIf you are an Engineering graduate looking for an opportunity to grow in the tech industry and make a difference, our Tech Graduate Program is for you! More details can be seen on our Early Careers @ Delivery Hero Website\n&#xa0;\nImportant information about this Position\nPlease note that we are pursuing a new, pilot hiring model for 2026. We are opening this job opportunity temporarily, during which time we will collect your applications.&#xa0;\nIf we choose to proceed with your application, you will go through our standard interview process (recruiter call, coding, technical concepts interview, hiring manager interview). When overall feedback is positive, we will place you in a pool of offerable candidates and reach out for next steps as soon as a Data Engineer l role becomes available in the org.\nThis role will stay open for applications until 30th January, 2026\n&#xa0;\nWhat you need to be Suc...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000105836891",
    "title": "Data Scientist - Quick Commerce",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000105836891",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2026-01-27T12:17:15.819Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-27T15:58:34.659811",
    "domain": "deliveryhero.com",
    "description": "We are on the lookout for a Data Scientist to join our Quick Commerce team on our journey to always deliver amazing experiences.\nWe are redefining how customers experience quick commerce. You’ll help build technology that scales our non-food offerings, reaching new market segments and driving revenue growth. By innovating within our Quick Commerce Team, you’ll make Delivery Hero the go-to platform for a broad range of products, helping us grow faster and deliver more value to customers around the world.\nAt Content & Assortment, we are building the AI engine that powers our global product catalog. We want every product to be perfectly described, categorized, and presented to our customers. Our mission is to automate and optimize the entire lifecycle of our product catalog—from creation and enrichment to categorization and curation—using advanced Machine Learning.\nAs a Data Scientist, you will work side-by-side with Data Scientists, Machine Learning Engineers, and Software Engineers to design, build, and deploy ML models that automate content creation and power a smarter product assortment.\nThis is a role for someone who has a strong background in applied ML, particularly in NLP, classification, or recommendation systems, and is hungry to solve complex catalog problems at scale. You will drive hypotheses, validate model accuracy, and bring ML-powered services for attribute enrichment, product categorization, and assortment curation into production with real business impact.\nIf you’re a strong coder with a problem-solving mentality and thrive in high-scale applied ML problems, we’d love to talk.\nYour mission:\n\nDesign, experiment, and deploy AI/ML models/Agents to automate the enrichment and moderation of product attributes at scale.\n\nDrive experimentation: formulate hypotheses, validate model performance , analyze business impact, and turn insights into production-ready models.\n\nDevelop and provide ML models to intelligently curate the product assortment, including att...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "4766708101",
    "title": "AI Research Engineer - Foundation Models",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4766708101?gh_jid=4766708101",
    "location": "Berlin; London; Munich; Paris",
    "city": "Berlin; London; Munich; Paris",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-26T12:19:13-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-27T09:10:03.612396",
    "domain": "helsing.ai",
    "description": "Who we are\n\nHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.&nbsp;\n\nAs democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.&nbsp;\n\nWe are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers.&nbsp;We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.&nbsp;\n\nThe role\n\nAt Helsing, we are redefining perception by building foundational intelligence for the physical world. You will research, design, and train large-scale Foundational Models that transform complex multimodal sensor data into cutting-edge autonomous capabilities.\n\nWe are seeking an individual at the intersection of AI Research and Machine Learning Engineering, with a proven track record in LLM/VLM/(multimodal) backbones. Your primary focus will be training and fine-tuning Vision-Language Models on our custom datasets to power our different products. You'll be responsible for the entire model lifecycle, from data curation and training to evaluation.\n\nYou should apply if you\n\nHold an MSc or PhD in Machine Learning, Computer Science, or Mathematics with a focus on Deep Learning.\n\nPossess theoretical understanding and practical experience in training Foundational Models (LLMs, VLMs, or other large-scale multimodal models) from scratch or through fine-tuning.\n\nHave strong software engineering skills in Python and fluency with modern DL frameworks (PyTorch/JAX). You don’t just import libraries; you are comfortable writing custom l...",
    "salary": null,
    "job_type": null,
    "department": "AI & Engineering"
  },
  {
    "id": "744000105609775",
    "title": "Project Manager Fulfillment-Services (m/w/d)",
    "company": "AboutYou",
    "url": "https://jobs.smartrecruiters.com/aboutyougmbh/744000105609775",
    "location": "Hamburg, de",
    "city": "Hamburg",
    "country": "de",
    "posted_date": "2026-01-26T11:32:36.048Z",
    "updated_time": null,
    "source": "SmartRecruiters:aboutyougmbh",
    "scraped_at": "2026-01-26T12:34:47.786262",
    "domain": "aboutyou.com",
    "description": null,
    "salary": null,
    "job_type": null,
    "department": "BUSINESS Standard"
  },
  {
    "id": "744000105568741",
    "title": "Manager, Data Engineering - (Logistics, ML Platform)",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000105568741",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2026-01-26T08:26:46.413Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-26T09:10:56.552874",
    "domain": "deliveryhero.com",
    "description": "We are looking for a Data Engineering Manager to join our Logistics vertical on our journey to always deliver amazing experiences.&#xa0;\nIn our Logistics Team, you’ll tackle high-impact challenges that make last-mile delivery efficient, affordable, and sustainable. Your work will directly improve experiences for riders, end customers, and merchants across the globe. Each enhancement you contribute will help Delivery Hero optimize delivery operations, supporting expansion into new areas like grocery and retail.\nYou would lead our Data Engineering and Machine learning squad who own our Logistics Machine Learning Platform . This platform enables us to rapidly and reliably develop, deploy, and manage machine learning models that support essential business areas such as delivery time estimations and routing.\n\nIf you are a creative problem solver who is hungry for a new adventure and working with large-scale distributed systems, an international workplace is waiting for you in the heart of Berlin!\n\nLead a team&#xa0; of data and machine learning engineers to design, build, and maintain robust MLOps architecture, ensuring the ML lifecycle operates efficiently at scale.\n\nSupport an established team of&#xa0; data and machine learning engineers in their day-to-day development experience, personal development, and long-term career growth.\n\nOwn the execution and development of functionalities in small iterations that deliver value.\n\nStakeholder management across multiple brands of Delivery hero.\n\nDrive project and tech strategy across the Domain.\n\nRaise the Bar in operational excellence and product delivery.\n\nPartner with your product counterpart and provide technical direction to your team, facilitating the design of feasible and iterative solutions aligned with the business needs.\n\nOwn the tech metrics and KPIs of your team, ensuring full visibility, tracking, and alerting.\n\nProvide technical support for the design of solutions that are reliable, performing, cost-effective, an...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000104688856",
    "title": "(Senior) Machine Learning Platform/Ops Engineer, Remote/Europe (f/m/x)",
    "company": "AUTO1 Group",
    "url": "https://jobs.smartrecruiters.com/auto1/744000104688856",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2026-01-21T13:34:12.582Z",
    "updated_time": null,
    "source": "SmartRecruiters:auto1",
    "scraped_at": "2026-01-23T20:56:10.631661",
    "domain": "auto1-group.com",
    "description": "Own the ML lifecycle: Design, implement, and maintain robust, containerized, and reproducible pipelines for model training, evaluation, and deployment—across both batch and real-time settings.\nOperationalize models at scale: Build and manage ML services, APIs, and model serving infrastructure using tools like MLflow, Amazon SageMaker, and Feature Store.\nAutomate and monitor: Set up and maintain monitoring, observability, and alerting systems to ensure high availability and performance (including model/data drift, feature logging, and inference latency).\nAccelerate experimentation: Develop and maintain internal libraries, templates, and platform tooling to improve reproducibility and simplify deployment workflows for all model teams.\nEnsure reliability and quality: Implement CI/CD pipelines for model and data workflows using Docker, Terraform, and Jenkins and share best practices, mentor less experienced engineers, and foster strong collaboration across teams.\nStay current: Continuously evaluate emerging MLOps technologies to improve efficiency, scalability, and reliability.\n&#xa0;",
    "salary": null,
    "job_type": null,
    "department": "Technology"
  },
  {
    "id": "744000069977377",
    "title": "Senior Data Scientist – Operations Research (m/f/d) ",
    "company": "Sixt",
    "url": "https://jobs.smartrecruiters.com/sixt/744000069977377",
    "location": "Munich, de",
    "city": "Munich",
    "country": "de",
    "posted_date": "2025-07-11T06:47:49.351Z",
    "updated_time": null,
    "source": "SmartRecruiters:sixt",
    "scraped_at": "2026-01-23T20:56:05.090025",
    "domain": "sixt.com",
    "description": "Join our team of data science and machine learning experts to shape next-generation pricing strategies! We combine cutting-edge techniques - like price elasticity modeling, bid price strategies, and advanced ML - to optimize pricing decisions for millions of customers. Our work directly drives efficient revenue management processes and enhances the user experience.\nWe’re looking for a Senior Data Scientist – Operations Research&#xa0;(m/f/d) with deep revenue management expertise and a solid background in mathematical optimization. Ideal candidates have hands-on experience in dynamic pricing, bid price optimization, and have worked in (or closely with) the airline or car rental industry. Join us in Pullach near Munich!\nYOUR ROLE AT SIXT\nRevenue Management & Price Optimization: You design, develop, and deploy advanced revenue management systems focusing on dynamic pricing and bid price optimization strategies\nOperations Research Modeling: You formulate and solve complex optimization problems (linear, nonlinear, dynamic, stochastic) to maximize revenue and support key decision-making processes\nDemand Forecasting & Customer Willingness-to-Pay: You create and refine forecasting models using time series and machine learning methods to capture customer demand and willingness-to-pay\nAlgorithm & Tool Development: You build and maintain robust algorithms that integrate seamlessly with production systems, ensuring efficiency and scalability\nCross-Functional Collaboration: You work closely with product managers, data engineers, and software developers to deploy end-to-end solutions and continuously improve analytical models\nThought Leadership: You stay current on the latest research in revenue management, operations research, and machine learning; and you provide mentorship and guidance to junior team members\nYOUR SKILLS MATTER\nIndustry Experience: You have 1+ year&#xa0;experience&#xa0;in data science and operations research roles, ideally in car rental, airlines, or similar tr...",
    "salary": null,
    "job_type": null,
    "department": "TECH & Engineering"
  },
  {
    "id": "744000102550261",
    "title": "Senior Data Scientist Workforce Optimization (m/f/d)",
    "company": "Sixt",
    "url": "https://jobs.smartrecruiters.com/sixt/744000102550261",
    "location": "Munich, de",
    "city": "Munich",
    "country": "de",
    "posted_date": "2026-01-09T10:39:10.788Z",
    "updated_time": null,
    "source": "SmartRecruiters:sixt",
    "scraped_at": "2026-01-23T20:56:04.391702",
    "domain": "sixt.com",
    "description": "Join our Data Science team and make the magic happen. We drive business processes like capacity planning and many more with the use of sophisticated algorithms. For this purpose, we design, develop, and maintain state-of-the-art machine learning models and manifold optimization solvers as well as simulation models. Are you ready to join a team where your work will enhance the experience of millions of our customers and have a direct impact on our business success? Apply now and join our journey in Pullach near Munich.\nYOUR ROLE AT SIXT\n&#xa0;\nYou engage with technical and business stakeholders to translate business problems into technical solutions\nYou design, develop, refine and test data science solutions focusing on time series predictions, capacity optimizations and time models\nYou understand operational dynamics and can build models that balance service levels with resource efficiency across both tactical (weeks to months) and strategic (quarterly to annual) planning horizons\nYou stay updated on the latest research in forecasting techniques and optimizations but are not afraid to use classical or greedy solutions when relevant\nYou work closely with business stakeholders, MLOps engineers, and software developers to deploy end-to-end solutions and continuously improve models\n&#xa0;\nYOUR SKILLS MATTER\n&#xa0;\nWorkforce Management and Optimization&#xa0;You have experience in resource planning, scheduling, and capacity optimization (e.g., constraint programming, linear/integer programming, heuristic optimization methods)\nMachine Learning & Forecasting You are proficient in modern ML techniques (time series forecasting, regression, optimization algorithms and reinforcement learning)\nProduct & Strategy Insight You combine analytical depth with business acumen, contributing to product strategy, shaping roadmaps, and ensuring that data science solutions directly influence decision-making and long-term business outcomes\nAnalytical Mindset You show the ability to translate...",
    "salary": null,
    "job_type": null,
    "department": "TECH & Engineering"
  },
  {
    "id": "744000104684846",
    "title": "Machine Learning Engineering Manager (m/f/d) ",
    "company": "Sixt",
    "url": "https://jobs.smartrecruiters.com/sixt/744000104684846",
    "location": "Munich, de",
    "city": "Munich",
    "country": "de",
    "posted_date": "2026-01-21T13:13:37.923Z",
    "updated_time": null,
    "source": "SmartRecruiters:sixt",
    "scraped_at": "2026-01-23T20:56:02.415570",
    "domain": "sixt.com",
    "description": "Our vision is: Transform the world&#xa0;moves, because&#xa0;people expect better.&#xa0;Join our Data Science&#xa0;organization&#xa0;and make the magic happen. We drive business processes like pricing and many more with the use of sophisticated algorithms&#xa0;and building&#xa0;highly scaling algorithms. Apply now and&#xa0;be part of&#xa0;our journey.&#xa0;\nYOUR ROLE AT SIXT\n\nYou will lead and scale our Machine Learning Engineering team that partners with data scientists to transform models into production-grade ML applications on our central MLOps platform&#xa0;\n\nYou will shape ML Engineering standards by establishing best practices, design patterns, and quality benchmarks that enable data scientists to build scalable, maintainable ML solutions&#xa0;\n\nYou will drive technical strategy and architecture across data science, MLOps, and engineering teams, ensuring alignment with business objectives and communicating system designs to tech leadership&#xa0;\n\nYou will bridge platform and practice by translating MLOps platform capabilities into practical guidance for data science teams, while channeling ML engineering requirements back to the MLOps platform team&#xa0;\n\nYou will foster collaboration and excellence by building strong relationships across cross-functional teams, mentoring engineers, and creating a culture of innovation and continuous improvement&#xa0;\nYOUR SKILLS MATTER\n\nProven leadership experience with 3+ years managing machine learning or software engineering teams, ideally across multiple locations, with a track record of building high-performing teams&#xa0;\n\nStrategic technical vision with experience leading complex, multi-stakeholder ML/data science initiatives from concept to production&#xa0;\n\nDeep ML and cloud expertise including hands-on experience with machine learning frameworks, MLOps practices, and AWS cloud services &#xa0;\n\nProduction ML deployment experience with real-world examples of deploying and maintaining large-scale ML systems in producti...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000094613685",
    "title": "Senior Data Analyst (m/f/d) - Shop Analytics - onsite in Hamburg",
    "company": "AboutYou",
    "url": "https://jobs.smartrecruiters.com/aboutyougmbh/744000094613685",
    "location": "Hamburg, de",
    "city": "Hamburg",
    "country": "de",
    "posted_date": "2025-11-20T13:20:54.219Z",
    "updated_time": null,
    "source": "SmartRecruiters:aboutyougmbh",
    "scraped_at": "2026-01-23T20:55:58.553051",
    "domain": "aboutyou.com",
    "description": "Join our&#xa0;Shop Analytics Team&#xa0;within the Customer & Shop Intelligence cluster and directly impact millions of fashion shoppers' experiences. You'll analyze complex e-commerce data to drive product decisions, optimize conversion funnels, and power personalization features that keep users engaged.\nWorking closely with Product Owners and cross-functional teams, you'll provide full-cycle A/B test analytical support, create tracking concepts, and translate user behavior and shop performance insights into actionable business recommendations.\n&#xa0;\nWhat you will do\nConduct in-depth analyses on shop user behavior to uncover actionable insights\nDrive shop optimization and growth by providing analytical insights to Business and Product Owners and influencing product enhancements\nShape the success metrics for our shop, developing and monitoring KPIs that directly impact millions of users' shopping experiences\nProvide full-cycle A/B test analytical support to optimize shop performance\nDefine tracking requirements and support QA of tracking implementations to ensure data accuracy and reliability\nDesign and implement advanced dashboards, enabling self-service analytics across the organization\nCollaborate with multiple stakeholders across the organization to answer shop-related questions with analytical insights, supporting business decision-making\n&#xa0;\nWho you are\nAdvanced proficiency in SQL for complex data analysis and querying large datasets\nExpertise in e-commerce KPIs and funnel analysis\nSolid understanding of web analytics and experience working with frontend tracking data (GA4 experience is a plus)\nExperience with data visualization tools (e.g., Looker Studio, Tableau, or similar) to create compelling dashboards and reports\nAdvanced knowledge of A/B testing methodology and statistical analysis for experiment design and interpretation\nStrong understanding of customer segmentation and cohort analysis in the&#xa0; e-commerce context\nProactive and self-driven, with...",
    "salary": null,
    "job_type": null,
    "department": "TECH Standard"
  },
  {
    "id": "744000097993562",
    "title": "Senior Financial Data Analyst (m/f/d)",
    "company": "AboutYou",
    "url": "https://jobs.smartrecruiters.com/aboutyougmbh/744000097993562",
    "location": "Hamburg, de",
    "city": "Hamburg",
    "country": "de",
    "posted_date": "2025-12-10T09:23:52.632Z",
    "updated_time": null,
    "source": "SmartRecruiters:aboutyougmbh",
    "scraped_at": "2026-01-23T20:55:57.939063",
    "domain": "aboutyou.com",
    "description": "Our Financial Data and Automation Team drives the digital transformation of ABOUT YOU's Finance organization, collaborating closely with diverse teams across the company. They go beyond reporting and automation, unlocking value from Germany’s first e-commerce unicorn's extensive data ecosystem - spanning over €1.9 billion in group revenue, 4,000+ brands, and multiple revenue streams.\n\nAs a Senior Financial Data Analyst (m/f/d), you will play a key role in shaping our data and reporting landscape. You transform complex financial and operational data into actionable insights and enable data-driven decision-making across the organization.\nResponsibilities\nDevelop robust data models based on financial and operational data to enable complex analyses for our Finance teams\nConduct advanced quantitative analyses of large, multi-source data sets, aligning operational and transactional accounting data with financial reporting standards\nLead end-to-end data-driven financial reporting projects using descriptive, diagnostic, and predictive analytics to deliver actionable insights to stakeholders\nPerform advanced exploratory data analysis (EDA) and data modeling to uncover underlying structures and relationships in the data - even in the absence of explicit business context\nAct as a trusted partner and thought leader on data and finance topics\nDesign and implement interactive dashboards in Google BigQuery and Looker Studio\nRequirements\nUniversity degree in Business Informatics, Finance, Economics, Business Administration, or a related field\nSeveral years of professional experience in Data Analytics, ideally with a financial focus\nStrong proficiency in data modeling and exploratory analysis using SQL and Python\nProven ability to interpret complex data, identify root causes, and communicate findings clearly to both technical and non-technical audiences\nHigh analytical capability, curiosity, and attention to detail\nProactive, solution-oriented mindset with a strong sense of ownershi...",
    "salary": null,
    "job_type": null,
    "department": "BUSINESS Standard"
  },
  {
    "id": "744000101320075",
    "title": "Data Analyst (m/w/d) - Tracking Data Solutions - onsite in Hamburg",
    "company": "AboutYou",
    "url": "https://jobs.smartrecruiters.com/aboutyougmbh/744000101320075",
    "location": "Hamburg, de",
    "city": "Hamburg",
    "country": "de",
    "posted_date": "2026-01-02T10:51:52.906Z",
    "updated_time": null,
    "source": "SmartRecruiters:aboutyougmbh",
    "scraped_at": "2026-01-23T20:55:57.318486",
    "domain": "aboutyou.com",
    "description": "We are currently looking for a skilled & passionate Data Analyst (m/f/d) to become part of our Tracking Data Solutions Team at ABOUT YOU!\nThe Tracking Data Solutions team is part of the Marketing Intelligence and Technology team, which enables the online marketing of ABOUT YOU to manage over 30 marketing channels across multiple countries by automating the underlying processes and management of external marketing tools. We constantly monitor the correct setup by maintaining automated checks as well as real-time monitoring solutions.\nWhat you will do\nMaintain our end-to-end tracking environment (e.g. in GCP) and its associated data pipelines (e.g., via Airflow) to ensure robust and reliable data availability.\nTroubleshoot and resolve tracking bugs and data discrepancies, ensuring the highest data quality for analysis and reporting.\nProvide 1st-level support to internal stakeholders, providing expertise and support regarding tracking data and data usage.\nDesign, create, and maintain accurate reports, dashboards, and in-depth analyses that translate raw data into actionable insights.\nDrive conceptual work, defining both the business and technical requirements for new tracking features and implementations.\nDocument tracking requirements and their technical implementation (e.g., via JSON Schema) to ensure clarity and consistency across the organization\nWho you are\nAdvanced SQL/GBQ skills and strong experience analyzing large datasets.\nDeep understanding of e-commerce KPIs, funnel analysis, and scalable tracking data infrastructures.\nHands-on experience with web and app analytics, tracking data, and data visualization tools (e.g. Looker Studio).\nAffinity for programming (JavaScript/TypeScript, Python) and applying it to data-related use cases.\nAdvanced knowledge of A/B testing and statistical methods for experiment design and interpretation.\nSelf-driven, proactive, and pragmatic, with the ability to manage projects end to end and deliver data-driven solutions.\nStrong atte...",
    "salary": null,
    "job_type": null,
    "department": "TECH Standard"
  },
  {
    "id": "744000104913221",
    "title": "(Senior) Data Engineer (m/f/d) - Finance Tech",
    "company": "AboutYou",
    "url": "https://jobs.smartrecruiters.com/aboutyougmbh/744000104913221",
    "location": "Hamburg, de",
    "city": "Hamburg",
    "country": "de",
    "posted_date": "2026-01-22T12:54:48.349Z",
    "updated_time": null,
    "source": "SmartRecruiters:aboutyougmbh",
    "scraped_at": "2026-01-23T20:55:56.742994",
    "domain": "aboutyou.com",
    "description": "Our online fashion store ABOUT YOU is one of the fastest growing eCommerce players in Europe and has already won several awards. As a fashion and technology company, we work together towards our goal of making the shopping experience more inspiring and personal for our customers.\nWe are currently looking for a skilled & passionate Data Engineer (m/f/d)&#xa0;to join our Commerce Finance Tech Circle Cluster at ABOUT YOU!&#xa0;Our ABOUT YOU Commerce Finance Tech Circle Cluster is responsible for connecting to the ABOUT YOU Commerce ERP solution to ensure the regulatory compliance of our commerce business.&#xa0;Furthermore, the team is responsible for building an ETL platform used by other stakeholders and the team itself, such as for generating financial reports.\n&#xa0;\nWhat you will do\nDevelopment and evaluation of statistical models and algorithms for complex marketing issues\nIndependent analysis of complex data with the aim of identifying new insights and potential for performance optimization\nIdentifying direct and indirect correlations between relevant key figures and deriving recommendations for action\nLinking and using the content of data from tracking systems and other reporting sources\nSupport in the further development and testing of performance-relevant (attribution) models\nInitiation and further development of prediction and classification models using machine learning algorithms\n&#xa0;\nWho you are\nYou bring at least two years of hands-on experience in Data Science, ideally in an agency, e-commerce, or performance-driven environment\nYou have initial experience with machine learning algorithms and a solid understanding of common data analysis methods such as regression and clustering; knowledge of marketing attribution models is a strong plus\nYou are proficient in SQL and either Python or R (both are a bonus)\nExperience with Dagster or comparable data orchestration tools is highly appreciated\nYou are naturally curious, enjoy exploring new topics, statistical...",
    "salary": null,
    "job_type": null,
    "department": "TECH Standard"
  },
  {
    "id": "744000104916210",
    "title": "Staff Data Engineer (m/f/d) - Finance Tech",
    "company": "AboutYou",
    "url": "https://jobs.smartrecruiters.com/aboutyougmbh/744000104916210",
    "location": "Hamburg, de",
    "city": "Hamburg",
    "country": "de",
    "posted_date": "2026-01-22T12:59:53.855Z",
    "updated_time": null,
    "source": "SmartRecruiters:aboutyougmbh",
    "scraped_at": "2026-01-23T20:55:56.022739",
    "domain": "aboutyou.com",
    "description": "Our online fashion store ABOUT YOU is one of the fastest growing eCommerce players in Europe and has already won several awards. As a fashion and technology company, we work together towards our goal of making the shopping experience more inspiring and personal for our customers.\nWe are currently looking for a skilled & passionate Data Engineer (m/f/d)&#xa0;to join our Commerce Finance Tech Circle Cluster at ABOUT YOU!&#xa0;Our ABOUT YOU Commerce Finance Tech Circle Cluster is responsible for connecting to the ABOUT YOU Commerce ERP solution to ensure the regulatory compliance of our commerce business.&#xa0;Furthermore, the team is responsible for building an ETL platform used by other stakeholders and the team itself, such as for generating financial reports.\n&#xa0;\nWhat you will do\nDevelopment and evaluation of statistical models and algorithms for complex marketing issues\nIndependent analysis of complex data with the aim of identifying new insights and potential for performance optimization\nIdentifying direct and indirect correlations between relevant key figures and deriving recommendations for action\nLinking and using the content of data from tracking systems and other reporting sources\nSupport in the further development and testing of performance-relevant (attribution) models\nInitiation and further development of prediction and classification models using machine learning algorithms\n&#xa0;\nWho you are\nYou bring at least seven years of hands-on experience in Data Science, ideally in an agency, e-commerce, or performance-driven environment\nYou have initial experience with machine learning algorithms and a solid understanding of common data analysis methods such as regression and clustering; knowledge of marketing attribution models is a strong plus\nYou are proficient in SQL and either Python or R (both are a bonus)\nExperience with Dagster or comparable data orchestration tools is highly appreciated\nYou are naturally curious, enjoy exploring new topics, statistic...",
    "salary": null,
    "job_type": null,
    "department": "TECH Standard"
  },
  {
    "id": "8174480002",
    "title": "Data Analyst - Marketing Strategy & Intelligence",
    "company": "Trivago",
    "url": "https://careers.trivago.com/job/r8174480002?gh_jid=8174480002",
    "location": "Düsseldorf",
    "city": "Düsseldorf",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-27T03:20:01-05:00",
    "source": "Greenhouse:trivago",
    "scraped_at": "2026-01-23T20:55:30.935976",
    "domain": "trivago.com",
    "description": "When travelers are searching for a hotel, we want the obvious choice to be trivago! Our leading metasearch engine is super fast and constantly optimized - enabling millions of travelers to compare hotel prices from hundreds of booking sites and find great deals in just a few clicks. We use cutting-edge technology, real-time auction, and machine learning techniques with petabytes of data to create an experience - time and money saved! In the lively city of Düsseldorf, we seize opportunities to learn everyday, innovate, and make an enduring mark on the travel industry. At trivago you will find those who aren’t afraid of change but rather embrace it, turning every challenge into a pathway for growth. Join trivago, work with a great team, and grow with us!\n\nJoin us in making a difference\n\nThe Marketing Strategy and Intelligence team at trivago is a unique blend of data and business expertise, steering key marketing decisions through impactful data products, actionable insights, and deep market understanding. As a Data Analyst, you will play a critical role in shaping and executing trivago's global marketing strategy. Your work will empower teams to make informed choices that drive growth, efficiency, and innovation across all marketing channels.\n\nYou will collaborate closely with data scientists, analysts, engineers as well as growth managers and business stakeholders to transform complex data into real business value. Together, you will design advanced analytics solutions, develop insightful dashboards and reports, and uncover strategic opportunities through in-depth research, modeling and experimentation. By providing clear, actionable insights, you will help optimize campaigns, identify market trends, and guide the decision-making process.\n\nIf this sounds like you, read on &amp; apply today!\n\nHow you’ll make an impact:\n\nTranslate data into actionable insights that shape our marketing strategy and investments.\n\nPartner with marketing stakeholders to identify opportuni...",
    "salary": null,
    "job_type": null,
    "department": "Marketing Strategy and Intelligence (Andrei Duchko)"
  },
  {
    "id": "7529145",
    "title": "Senior Data Scientist, Supply Data Products",
    "company": "GetYourGuide",
    "url": "https://getyourguide.careers/jobs/7529145?gh_jid=7529145",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-27T05:54:31-05:00",
    "source": "Greenhouse:getyourguide",
    "scraped_at": "2026-01-23T20:55:30.797831",
    "domain": "getyourguide.com",
    "description": "Change the way the world travels\n\nBe part of the GetYourGuide journey and connect people with unforgettable travel experiences worldwide. Since 2009, millions of travelers have booked unique activities with us in over 12,000 cities. Our headquarters in Berlin is supported by 16 other local offices across the globe.&nbsp;\n\nReady to join a diverse community of over 850 fellow explorers dedicated to revolutionizing the travel experience industry? Check out our careers site to learn more.\n\nTeam mission\n\nOur mission in the Supply Tech group is to empower our activity providers to deliver unforgettable and seamless experiences to GetYourGuide’s customers at scale. We build AI and ML systems that curate a trusted, high‑quality catalog, elevate content quality with LLMs for generation, structuring, and evaluation, and proactively scout high‑value inventory to grow the marketplace in partnership with tech and business teams.\n\nAs a valued member of our inclusive and dynamic team, you will collaborate closely with fellow Data Scientists, MLOps Engineers, and business stakeholders continuously innovating to enhance the quality of our marketplace catalog. Together, we strive to make every travel experience unforgettable.\n\nYour mission:\n\nDevelop innovative data products that not only enable suppliers to delight our customers but also drive the success of our company.\n\nTake full ownership of projects, guiding them from the initial business challenge to the deployment of production code. This includes:\n\nAnalyzing large datasets to uncover meaningful insights\n\nBuilding and maintaining robust data pipelines\n\nEstablishing rigorous evaluation and monitoring strategies, as well as in-production guardrails. Monitoring and optimizing data products after deployment\n\nContribute to the development of our machine learning infrastructure and help establish best practices that will shape our future.\n\nWork closely with cross-functional technology and business teams, leveraging your unique perspe...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "7385709",
    "title": "Data Engineer (Java/Scala)",
    "company": "GetYourGuide",
    "url": "https://getyourguide.careers/jobs/7385709?gh_jid=7385709",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-27T05:54:29-05:00",
    "source": "Greenhouse:getyourguide",
    "scraped_at": "2026-01-23T20:55:30.796919",
    "domain": "getyourguide.com",
    "description": "Change the way the world travels\n\nJoin the GetYourGuide journey to connect people with unforgettable travel experiences around the world. Millions look to us for unique activities they can trust, and it’s all powered by our commitment to make every single journey extraordinary - including yours.&nbsp;\n\nReady to unlock your potential with a community of fellow explorers? Find your next role at our Berlin HQ or one of our local offices around the globe, from New York to Bangkok. Head to&nbsp;getyourguide.careers to take the first step.\n\nGetYourGuide is the place to book the best experiences in destinations across the globe. We are now seeking a full-time Data Engineer for the Core Data Platform at our Berlin office.\n\nTeam mission\n\nThe Core Data Platform team is at the heart of GetYourGuide’s data landscape, empowering the entire engineering department and enabling data-driven innovation across the company. We architect, build, and operate the foundational data platform that powers everything from AB experimentation and AI-powered use cases to advanced analytics and business intelligence.\n\nOur platform processes over 600 million events daily and manages multiple petabytes of data, while ensuring that the data is accessible, reliable, and efficient to query for all teams. We provide robust, scalable solutions for real-time clickstream ingestion, cost-efficient data lake management, and seamless ETL pipeline development—making it easy for analysts, BI engineers, and developers to work with data at scale.\n\nWe work with a modern tech stack, including Apache Airflow, DBT, Databricks, Kafka, and Spark, while fostering a culture of learning and collaboration. Joining our team means tackling complex technical challenges, driving impact across GetYourGuide, and continuously growing your skills in a supportive environment.\n\nYour mission\n\nDesign, build, and evolve our core data and analytics platform, enabling seamless scaling to multiple petabytes of data.\n\nOptimize and enhance ...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "7366032",
    "title": "Senior Data Analyst (f/m/d)",
    "company": "Contentful",
    "url": "https://job-boards.greenhouse.io/contentful/jobs/7366032",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-24T19:20:42-05:00",
    "source": "Greenhouse:contentful",
    "scraped_at": "2026-01-23T20:55:30.630337",
    "domain": "contentful.com",
    "description": "About the Opportunity\n\nWe are seeking an experienced Senior Data Analyst (f/m/d) to help us quantify success across our product, identify and prioritise opportunities for product development, and find patterns in behaviour that can be used to drive conversations with our customers about how they can get the most out of our Product.&nbsp;\n\nYou will own the analytical framework that links product adoption to customer impact and business success. You will collaborate broadly across Product Development and Customer Experience teams to continuously strengthen and scale this framework. Your primary focus will be on designing and implementing repeatable, scalable analytical solutions that inform high-stakes strategic decisions across the organization.&nbsp;\n\nThe ideal candidate possesses deep fluency in data manipulation and statistical methods, combined with a strong commercial mindset. You must be adept at moving beyond descriptive analysis to distill actionable recommendations, translating complex data stories into clear, impactful insights for both technical and non-technical stakeholders.\n\nWhile ad-hoc deep-dive analysis will be required, the early emphasis is on establishing robust, automated measurement systems that guide decisions throughout our business.\n\nWhat to expect?&nbsp;\n\nFramework Ownership: Design, implement, and maintain the end-to-end analytical frameworks linking user behavior, customer value, and commercial outcomes (e.g., retention, expansion).\n\nAnalytical Frameworks: Design and maintain analytical frameworks (e.g., funnel analysis, cohort analysis, statistical modeling) to provide reliable and reproducible measurement of product performance.\n\nStrategic Analysis &amp; Insight: Perform deep-dive quantitative analysis utilizing statistical methods to measure the drivers of product success, operational efficiency, and customer experience.\n\nData Storytelling: Clearly tell the story of your insights for technical and business stakeholders, distilling compl...",
    "salary": null,
    "job_type": null,
    "department": "Product"
  },
  {
    "id": "6301453003",
    "title": "Senior Software Engineer - Python/AI/ML Infrastructure",
    "company": "Celonis",
    "url": "https://job-boards.greenhouse.io/celonis/jobs/6301453003?gh_jid=6301453003",
    "location": "Munich, Germany",
    "city": "Munich",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-12T09:20:14-05:00",
    "source": "Greenhouse:celonis",
    "scraped_at": "2026-01-23T20:55:30.438372",
    "domain": "celonis.com",
    "description": "We're Celonis, the global leader in Process Intelligence technology and one of the world's fastest-growing SaaS firms. We believe there is a massive opportunity to unlock productivity by placing AI, data and intelligence at the core of business processes - and for that, we need your help. Care to join us?\nThe Team\n\nCelonis AI Group (CeloAI) is dedicated to developing state-of-the-art AI/ML technologies for Celonis products and empower enterprises and institutions to make intelligent business decisions and achieve operational excellence. Our dual mission focuses on both the immediate term goals of designing and implementing advanced AI/ML product features and solutions for our customers and the long term goals of establishing competitive advantages of Celonis Process Intelligence platform.\n\nWe are a global organization with presence in both Germany and the US. CeloAI Germany has its presence in Munich, Darmstadt, and Aachen.\n\nThe Role\n\nAs a Senior Software Engineer on the AI/ML Infrastructure team, you will play a key role in designing, developing, and deploying the infrastructure that supports our AI/ML/LLM initiatives. You will collaborate with software engineers, machine learning engineers, and platform infrastructure engineers to deliver scalable and high-quality solutions.\n\nYou will be responsible for architecting and implementing robust technical components that drive the next generation of Process Intelligence. These components will leverage technologies such as computer vision, natural language processing, data mining, recommendation systems, knowledge bases, and business intelligence.\n\nThe work you’ll do\n\nUnderstand and translate business and technical requirements into effective solutions.\n\nDesign and develop highly scalable and performant systems.\n\nBuild and maintain low-latency infrastructure for serving AI/ML/LLM models.\n\nDevelop intelligent techniques for integrating and processing large-scale enterprise operational data.\n\nCreate and maintain APIs, libr...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "7559835003",
    "title": "Associate Applied AI Engineer (DACH) - Orbit Program",
    "company": "Celonis",
    "url": "https://job-boards.greenhouse.io/celonis/jobs/7559835003?gh_jid=7559835003",
    "location": "Munich, Germany",
    "city": "Munich",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-12T09:20:14-05:00",
    "source": "Greenhouse:celonis",
    "scraped_at": "2026-01-23T20:55:30.437616",
    "domain": "celonis.com",
    "description": "We're Celonis, the global leader in Process Intelligence technology and one of the world's fastest-growing SaaS firms. We believe there is a massive opportunity to unlock productivity by placing AI, data and intelligence at the core of business processes - and for that, we need your help. Care to join us?\nLocation: Madrid for an onboarding period of 2 years and a planned relocation to Munich/Zurich after. Customer base will be in the DACH region, involving travel to meet clients in person.\n\nThe Team\n\nAs an Associate Applied AI Engineer, you are part of our Value Engineering team and are the trusted advisor for customers working on the intersection of technology and business. As a so-called Value Engineer (VE), you partner with sales and customers to create compelling and innovative technical solutions to critical business problems leveraging cutting edge (AI) capabilities within our Celonis Process Intelligence Platform. A great VE understands the customer, the technology, and the sales cycle making it what may be the most interesting, challenging, and fulfilling role in Enterprise Software\n\nYou will be joining the Global VE Center of Excellence which is an international, diverse, and dynamic organization at the core of the Celonis Value Engineering team supporting our local field teams. As a team, we enjoy working in a fast-paced environment and share a sense of belonging to a community that wants to learn and grow together. The team culture is one based on building trust, continuous development, and improvement through coaching &amp; mentoring.&nbsp;\n\nThe Role\n\nTalented individuals launch their careers in the enterprise software world by joining the Orbit Graduate Program as an Associate Value Engineer.\n\nThe 12-month program is a unique experience to fast start your career in the SaaS Industry that highlights hands-on learning, mentorship, and a team culture where we rely on each other to learn, grow and achieve. The program is designed to develop essential VE ski...",
    "salary": null,
    "job_type": null,
    "department": "Value Engineering"
  },
  {
    "id": "7189283",
    "title": "Senior Machine Learning Software Engineer",
    "company": "Free Now",
    "url": "https://job-boards.greenhouse.io/freenow/jobs/7189283",
    "location": "Hamburg",
    "city": "Hamburg",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2025-12-09T12:21:50-05:00",
    "source": "Greenhouse:freenow",
    "scraped_at": "2026-01-23T20:55:30.184778",
    "domain": "free-now.com",
    "description": "Location: We are flexible! Come and join us either in Hamburg, Berlin, Barcelona or Athens.&nbsp;\n\nFreenow empowers smarter mobility decisions helping people to move freely and cities to thrive.\n\nThe Freenow marketplace is a real-time, two-sided platform connecting riders and drivers. Its efficiency and scalability are powered by a sophisticated ecosystem of Machine Learning systems spanning key domains such as Pricing, Allocation, and Marketplace Fraud.&nbsp;\n\nIn this role, you’ll help drive our MLOps platform online Inference and real-time Feature Engineering capabilities, across multiple use cases that shape not only our business but also the daily experiences of our users.\n\nBe ready to work in a multinational, diverse, highly motivated and collaborative team of passionate developers who strive for excellence and like to have fun.&nbsp; Are you ready for your next ride?\n\nYOUR DAILY ADVENTURES WILL INCLUDE:\n\nDeveloping and maintaining high-performance, data-driven systems in a distributed infrastructure that impact our marketplace performance.\n\nAdvancing the state of the art in real-time feature engineering and online feature serving across all marketplace use cases.\n\nBuilding and scaling an online feature store that unifies serving and training workflows.\n\nMaintaining, improving, and monitoring robust CI/CD pipelines across testing and production environments.\n\nImplementing and optimizing solutions to some of our most business critical problems as part of a cross functional team consisting of Data and Software Engineering professionals.\n\nCollaborating with Machine Learning Engineers, Data Scientists, Data Platform Engineers to advance MLOps practices within Freenow Marketplace.\n\nOur Techstack:&nbsp;Python | Java | Kafka | Flink | Kubernetes | Databricks | AWS &amp;&nbsp;more\n\nTO BE SUCCESSFUL IN THIS ROLE:\n\nYou have a strong software engineering background, ideally with expertise in Python and familiarity with JVM-based ecosystems such as Java or Kotlin.\n\nYou bri...",
    "salary": null,
    "job_type": null,
    "department": "Tech"
  },
  {
    "id": "7391030",
    "title": "Senior Machine Learning Software Engineer",
    "company": "Free Now",
    "url": "https://job-boards.greenhouse.io/freenow/jobs/7391030",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2025-12-09T12:21:50-05:00",
    "source": "Greenhouse:freenow",
    "scraped_at": "2026-01-23T20:55:30.184547",
    "domain": "free-now.com",
    "description": "Location: We are flexible! Come and join us either in Hamburg, Berlin, Barcelona or Athens.&nbsp;\n\nFreenow empowers smarter mobility decisions helping people to move freely and cities to thrive.\n\nThe Freenow marketplace is a real-time, two-sided platform connecting riders and drivers. Its efficiency and scalability are powered by a sophisticated ecosystem of Machine Learning systems spanning key domains such as Pricing, Allocation, and Marketplace Fraud.&nbsp;\n\nIn this role, you’ll help drive our MLOps platform online Inference and real-time Feature Engineering capabilities, across multiple use cases that shape not only our business but also the daily experiences of our users.\n\nBe ready to work in a multinational, diverse, highly motivated and collaborative team of passionate developers who strive for excellence and like to have fun.&nbsp; Are you ready for your next ride?\n\nYOUR DAILY ADVENTURES WILL INCLUDE:\n\nDeveloping and maintaining high-performance, data-driven systems in a distributed infrastructure that impact our marketplace performance.\n\nAdvancing the state of the art in real-time feature engineering and online feature serving across all marketplace use cases.\n\nBuilding and scaling an online feature store that unifies serving and training workflows.\n\nMaintaining, improving, and monitoring robust CI/CD pipelines across testing and production environments.\n\nImplementing and optimizing solutions to some of our most business critical problems as part of a cross functional team consisting of Data and Software Engineering professionals.\n\nCollaborating with Machine Learning Engineers, Data Scientists, Data Platform Engineers to advance MLOps practices within Freenow Marketplace.\n\nOur Techstack:&nbsp;Python | Java | Kafka | Flink | Kubernetes | Databricks | AWS &amp;&nbsp;more\n\nTO BE SUCCESSFUL IN THIS ROLE:\n\nYou have a strong software engineering background, ideally with expertise in Python and familiarity with JVM-based ecosystems such as Java or Kotlin.\n\nYou bri...",
    "salary": null,
    "job_type": null,
    "department": "Tech"
  },
  {
    "id": "6920354",
    "title": "Senior Machine Learning Engineer ",
    "company": "Free Now",
    "url": "https://job-boards.greenhouse.io/freenow/jobs/6920354",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2025-12-09T12:21:50-05:00",
    "source": "Greenhouse:freenow",
    "scraped_at": "2026-01-23T20:55:30.184295",
    "domain": "free-now.com",
    "description": "Location: We are flexible! Come and join us either in Hamburg, Berlin, Barcelona or Athens\n\nFreenow empowers smarter mobility decisions helping people to move freely and cities to thrive.\n\nThe Freenow marketplace is a real-time, two-sided platform connecting riders and drivers. Its efficiency and scalability are powered by a sophisticated ecosystem of Machine Learning systems spanning key domains such as Pricing, Allocation, and Marketplace Fraud.\n\nIn this role, you’ll help advance the state of the art of our Marketplace MLOps platform, working on impactful use cases that shape not only our business but also the daily experiences of our users.\n\nBe ready to work in a multinational, diverse, highly motivated and collaborative team of passionate developers who strive for excellence and like to have fun.&nbsp; Are you ready for your next ride?\n\nYOUR DAILY ADVENTURES WILL INCLUDE:\n\nDeveloping and maintaining high-performance, data-driven systems in a distributed infrastructure that impact our marketplace performance.\n\nStreamlining online serving of traditional ML enabling faster A/B tests and reducing go-to-market&nbsp;\n\nEnhancing our MLOps platform capabilities to support cutting edge AI algorithms\n\nEstablishing ML Observability best practices enabling Self-healing system and automatic data drift detection\n\nImplementing and optimizing solutions to some of our most business critical problems as part of a cross functional team consisting of Data and Software Engineering professionals.\n\nCollaborating with other Machine Learning Engineers, Data Scientists and Data Platform Engineers to drive the state of MLOps in Marketplace and FreeNow.\n\nOur Tech Stack: Python | Airflow | Java | Kubernetes | Kafka | Databricks | AWS &amp; more\n\nTO BE SUCCESSFUL IN THIS ROLE:\n\nYou are experienced in training, deploying, serving and observing Statistical/Machine Learning models on large-scale datasets in production.\n\nYou have experience developing and maintaining high throughput microservice...",
    "salary": null,
    "job_type": null,
    "department": "Data & Analytics"
  },
  {
    "id": "6886419",
    "title": "Senior Machine Learning Engineer",
    "company": "Free Now",
    "url": "https://job-boards.greenhouse.io/freenow/jobs/6886419",
    "location": "Hamburg",
    "city": "Hamburg",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2025-12-09T12:21:50-05:00",
    "source": "Greenhouse:freenow",
    "scraped_at": "2026-01-23T20:55:30.184048",
    "domain": "free-now.com",
    "description": "Location: We are flexible! Come and join us either in Hamburg, Berlin, Barcelona or Athens\n\nFreenow empowers smarter mobility decisions helping people to move freely and cities to thrive.\n\nThe Freenow marketplace is a real-time, two-sided platform connecting riders and drivers. Its efficiency and scalability are powered by a sophisticated ecosystem of Machine Learning systems spanning key domains such as Pricing, Allocation, and Marketplace Fraud.\n\nIn this role, you’ll help advance the state of the art of our Marketplace MLOps platform, working on impactful use cases that shape not only our business but also the daily experiences of our users.\n\nBe ready to work in a multinational, diverse, highly motivated and collaborative team of passionate developers who strive for excellence and like to have fun.&nbsp; Are you ready for your next ride?\n\nYOUR DAILY ADVENTURES WILL INCLUDE:\n\nDeveloping and maintaining high-performance, data-driven systems in a distributed infrastructure that impact our marketplace performance.\n\nStreamlining online serving of traditional ML enabling faster A/B tests and reducing go-to-market&nbsp;\n\nEnhancing our MLOps platform capabilities to support cutting edge AI algorithms\n\nEstablishing ML Observability best practices enabling Self-healing system and automatic data drift detection\n\nImplementing and optimizing solutions to some of our most business critical problems as part of a cross functional team consisting of Data and Software Engineering professionals.\n\nCollaborating with other Machine Learning Engineers, Data Scientists and Data Platform Engineers to drive the state of MLOps in Marketplace and FreeNow.\n\nOur Tech Stack: Python | Airflow | Java | Kubernetes | Kafka | Databricks | AWS &amp; more\n\nTO BE SUCCESSFUL IN THIS ROLE:\n\nYou are experienced in training, deploying, serving and observing Statistical/Machine Learning models on large-scale datasets in production.\n\nYou have experience developing and maintaining high throughput microservice...",
    "salary": null,
    "job_type": null,
    "department": "Data & Analytics"
  },
  {
    "id": "7025714",
    "title": "Product Data Analyst",
    "company": "Free Now",
    "url": "https://job-boards.greenhouse.io/freenow/jobs/7025714",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2025-12-09T12:21:50-05:00",
    "source": "Greenhouse:freenow",
    "scraped_at": "2026-01-23T20:55:30.183732",
    "domain": "free-now.com",
    "description": "Location: We are flexible! Come and join us either in Hamburg, Berlin, Barcelona or Athens.&nbsp;\n\nFREENOW empowers smarter mobility decisions helping people to move freely and cities to thrive.\n\nWe are looking for a Product Data Analyst (m/f/d) to collaborate with our product squads, using data to build a flawless product experience. You will join the Product Data Team and work closely with PMs, designers, UX researchers, developers, and other data functions to discover new product opportunities, validate hypotheses, and launch valuable features to our users.\n\nBe ready to work in a multinational, diverse, highly motivated and collaborative team of passionate analysts who strive for excellence and like to have fun.&nbsp; Are you ready for your next ride?\n\nYOUR DAILY ADVENTURES WILL INCLUDE:\n\nProviding&nbsp; expertise and collaborating with stakeholders to generate new product feature ideas and improvements, and also estimating the potential impact of planned projects.\n\nContinuously engaging with the product squads to gain an understanding of the problems that need to be solved, gathering requirements, and defining the best deliverables to match the business needs.\n\nHaving full ownership of your analysis, from ideation to communication of results and making recommendations to all levels of the company including senior management and prioritization committees.\n\nDeveloping and evaluating A/B test experiments or other analyses to measure and report the performance of released features, ensuring that we are launching the correct changes and features in our apps.\n\nWorking closely with our developers and data engineers to create and capture data that is aligned with the business logic and allows modeling and analysis.\n\nBeing involved throughout the complete product lifecycle in order to guarantee a data-driven process.\n\nBringing new insights and championing them using your analyses, dashboards, and good storytelling! We value ideas over hierarchy, and there's always a new ...",
    "salary": null,
    "job_type": null,
    "department": "Data & Analytics"
  },
  {
    "id": "7025691",
    "title": "Product Data Analyst",
    "company": "Free Now",
    "url": "https://job-boards.greenhouse.io/freenow/jobs/7025691",
    "location": "Hamburg ",
    "city": "Hamburg ",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2025-12-09T12:21:50-05:00",
    "source": "Greenhouse:freenow",
    "scraped_at": "2026-01-23T20:55:30.183466",
    "domain": "free-now.com",
    "description": "Location: We are flexible! Come and join us either in Hamburg, Berlin, Barcelona or Athens.&nbsp;\n\nFREENOW empowers smarter mobility decisions helping people to move freely and cities to thrive.\n\nWe are looking for a Product Data Analyst (m/f/d) to collaborate with our product squads, using data to build a flawless product experience. You will join the Product Data Team and work closely with PMs, designers, UX researchers, developers, and other data functions to discover new product opportunities, validate hypotheses, and launch valuable features to our users.\n\nBe ready to work in a multinational, diverse, highly motivated and collaborative team of passionate analysts who strive for excellence and like to have fun.&nbsp; Are you ready for your next ride?\n\nYOUR DAILY ADVENTURES WILL INCLUDE:\n\nProviding&nbsp; expertise and collaborating with stakeholders to generate new product feature ideas and improvements, and also estimating the potential impact of planned projects.\n\nContinuously engaging with the product squads to gain an understanding of the problems that need to be solved, gathering requirements, and defining the best deliverables to match the business needs.\n\nHaving full ownership of your analysis, from ideation to communication of results and making recommendations to all levels of the company including senior management and prioritization committees.\n\nDeveloping and evaluating A/B test experiments or other analyses to measure and report the performance of released features, ensuring that we are launching the correct changes and features in our apps.\n\nWorking closely with our developers and data engineers to create and capture data that is aligned with the business logic and allows modeling and analysis.\n\nBeing involved throughout the complete product lifecycle in order to guarantee a data-driven process.\n\nBringing new insights and championing them using your analyses, dashboards, and good storytelling! We value ideas over hierarchy, and there's always a new ...",
    "salary": null,
    "job_type": null,
    "department": "Data & Analytics"
  },
  {
    "id": "8128496002",
    "title": "Senior Machine Learning Engineer I",
    "company": "SumUp",
    "url": "https://sumup.com/careers/positions/8128496002?gh_jid=8128496002",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-14T08:07:49-05:00",
    "source": "Greenhouse:sumup",
    "scraped_at": "2026-01-23T20:55:29.969960",
    "domain": "sumup.com",
    "description": "About the team:\n\nWithin the Global Operations organisation, our mission is to build the best customer experience in the fintech industry by delivering an effortless customer experience to all our merchants. We are seeking a skilled and passionate Machine Learning Engineer to join our talented AI team and contribute to the development of AI models and algorithms that will drive our customer support service to new heights.\n\nAs a Machine Learning Engineer at SumUp, you will be responsible for building and optimizing state-of-the-art AI models and algorithms. Your expertise with machine learning, deep learning, and AI models will be crucial in driving the success of our AI-driven initiatives. You will work closely with cross-functional teams, including backend engineers, data scientists, and product managers, to translate business requirements into innovative AI solutions. Your contributions will shape the future of our support products and help us stay at the forefront of technological advancements in the field of AI.\n\nWhat you’ll do\n\nArchitect, design, develop, and deploy our AI solutions and systems in production environments, ensuring reliability, high performance, and scalability.\n\nCollaborate and communicate closely with data scientists, product managers, developers, and other business stakeholders to bring state-of-the-art AI solutions to Customer Support, enhancing customer experience and improving operational efficiency.\n\nDevelop and maintain ML infrastructure and pipelines to support efficient data processing, model training, and serving.\n\nOptimize and fine-tune machine learning models to improve accuracy, efficiency, and scalability.\n\nCollect, preprocess, and clean large text datasets to ensure high-quality input for model training and evaluation.\n\nEmbrace software development principles, best practices, and industry standards, including version control, CI/CD processes, and unit testing frameworks as your day-to-day work.\n\nCollaborate with cross-functional t...",
    "salary": null,
    "job_type": null,
    "department": "Data Engineer/Scientist"
  },
  {
    "id": "8309766002",
    "title": "Senior Analytics Engineer",
    "company": "SumUp",
    "url": "https://sumup.com/careers/positions/8309766002?gh_jid=8309766002",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-14T08:07:49-05:00",
    "source": "Greenhouse:sumup",
    "scraped_at": "2026-01-23T20:55:29.969581",
    "domain": "sumup.com",
    "description": "At SumUp, we are motivated by the purpose of levelling the playing field for small businesses. We empower small business owners by creating simple and affordable tools to manage payments, finance and customer relationships. We are a passionate team that thrives on human connection, autonomy and the desire to constantly learn, guided by our values&nbsp;Founder’s Mentality,&nbsp;Team First&nbsp;and&nbsp;We Care. We want to build an enduring organisation that is people-positive, disciplined and that constantly innovates from within. Agility is the essence of an enduring organisation and we strive to create an organisation that fosters it.\n\nIn Global Operations, we build the best customer experience in fintech. The Senior Analytics Engineer role is critical for creating the robust, high-quality data foundation that drives efficiency, powers AI-driven automation, and enables data-driven decisions for our merchants and support agents. You will be the expert who builds and maintains the data engine using dbt and Snowflake, ensuring analysts, product managers, and AI systems have trusted, accessible data.\n\nWhat You'll Be Doing\n\nYou will be the dedicated data owner for the Operations Tribe, focused on transforming raw data into reliable, scalable data products.\n\nOwn, develop, and maintain the Operations data structure (DAOPS) using expert-level SQL and dbt within Snowflake, managing over 200 data models and ensuring clear business logic.\n\nManage and optimize data pipeline orchestration (e.g., Airflow), handling critical third-party ingestions (Trustpilot, NICE) and implementing resource/cost optimizations.\n\nDrive self-service analytics by setting up best practices for data governance, quality, and accessibility, creating documentation and marts for stakeholders.\n\nImplement robust data governance, focusing on PII management, access control, and quality checks to ensure report reliability.\n\nProvide the perfectly structured data foundation for new AI tools being developed to au...",
    "salary": null,
    "job_type": null,
    "department": "Data Engineer/Scientist"
  },
  {
    "id": "8232119002",
    "title": "Senior Analytics Engineer",
    "company": "SumUp",
    "url": "https://sumup.com/careers/positions/8232119002?gh_jid=8232119002",
    "location": "Cologne, Germany",
    "city": "Cologne",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-14T08:07:49-05:00",
    "source": "Greenhouse:sumup",
    "scraped_at": "2026-01-23T20:55:29.969242",
    "domain": "sumup.com",
    "description": "About the Role\n\nAt SumUp, we're on a mission to bring merchants and consumers closer together and help local communities thrive. With SumUp Pay, we're building a rewarding banking experience that connects people to the small businesses they love while enabling free transactions for our merchants.\n\nSumUp Pay helps consumers manage their money with ease and get more from everyday spending. It offers seamless payment experiences and financial tools designed for modern life, supporting the growth of a thriving consumer banking ecosystem.\n\nThis role is a high-impact technical position that will challenge you to work at the intersection of data engineering and analytics. You will be the dedicated data owner for the Consumer Tribe, partnering with backend engineers on integrations, maintaining critical data pipelines, and enabling teams across Product, Marketing, Finance, and Risk to make data-driven decisions through self-service analytics. Your work will span from real-time event streams to business intelligence dashboards, ensuring data reliability for our financial services product.\n\nWhat you’ll do\n\nOwn and maintain the Consumer Tribe's data infrastructure, including dbt transformation pipelines, data marts, and dashboards that support business-critical reporting across the organisation\n\nPartner with backend engineers on new tool integrations (CRM, customer support platforms, AppsFlyer, Google Analytics), handling real-time event streams (Kafka), data flows, transformations, and Snowflake data warehouse management\n\nBuild and optimize data models and transformation pipelines using dbt, ensuring data quality, reliability, and performance as the business scales\n\nEnable self-service analytics by creating comprehensive documentation, intuitive dashboards (Snowflake/Tableau), and query templates that empower stakeholders to access data independently\n\nMonitor pipeline health, troubleshoot failures, and implement data quality checks to ensure reliability for business-critical ...",
    "salary": null,
    "job_type": null,
    "department": "Data Engineer/Scientist"
  },
  {
    "id": "8249610002",
    "title": "Senior AI/ML Engineer",
    "company": "SumUp",
    "url": "https://sumup.com/careers/positions/8249610002?gh_jid=8249610002",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-14T08:07:49-05:00",
    "source": "Greenhouse:sumup",
    "scraped_at": "2026-01-23T20:55:29.968839",
    "domain": "sumup.com",
    "description": "At SumUp, we are motivated by the purpose of levelling the playing field for small businesses. We empower small business owners by creating simple and affordable tools to manage payments, finance and customer relationships. We are a passionate team that thrives on human connection, autonomy and the desire to constantly learn, guided by our values: Founder’s Mentality, Team First, and We Care. We want to build an enduring organisation that is people-positive, disciplined and that constantly innovates from within. Agility is the essence of an enduring organisation and we strive to create an organisation that fosters it.\n\nIn Global Operations, we build the best customer experience in fintech. The Senior AI/ML Engineer role is critical for developing and deploying the next generation of AI-driven solutions that automate support and drastically improve the experience for both our merchants and support agents. You will be a key expert who builds and maintains the ML infrastructure and tooling that powers our core products using advanced AI/ML models. This role is a replacement, essential for maintaining momentum as we expand complex use cases like our AI Assistant and translation tools.\n\nWhat You'll Be Doing\n\nYou will be the dedicated technical leader for the Operations AI team, focused on designing, developing, and deploying high-performance, scalable ML/AI solutions in production environments.\n\nArchitect, design, develop, and deploy our AI solutions and systems into production environments, ensuring reliability, high performance, and scalability.\n\nTake ownership and technical leadership in the development and maintenance of main AI products, including the AI Assistant (automating ~40% of merchant requests), AI Translation (enabling cross-language agent service), and the AI Agent Copilot.\n\nDevelop and maintain ML infrastructure and pipelines to support efficient data processing, model training, serving, and continuous monitoring.\n\nOptimise and fine-tune machine learning ...",
    "salary": null,
    "job_type": null,
    "department": "Data Engineer/Scientist"
  },
  {
    "id": "7543954",
    "title": "Senior Reporting Data Analyst (Fluent French)",
    "company": "N26",
    "url": "https://n26.com/en-eu/careers/positions/7543954?gh_jid=7543954",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-26T06:29:17-05:00",
    "source": "Greenhouse:n26",
    "scraped_at": "2026-01-23T16:01:57.985553",
    "domain": "n26.com",
    "description": "About the opportunity\n\nThe Senior Reporting Data Analyst plays a key role in supporting the French Regulatory Reporting team by developing, maintaining, and optimizing the data models, pipelines, and scripts used for French regulatory submissions. The role ensures high-quality data, reliable transformations, and seamless alignment between French regulatory requirements and our data/tech teams.\n\nIn this role, you will:\n\nWorking with the French Regulatory Reporting team who are our experts in regulatory reports, in order to match regulatory requirements to the data which is living in our DWH.\n\nBuild and automate data models.\n\nData profiling, finding the right data, requesting missing data, etc.\n\nConducting data quality investigation.\n\nDefine, build and maintain processes that deliver crucial data to internal and external stakeholders.\n\nAutomate everything what is possible.\n\nLearn about regulator reports and accounting principles.\n\nMaintain your work well documented, reproducible and reliable.\n\nWhat you need to be successful:\n\nBackground:\n\nMinimum 5 years of experience working with data in the financial industry or similar.\n\nFluent in English &amp; French.\n\nAdvanced knowledge of SQL is a must (Postgres or Redshift preferred).\n\nYou love working with data, and you become very creative when analyzing data.\n\nYou are independent problem solver who owns the process from the beginning till the end, however you also know how to recognize when to ask for a help.\n\nYou are curious, responsible, self-motivated, detail oriented empathic leader and a strong communicator.\n&nbsp;\n\nAdvanced SQL Skills:\n\nExpert-level proficiency in SQL for querying, data manipulation, and performance optimization.\n\nAbility to write complex SQL queries, stored procedures, CTEs, and window functions.\n\nStrong understanding of database normalization, indexing, and query performance tuning.\n&nbsp;\n\ndbt (Data Build Tool) Knowledge (optional but beneficial):\n\nProficiency with dbt for transforming, testing, and...",
    "salary": null,
    "job_type": null,
    "department": "European Markets"
  },
  {
    "id": "7494477003",
    "title": "Engineering Manager - AI",
    "company": "Doctolib",
    "url": "https://job-boards.greenhouse.io/doctolib/jobs/7494477003",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-16T05:33:47-05:00",
    "source": "Greenhouse:doctolib",
    "scraped_at": "2026-01-21T22:03:36.192907",
    "domain": "doctolib.com",
    "description": "Join our mission, join Doctolib!\n\nWhat you'll do&nbsp;\n\nDoctolib’s Engineering environment is rich and we are building innovative products and features aiming each day to ease doctors' and patient life.\n\nWe are looking for our next Engineering Manager - AI to join our tech domains in Berlin. You will join a team of hard working entrepreneurs, who are passionate about transforming healthcare and play an active role in shaping a fast-growing company from day one!\n\nTo go beyond the ad, please check our technical blog!\n\nAbout our tech environment\n\nOur solutions are built on a single fully cloud-native platform that supports web and mobile app interfaces, multiple languages, and is adapted to the country and healthcare specialty requirements. To address these challenges, we are modularizing our platform run in a distributed architecture through reusable components.&nbsp;\n\nOur stack is composed of Rails, TypeScript, Java, Python, Kotlin, Swift and React Native.\n\nWe leverage AI in an ethical manner across our products to empower patients and health professionals. Discover our AI vision here and learn about our first AI hackathon here!\n\nWho you are&nbsp;\n\nBefore you read on — if you don't have the exact profile described below, but you feel this job description matches your skill set, we still encourage you to apply.&nbsp;You will be both a technical leader and a people manager, coaching and training your team members while building an amazing engineering organization at Doctolib. In this role, you will:\n\nLead a high performing collaborative team of 5+ members to ensure business objectives are met as a team&nbsp;\n\nPartner with talent &amp; people teams to recruit, develop and retain talent\n\nBuild, lead, and empower a user centric team, that delivers best in class internal and external user satisfaction&nbsp;\n\nTogether with your product partner, define a mission, vision for your team and align on a clear roadmap to make it happen.&nbsp;\n\nBe the end-to-end owner of the team’s...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "4516967101",
    "title": "Deployed AI Engineer",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4516967101?gh_jid=4516967101",
    "location": "Munich - Berlin - London - Paris - Warsaw - Tallinn",
    "city": "Munich - Berlin - London - Paris - Warsaw - Tallinn",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-26T11:47:12-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-21T21:21:07.321822",
    "domain": "helsing.ai",
    "description": "Who we are\n\nHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.&nbsp;\n\nAs democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.&nbsp;\n\nWe are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers.&nbsp;We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.&nbsp;\n\nThe role\n\nSoftware only matters when it is actively being used and making a difference. As a Deployed AI Engineer, you will be at the heart of this - taking state-of-the-art software and integrating it into complex systems. You will be defining and executing against the end-to-end outcome and all steps on the way&nbsp;to delivering novel capabilities in some of the most challenging environments around.\n\nFor example: you collaborate directly with customer avionics engineers to understand the data structures and APIs used in aircraft mission control systems. Instead of being scared, you embrace the complexity of unfamiliar databases, APIs, or network protocols; you dig into the specification and use your creativity and ingenuity to implement adapters for integrating them with Helsing’s cloud infrastructure. By working closely with our partners and customers (both metaphorically and quite literally), you continuously evolve, improve, and operate Helsing software. You own the outcome end-to-end.\n\nThe day-to-day\n\nIn close collaboration with our product teams, you will discover and formalise customer requirements, identify bugs, and ship...",
    "salary": null,
    "job_type": null,
    "department": "Deployed Engineering"
  },
  {
    "id": "4233250101",
    "title": "Data Engineer ",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4233250101?gh_jid=4233250101",
    "location": "Berlin; London, England, United Kingdom; Munich",
    "city": "Berlin; London",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-26T11:47:11-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-21T21:21:07.321822",
    "domain": "helsing.ai",
    "description": "Who we are\n\nHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.\n\nAs democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.&nbsp;\n\nWe are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers. We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.\n\nThe role\n\nAt Helsing, data is the foundation of our AI capabilities. We build scalable systems that transform raw sensor and camera data into mission-critical datasets powering advanced AI algorithms. You will architect and build the data pipelines that bridge field data acquisition and AI development, working in an environment where off-the-shelf solutions rarely fit and custom systems are the norm.\n\nThis role requires moving fast while maintaining a long-term vision, balancing immediate impact with scalable architecture, and collaborating across teams to deliver flexible solutions that evolve with our needs. Over time you will become a recognized expert in building production data infrastructure for AI systems, shaping how Helsing processes and scales mission-critical data.\n\nThe day-to-day\n\nDesign and implement scalable data pipelines that ingest sensor and camera data, process large video datasets, and deliver AI-ready outputs with high throughput and reliability&nbsp;\n\nCollaborate with field operations, AI researchers, and ML engineers to understand data requirements and translate them into automated, production-grade solutions\n\nBuild the criti...",
    "salary": null,
    "job_type": null,
    "department": "AI & Engineering"
  },
  {
    "id": "4372802101",
    "title": "AI Research Engineer - Signal Processing",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4372802101?gh_jid=4372802101",
    "location": "Berlin; Munich",
    "city": "Berlin; Munich",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-26T12:13:30-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-21T21:21:07.320824",
    "domain": "helsing.ai",
    "description": "Who we are\n\nHelsing is a defence AI company with the mission is to protect our liberal democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards. We believe we have a responsibility to be thoughtful about the development and deployment of powerful technologies like AI and take this responsibility seriously.&nbsp;\n\nWe are an ambitious and committed team of software and deployment engineers, AI specialists and customer-facing programme managers.&nbsp;We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems today.\n\nWe embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.&nbsp;\n\nThe role\n\nAt Helsing, we deliver AI-based capabilities and the enabling foundation that allow machines to perceive and assist human decision-making.\n\nYou will have the unique opportunity to shape AI capabilities in one of the most challenging sectors, where high generalisation capabilities need to be paired with hardware constraints and robustness against adversarial attacks.\n\nYou will be part of a signal processing team, where you will build in-house solutions for signal processing problems that we face, in the sky or underwater.\n\nThe day-to-day\n\nYou will develop and extend the state-of-the-art in signal processing, applying and deploying the technology in real-world scenarios.\n\nYou will contribute to projects and will collaborate with people across several teams and backgrounds.\n\nYou should apply if you\n\nHold an MSc in signal processing, machine learning, robotics, communication engineering or related field with experience in conceptualising, implementing and thoroughly evaluating advanced AI-based systems\n\nHave excellent communication skills and the ability to report and present research findings clearly and efficien...",
    "salary": null,
    "job_type": null,
    "department": "AI & Engineering"
  },
  {
    "id": "4423924101",
    "title": "AI Research Engineer - Robotics, Control, RL",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4423924101?gh_jid=4423924101",
    "location": "Berlin; Munich",
    "city": "Berlin; Munich",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-26T11:47:10-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-21T21:21:07.320323",
    "domain": "helsing.ai",
    "description": "Who we are\n\nHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.&nbsp;\n\nAs democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.&nbsp;\n\nWe are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers.&nbsp;We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.&nbsp;\n\nThe role\n\nAt Helsing we deliver AI-based capabilities and the enabling foundation that allow machines to perceive and assist human decision-making. You will have the unique opportunity to shape AI capabilities in one of the most challenging sectors, where high generalisation capabilities need to be paired with hardware constraints and robustness against adversarial attacks.\n\nYou will be a part of a team focused on advancing robotics through reinforcement learning, where you will design, train and deploy agents to be deployed in robots in complex environments.\n\nThe day-to-day\n\nYou will contribute to our reinforcement learning stack by implementing, improving and extending the current state of the art in multi-agent reinforcement learning.\n\nYou will contribute to projects and will collaborate with people across several teams and backgrounds.\n\nYou should apply if you\n\nHold an MSc in machine learning with a speciality in either robotics, reinforcement learning, or automation and control.\n\nHave excellent communication skills and the ability to report and present research findings clearly and efficiently both internally and externally.\n\n...",
    "salary": null,
    "job_type": null,
    "department": "AI & Engineering"
  },
  {
    "id": "4334842101",
    "title": "AI Research Engineer -  3D Computer Vision",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4334842101?gh_jid=4334842101",
    "location": "Munich - Berlin - London - Paris",
    "city": "Munich - Berlin - London - Paris",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-26T11:47:10-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-21T21:21:07.319327",
    "domain": "helsing.ai",
    "description": "Who we are\n\nHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.&nbsp;\n\nAs democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.&nbsp;\n\nWe are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers.&nbsp;We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.&nbsp;\n\nThe role\n\nAt Helsing we deliver AI-based capabilities and the enabling foundation that allow machines to perceive and assist human decision-making. You will have the unique opportunity to shape AI capabilities in one of the most challenging sectors, where high generalisation capabilities need to be paired with hardware constraints and robustness against adversarial attacks.\n\nYou will be part of a computer vision team, where you will be responsible for building computer vision models for object recognition and tracking, video understanding, scene matching, etc.\n\nThe day-to-day\n\nYou will develop computer vision models and pipelines that leverage and extend the latest state-of-the-art methods and architectures, as well as design experiments and conduct benchmarks to evaluate and improve their performance in real-world scenarios. \n\nYou will also apply and develop techniques to adapt them to the target hardware and constraints associated to the downstream ML/AI tasks. \n\nYou will contribute to impactful projects and will collaborate with people across several teams and backgrounds.\n\nYou should apply if you\n\nHold an MSc in computer scienc...",
    "salary": null,
    "job_type": null,
    "department": "AI & Engineering"
  },
  {
    "id": "4334849101",
    "title": "AI Research Engineer - AI Safety",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4334849101?gh_jid=4334849101",
    "location": "Berlin; London; Munich; Paris",
    "city": "Berlin; London; Munich; Paris",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-26T11:47:10-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-21T21:21:07.319327",
    "domain": "helsing.ai",
    "description": "Who we are\n\nAt Helsing we deliver AI-based capabilities and the enabling foundation that allow machines to perceive and assist human decision-making. You will have the unique opportunity to shape AI capabilities in one of the most challenging sectors, where high generalisation capabilities need to be paired with hardware constraints and robustness against adversarial attacks.\n\nYou will join a team focused on AI Assurance, where you will develop cutting-edge techniques for scalable evaluation of AI products across the company, design data collection and experimentation strategies to extract causal insights, and enhance responsible decision-making via uncertainty quantification and safety mechanisms.\n\nThe day-to-day\n\nYou will be responsible for defining operational domains and evaluating the reliability of the AI capabilities developed in-house. You will develop and extend the state-of-the-art in uncertainty quantification and uncertainty calibration. This will involve understanding the AI systems we build, interfacing with them, and evaluating their robustness in real-world and adversarial scenarios. You will contribute to impactful projects and will collaborate with people across several teams and backgrounds.\n\nYou should apply if you\n\nHold a STEM MSc with solid mathematical and statistical background.\n\nHave excellent communication skills and the ability to report and present research findings clearly and efficiently both internally and externally\n\nAre passionate about keeping up to date with current research and enjoy reimplementing / extending papers on state of the art Deep Learning-based approaches\n\nPossess solid software engineering skills, writing clean and well-structured code in Python and/or languages like Rust, Java, or modern C++, and experience deploying AI software to production including testing, QA, and monitoring\n\nNote: We operate at an intersection where women, as well as other minority groups, are systemically under-represented. We encourage you to...",
    "salary": null,
    "job_type": null,
    "department": "AI & Engineering"
  },
  {
    "id": "4676357101",
    "title": "AI Research Engineer - Reinforcement Learning",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4676357101?gh_jid=4676357101",
    "location": "Berlin; Munich",
    "city": "Berlin; Munich",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-26T11:47:10-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-21T21:21:07.319327",
    "domain": "helsing.ai",
    "description": "Who we are\n\nHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.&nbsp;\n\nAs democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.&nbsp;\n\nWe are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers.&nbsp;We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.&nbsp;\n\nThe role\n\nAt Helsing we deliver AI-based capabilities and the enabling infrastructure that allow semi-autonomous platforms to localise, navigate, and perceive the world in real time. You will have the unique opportunity to shape the future of AI in one of the most challenging sectors, where performance needs to be paired up with high generalisation capabilities and strong robustness against adversarial attacks.\n\nYou’ll build the autonomy brain for a cutting-edge autonomous aerial platform that will actually take flight. you'll be developing state-of-the-art reinforcement learning agents into the operational systems of our own Unmanned Combat Aerial Vehicle (UCAV), the CA-1 Europa, part of the groundbreaking Centaur project. This is a unique opportunity to directly contribute to a novel autonomous system designed from the ground up.\n\nThe day-to-day\n\nYou'll build, train and integrate reinforcement learning agents into high-performance runtime systems, enabling real-time autonomous decision-making in flight.&nbsp;\n\nYou will contribute to our reinforcement learning stack by implementing, improving and extending the current state of the...",
    "salary": null,
    "job_type": null,
    "department": "AI & Engineering"
  },
  {
    "id": "4129902101",
    "title": "AI Research Engineer",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4129902101?gh_jid=4129902101",
    "location": "Berlin; London; Munich; Paris",
    "city": "Berlin; London; Munich; Paris",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-26T11:59:51-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-21T21:21:07.318299",
    "domain": "helsing.ai",
    "description": "Who we are\n\nHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.&nbsp;\n\nAs democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.&nbsp;\n\nWe are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers.&nbsp;We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.&nbsp;\n\nThe role\n\nAt Helsing we deliver AI-based capabilities and the enabling infrastructure that allow semi-autonomous platforms to localise, navigate, and perceive the world in real time. You will have the unique opportunity to shape the future of AI in one of the most challenging sectors, where performance needs to be paired up with high generalisation capabilities and strong robustness against adversarial attacks.\n\nThe day-to-day\n\nYou will develop ML/AI that leverage and extend the latest state-of-the-art methods and architectures, as well as design experiments and conduct benchmarks to evaluate and improve their performance in real-world scenarios. You will be a part of impactful projects and will collaborate with people across several teams and backgrounds to integrate cutting edge ML/AI in our production systems.\n\nYou should apply if you\n\nHold an MSc in artificial intelligence, machine learning, computer science or a related field with experience in conceptualising, implementing, and thoroughly evaluating advanced AI-based systems.\n\nHave excellent communication skills and the ability to report and present research findings clearly ...",
    "salary": null,
    "job_type": null,
    "department": "AI & Engineering"
  },
  {
    "id": "4532553005",
    "title": "Machine Learning Software Engineer",
    "company": "Applied Intuition",
    "url": "https://boards.greenhouse.io/appliedintuition/jobs/4532553005?gh_jid=4532553005",
    "location": "Stuttgart, Baden-Württemberg, Germany",
    "city": "Stuttgart",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-14T17:31:02-05:00",
    "source": "Greenhouse:appliedintuition",
    "scraped_at": "2026-01-21T21:21:05.040266",
    "domain": "appliedintuition.com",
    "description": "About Applied Intuition\n\nApplied Intuition, Inc. is powering the future of physical AI. Founded in 2017 and now valued at $15 billion, the Silicon Valley company is creating the digital infrastructure needed to bring intelligence to every moving machine on the planet. Applied Intuition services the automotive, defense, trucking, construction, mining and agriculture industries in three core areas: tools and infrastructure, operating systems, and autonomy. Eighteen of the top 20 global automakers, as well as the United States military and its allies, trust the company’s solutions to deliver physical intelligence. Applied Intuition is headquartered in Sunnyvale, California, with offices in Washington, D.C.; San Diego; Ft. Walton Beach, Florida; Ann Arbor, Michigan; London; Stuttgart; Munich; Stockholm; Bangalore; Seoul; and Tokyo. Learn more at&nbsp;applied.co.\n\nWe are an in-office company, and our expectation is that employees primarily work from their Applied Intuition office 5 days a week. However, we also recognize the importance of flexibility and trust our employees to manage their schedules responsibly. This may include occasional remote work, starting the day with morning meetings from home before heading to the office, or leaving earlier when needed to accommodate family commitments.\nAbout the role\n\nWe are looking for software engineers with expertise in ML-first perception, prediction or planning for autonomous vehicles or mobile robots. Your contributions will focus on building out key ML capabilities of an autonomous vehicle stack.&nbsp;\n\nIn addition to your engineering contributions, by working in our dynamic and customer-focused team culture, you will contribute to and learn from best practices in the autonomy industry. We move fast and focus on excellence, for our products and for our business. If you are hands-on and looking for a place to have a multiplying effect on making autonomous systems a reality, Applied Intuition is the place for you!\n\nAt Appli...",
    "salary": null,
    "job_type": null,
    "department": "SDS Software Engineering"
  },
  {
    "id": "3043024",
    "title": "Programmatic Solutions Consultant , Amazon",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3043024",
    "location": "DE, BY, Munich",
    "city": "Munich",
    "country": "Germany",
    "posted_date": "July 24, 2025",
    "updated_time": "15 days",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-21T20:55:35.305476",
    "domain": null,
    "description": "Amazon Ads is dedicated to driving measurable outcomes for brand advertisers, agencies, authors, and entrepreneurs. Our ad solutions - including sponsored, display, video, and custom ads - leverage Amazon’s innovations and insights to find, attract, and engage intended audiences throughout their daily journeys. With a range of flexible pricing and buying models, including self-service, managed service, and programmatic ad buying, these solutions help businesses build brand awareness, increase product sales, and more. Our programmatic advertising platform, the Amazon Demand Side Platform (DSP), is becoming increasingly popular with major advertisers and agencies worldwide. We believe we understand display advertising better than anybody else and want to turn it into a science of its own that all users can leverage for their programmatic advertising.<br/><br/>Our Amazon DSP team is looking for a Programmatic Solutions Consultant to join Amazon Ads growing team based in Germany.<br/><br/>As a Programmatic Solutions Consultant, you will manage the end-to-end experience of our enterprise customer, known as programmatic trading desks. You will drive success by developing customer expertise in our programmatic advertising DSP. The Programmatic Solutions Consultant has experience in advertising technology and the programmatic advertising domain, and is leveraging this expertise to help our customers meet and exceed their business objectives. In this customer-facing role, you will work closely with programmatic traders at agencies/advertisers, as well as Amazon Ads internal sales, product, and support teams to address customer needs.<br/><br/>A typical PSC engagement with our customers could include onboarding new traders, delivering trainings on new product features, assisting a customer with a beta feature, consulting in business strategy and planning discussions, providing oversight in execution of campaign strategy, developing campaign optimization recommendations and monitoring their impact, conducting deep dives to determine root causes of issues and informing customers of the best course of action.<br/><br/>You will advocate for customer in internal forums, provide troubleshooting support and triage when needed, and simplify and propagate customer feedback to inform product and services design. PSCs operate as trusted advisors to customers every day, and ensure customers gradually develop into a proficient users of our DSP, who see Amazon DSP as their preferred means to their goals.<br/><br/>You will be passionate about understanding customer objectives, and address them using our book of services and engagement best practices, to drive adoption of Amazon technologies. Your ownership, curiosity, and domain knowledge will allow you to comprehensively understand the details of our offerings and be able to speak to these to our customers with passion, authority, empathy, and clarity.<br/><br/>Key job responsibilities<br/>- Owning the relationship with programmatic trading desk managers, engaging with multiple customer organizational levels to understand business objectives<br/>- Providing services such as onboarding, trade desk support plans, feature training, continuous product usage consultation, and industry best practices<br/>- Analyzing and interpreting data to identify improvement areas, root causes, and formulate enablement and adoption recommendations<br/>- Driving the evolution of Amazon DSP by assisting customers with product beta participation, capturing customer feedback, and collaborating closely with cross-functional Amazon teams (Product Management, Engineering, Analytics, and Specialists)<br/>- Defining and improving processes and tools for the Programmatic Solutions Consultant team to better serve customers<br/><br/>A day in the life<br/>- A typical PSC engagement with our customers could include onboarding new traders, delivering trainings on new product features, assisting a customer with a beta feature, consulting in business strategy and planning discussions, providing oversight in execution of campaign strategy, developing campaign optimization recommendations and monitoring their impact, conducting deep dives to determine root causes of issues and informing customers of the best course of action.<br/><br/>- You will advocate for customer in internal forums, provide troubleshooting support and triage when needed, and simplify and propagate customer feedback to inform product and services design. PSCs operate as trusted advisors to customers every day, and ensure customers gradually develop into a proficient users of our DSP, who see Amazon DSP as their preferred means to their goals.<br/><br/>- You will be passionate about understanding customer objectives, and address them using our book of services and engagement best practices, to drive adoption of Amazon technologies. Your ownership, curiosity, and domain knowledge will allow you to comprehensively understand the details of our offerings and be able to speak to these to our customers with passion, authority, empathy, and clarity.<br/><br/>About the team<br/>Here at Amazon Ads, we embrace our differences. We are committed to furthering our culture of inclusion. We have 13 employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust. <br/><br/>Our team puts a high value on work-life balance. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfilment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.<br/><br/>Our team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional and enable them to take on more complex tasks in the future.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "744000104245396",
    "title": "Data Engineer (Tech Foundations) - Fixed Term",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000104245396",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2026-01-19T13:06:08.309Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-21T20:55:24.290480",
    "domain": "deliveryhero.com",
    "description": "We are on the lookout for a Data Engineer- Fixed Term to join the Tech foundations vertical on our journey to always deliver amazing experiences.&#xa0;\nAt Delivery Hero, we build world-class platforms that power millions of orders every day. As a Data Engineer in the Identity Management team, you will play a key role in designing, building, and maintaining scalable data pipelines that support authentication, authorization, fraud detection, compliance, and user identity analytics across our global ecosystem.\nYou will work closely with security engineers, product managers, analysts, and platform teams to ensure high-quality, reliable, and secure data solutions using Google BigQuery, Apache Airflow, Looker Studio, Google Cloud Storage (GCS), and other modern cloud-native tools.\nAs a member of the Tech Foundation Team, you’ll support Delivery Hero’s rapid innovation and growth. You’ll work on foundational systems that enable faster feature development, security, and reliability across our global engineering community. Every enhancement you make will contribute to our teams' ability to build, scale, and deliver quality features—ultimately impacting millions of users worldwide.\nThis is a 1 year fixed term contract.&#xa0;\n\nDesign, build, and maintain scalable and reliable data pipelines for identity and access management use cases.\n\nDevelop and optimize ELT/ETL workflows using Apache Airflow.\n\nModel, transform, and optimize large-scale datasets in Google BigQuery for analytics and operational reporting.\n\nEnsure data quality, observability, and reliability through monitoring, alerting, and automated testing using Monte Carlo, BigQuery Data Quality, Cloud Logging and Grafana.\n\nCollaborate with Security, IAM, Product, and Analytics teams to deliver end-to-end data solutions.\n\nImplement privacy-by-design and security best practices in all data workflows.",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000104395609",
    "title": "Data Scientist - (Logistics, Seamless Deliveries)",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000104395609",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2026-01-20T07:47:28.690Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-21T20:55:24.143537",
    "domain": "deliveryhero.com",
    "description": "We are on the lookout for a&#xa0;Data Scientist to join the Seamless Deliveries domain of the Customer Logistics tribe in our mission to deliver consistently amazing customer experiences.\nYou will work alongside other data professionals designing and deploying advanced models to solve complex problems, delivering revenue for Delivery Hero at the frontline of our growth & profitability journey.&#xa0;\nAt Delivery Hero, we are exploring ways to optimize our delivery times and perfect our forecasting and estimation abilities. We are developing and enhancing a range of products to better predict delivery times, optimize fleet operations, and improve the customer ordering experience..\nThe Customer Logistics tribe’s mission is to build products that make it easy for local brands to run efficient operations and deliver a delightful order experience to customers so they order on repeat.\nThe tribe comprises teams of skilled analysts, engineers, and scientists working together to deliver data&#xa0; solutions affecting every customer journey across all of Delivery Hero’s 70+ markets.\nIf you're a creative problem solver who is hungry for a new adventure, an international workplace is waiting for you in the heart of Berlin!\n\nDrive the development and implementation of advanced machine learning models for delivery time prediction, food prep time prediction, vendor consistency, etc. Collaborate with cross-functional teams to enhance the efficiency and performance of the machine learning models across the vertical.\n\nAnalyse large-scale datasets to understand and identify opportunities deploying sophisticated statistical techniques to improve decision making in Time Predictions.\n\nLead research initiatives to explore emerging trends and technologies in machine learning, contributing to the advancement of Delivery Hero's digital products and algorithms. Stay informed about industry developments and incorporate new methodologies and best practices into our data science workflows.\n\nServe...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "3137328",
    "title": "Sr. Programmatic Solutions Consultant, PSC - DE",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3137328",
    "location": "DE, BY, Munich",
    "city": "Munich",
    "country": "Germany",
    "posted_date": "December  4, 2025",
    "updated_time": "9 days",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-16T14:39:04.779796",
    "domain": null,
    "description": "Amazon Ads is dedicated to driving measurable outcomes for brand advertisers, agencies, authors, and entrepreneurs. Our ad solutions - including sponsored, display, video, and custom ads - leverage Amazon’s innovations and insights to find, attract, and engage intended audiences throughout their daily journeys. With a range of flexible pricing and buying models, including self-service, managed service, and programmatic ad buying, these solutions help businesses build brand awareness, increase product sales, and more. Our programmatic advertising platform, the Amazon Demand Side Platform (DSP), is becoming increasingly popular with major advertisers and agencies worldwide. We believe we understand display advertising better than anybody else and want to turn it into a science of its own that all users can leverage for their programmatic advertising.<br/><br/>Our Amazon DSP team is looking for a Senior Programmatic Solutions Consultant to join Amazon Ads growing team based in Munich and Hamburg.<br/><br/>As a Senior Programmatic Solutions Consultant, you will manage the end-to-end experience of our enterprise customer, known as programmatic trading desks. You will drive success by developing customer expertise in our programmatic advertising DSP. <br/><br/>The Programmatic Solutions Consultant has experience in advertising technology and the programmatic advertising domain, and is leveraging this expertise to help our customers meet and exceed their business objectives. In this customer-facing role, you will work closely with programmatic traders at agencies/advertisers, as well as Amazon Ads internal sales, product, and support teams to address customer needs.<br/><br/>Key job responsibilities<br/>- Owning the relationship with programmatic trading desks and their senior leadership, engaging with multiple customer organizational levels to understand business objectives<br/>- Providing services such as onboarding, trade desk support plans, feature training, continuous product usage consultation, and industry best practices<br/>- Analyzing and interpreting data to identify improvement areas, root causes, and formulate enablement and adoption recommendations<br/>- Driving the evolution of Amazon DSP by assisting customers with product beta participation, capturing customer feedback, and collaborating closely with cross-functional Amazon teams (Product Management, Engineering, Analytics, and Specialists)<br/>- Defining and improving processes and tools for the Programmatic Solutions Consultant team to better serve customers<br/><br/>A day in the life<br/>A typical PSC engagement with our customers could include onboarding new traders, delivering trainings on new product features, assisting a customer with a beta feature, consulting in business strategy and planning discussions, providing oversight in execution of campaign strategy, developing campaign optimization recommendations and monitoring their impact, conducting deep dives to determine root causes of issues and informing customers of the best course of action.<br/><br/>You will advocate for customer in internal forums, provide troubleshooting support and triage when needed, and simplify and propagate customer feedback to inform product and services design. PSCs operate as trusted advisors to customers every day, and ensure customers gradually develop into a proficient users of our DSP, who see Amazon DSP as their preferred means to their goals.<br/><br/>You will be passionate about understanding customer objectives, and address them using our book of services and engagement best practices, to drive adoption of Amazon technologies. Your ownership, curiosity, and domain knowledge will allow you to comprehensively understand the details of our offerings and be able to speak to these to our customers with passion, authority, empathy, and clarity.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "7384405",
    "title": "Machine Learning Engineer, Dash",
    "company": "Dropbox",
    "url": "https://jobs.dropbox.com/listing/7384405?gh_jid=7384405",
    "location": "Remote - Germany",
    "city": "Remote - Germany",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-28T10:07:59-05:00",
    "source": "Greenhouse:dropbox",
    "scraped_at": "2026-01-15T20:29:05.997994",
    "domain": "dropbox.com",
    "description": "Role Description\n\nAs a Machine Leaning Engineer on our Multimedia AI team, you will be involved in shaping the future direction of Dropbox Dash and pushing the boundaries on what the world thinks is possible by leveraging the latest advancements in AI/ML. You will join a team of top-tier Machine Learning Engineers and be an inherent part of the product org to create and build delightful new experiences.&nbsp;\n\nCollaborating closely with cross-functional teams, you'll leverage your&nbsp;ML expertise to tackle audacious challenges. Your contributions will directly impact millions of users, as every line of code you write furthers our mission to revolutionize the way people work and collaborate.\n\nOur Engineering Career Framework is viewable by anyone outside the company and describes what’s expected for our engineers at each of our career levels. Check out our blog post on this topic and more here.\n\nResponsibilities\n\n​​Work with large scale data systems, and infrastructure\n\nHelp productionize multimodal and semantic retrieval systems at scale, powering Dash’s multimedia and creative search experiences.\n\n​​Partner with product, design, and infrastructure teams to improve retrieval, ranking, and conversational experiences across image, video, and text content.\n\n​​Build and iterate on quick prototypes and experimental features, driving innovation in multimodal interaction and creative workflows.\n\n​​Run quality and performance benchmarks across individual components and end-to-end systems to identify optimization opportunities.\n\n​​Contribute to open source projects and leverage OSS tools for efficient inference and scaling.\n\nOn-call work may be necessary occasionally to help address bugs, outages, or other operational issues, with the goal of maintaining a stable and high-quality experience for our customers.\n\nRequirements\n\nBS, MS, or PhD in Computer Science, Mathematics, Statistics, or other quantitative fields or related work experience\n\n5+ years of experience in enginee...",
    "salary": null,
    "job_type": null,
    "department": "Dash - Eng (Sub Team)"
  },
  {
    "id": "6746206",
    "title": "Data Scientist II - Product Analytics",
    "company": "Coinbase",
    "url": "https://www.coinbase.com/careers/positions/6746206?gh_jid=6746206",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-14T10:26:33-05:00",
    "source": "Greenhouse:coinbase",
    "scraped_at": "2026-01-15T20:29:05.865667",
    "domain": "coinbase.com",
    "description": "Ready to be pushed beyond what you think you’re capable of?\n\nAt Coinbase, our mission is to increase economic freedom in the world. It’s a massive, ambitious opportunity that demands the best of us, every day, as we build the emerging onchain platform — and with it, the future global financial system.\n\nTo achieve our mission, we’re seeking a very specific candidate. We want someone who is passionate about our mission and who believes in the power of crypto and blockchain technology to update the financial system. We want someone who is eager to leave their mark on the world, who relishes the pressure and privilege of working with high caliber colleagues, and who actively seeks feedback to keep leveling up. We want someone who will run towards, not away from, solving the company’s hardest problems.\n\nOur work culture is intense and isn’t for everyone. But if you want to build the future alongside others who excel in their disciplines and expect the same from you, there’s no better place to be.\n\nWhile many roles at Coinbase are remote-first, we are not remote-only. In-person participation is required throughout the year. Team and company-wide offsites are held multiple times annually to foster collaboration, connection, and alignment. Attendance is expected and fully supported.\nData Science is an integral component of Coinbase’s product and decision making process: we work in partnership with Product, Engineering and Design to influence the roadmap and better understand our users. With a deep expertise in experimentation, analytics and advanced modeling, we produce insights which directly move the company’s bottom line.\n\nWhat you'll be doing\n\nPerform analyses on products to answer open-ended questions and provide strategic recommendations.\n\nDesign and guide experiments/analysis to measure impact and drive product improvements.\n\nDevelop and maintain key metrics and reports, enhancing data infrastructure for better analysis.\n\nWhat we look for in you:\n\nAt least a BA/BS in...",
    "salary": null,
    "job_type": null,
    "department": "Data Science"
  },
  {
    "id": "7340727",
    "title": "Applied Research Scientist",
    "company": "Grammarly",
    "url": "https://job-boards.greenhouse.io/grammarly/jobs/7340727",
    "location": "Germany; Hybrid",
    "city": "Germany; Hybrid",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2025-12-16T15:15:08-05:00",
    "source": "Greenhouse:grammarly",
    "scraped_at": "2026-01-15T20:14:09.920191",
    "domain": "grammarly.com",
    "description": "Superhuman offers a dynamic hybrid working model for this role. This flexible approach gives team members the best of both worlds: plenty of focus time along with in-person collaboration that helps foster trust, innovation, and a strong team culture.\n\nAbout Superhuman\n\nGrammarly is now part of Superhuman, the AI productivity platform on a mission to unlock the superhuman potential in everyone. The Superhuman suite of apps and agents brings AI wherever people work, integrating with over 1 million applications and websites. The company’s products include Grammarly’s writing assistance, Coda’s collaborative workspaces, Mail’s inbox management, and Go, the proactive AI assistant that understands context and delivers help automatically. Founded in 2009, Superhuman empowers over 40 million people, 50,000 organizations, and 3,000 educational institutions worldwide to eliminate busywork and focus on what matters. Learn more at&nbsp;superhuman.com and about our values here.\n\nThe Opportunity\n\nTo achieve our ambitious goals, we’re looking for an Applied Research Scientist with a keen interest and background in natural language processing (NLP), machine learning (ML), and deep learning (DL) to join our Agents team. The team builds user-facing features that work in all Superhuman applications. We help our users write better, faster, and more effectively while working in big groups. The person in this role will bring their unique perspective to our product development process by contributing to ideation and defining the solution space. Based on their deep grasp of ML/DL/NLP concepts, the Applied Researcher will define the approach to solving the complex problems. The role will also build the intelligent functionality of our product offerings.\n\nSuperhuman's engineers and researchers have the freedom to innovate and uncover breakthroughs—and, in turn, influence our product roadmap. The complexity of our technical challenges is growing rapidly as we scale our interfaces, algorithms,...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "8228769002",
    "title": "AI Engineer - FDE (Forward Deployed Engineer)",
    "company": "Databricks",
    "url": "https://databricks.com/company/careers/open-positions/job?gh_jid=8228769002",
    "location": "Remote - Germany",
    "city": "Remote - Germany",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2025-12-14T07:45:03-05:00",
    "source": "Greenhouse:databricks",
    "scraped_at": "2026-01-15T20:14:09.359600",
    "domain": "databricks.com",
    "description": "AI Engineer - FDE (Forward Deployed Engineer) (ALL LEVELS)\n\nReq ID: CSQ127R84\n\nMission\n\nThe AI Forward Deployed Engineering (AI FDE) team is a highly specialised customer-facing AI team at Databricks. We deliver professional services engagements to help our customers build and productionize first-of-its-kind AI applications. We work cross-functionally to shape long-term strategic priorities and initiatives alongside engineering, product, and developer relations, as well as support internal subject matter expert (SME) teams. We view our team as an ensemble: we look for individuals with strong, unique specialisations to improve the overall strength of the team. This team is the right fit for you if you love working with customers, teammates, and fueling your curiosity for the latest trends in GenAI, LLMOps, and ML more broadly.\n\nWe welcome remote applicants located near our offices. The preferred locations (in priority order) are London (UK), Munich (Germany), Paris (France), and Amsterdam (NL).\n\nThe impact you will have:\n\nDevelop cutting-edge GenAI solutions, incorporating the latest techniques from our Mosaic AI research to solve customer problems\n\nOwn production rollouts of consumer and internally facing GenAI applications\n\nServe as a trusted technical advisor to customers across a variety of domains\n\nPresent at conferences such as Data + AI Summit, recognized as a thought leader internally and externally\n\nCollaborate cross-functionally with the product and engineering teams to influence priorities and shape the product roadmap&nbsp;\n\nWhat we look for:\n\nExperience building GenAI applications, including RAG, multi-agent systems, Text2SQL, fine-tuning, etc., with tools such as HuggingFace, LangChain, and DSPy\n\nExpertise in deploying production-grade GenAI applications, including evaluation and optimizations&nbsp;\n\nExtensive years of hands-on industry data science experience, leveraging common machine learning and data science tools, i.e. pandas, scikit-learn, PyTorch...",
    "salary": null,
    "job_type": null,
    "department": "Professional Services Operations"
  },
  {
    "id": "7464332",
    "title": "Staff Data Scientist, Growth Alliance (f/m/x) ",
    "company": "HelloFresh",
    "url": "https://careers.hellofresh.com/global/en/job/7464332?gh_jid=7464332",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-23T09:52:37-05:00",
    "source": "Greenhouse:hellofresh",
    "scraped_at": "2026-01-15T20:14:09.060163",
    "domain": "hellofresh.com",
    "description": "The role\n\nConversions Tech empowers our meal brands to achieve ambitious growth targets through a seamless and high-performing conversion funnel. As part of the Growth Alliance, we drive the next chapter of growth for HelloFresh by powering marketing with advanced MarTech capabilities and product innovation. We focus on (re) acquisition, conversion optimization, and data-driven growth strategies.\n\nAs a Staff Data Scientist in Conversions, you will be at the heart of shaping the intelligence that drives customized user journeys across our funnels. You will lead complex feature engineering and optimization efforts, designing the data foundations and analytical approaches that power our state-of-the-art decisioning platform for personalized experiences.\n\nYour work will enable this automated engine to determine the right journey, for the right user, at the right time, based on intent, channel, and campaign context. You will operate at a strategic level, influencing how personalization is designed, evaluated, and scaled across teams. This is a high-impact role with direct responsibility for advancing our data strategy and improving how millions of users experience HelloFresh across markets.\n\nWhat you'll do\n\nDecisioning, Modeling &amp; Strategy\n\nOwn and evolve the data and modeling strategy behind customized journeys and funnel decisioning\n\nLead complex feature engineering initiatives that improve decision quality, robustness, and scalability\n\nDesign, implement, and evaluate machine learning approaches for large-scale personalization and routing decisions\n\nDefine standards for model validation, monitoring, and experimentation to ensure long-term reliability and impact\n\nCross-Functional Leadership\n\nAct as a strategic partner to Product, Engineering, and Marketing, shaping how decisioning capabilities are embedded into our conversions funnels and experiences\n\nDrive alignment across teams on how personalization is measured, iterated, and scaled\n\nInfluence roadmap and priorit...",
    "salary": null,
    "job_type": null,
    "department": "Tech "
  },
  {
    "id": "7434207",
    "title": "Senior Marketing Data Analyst",
    "company": "HelloFresh",
    "url": "https://careers.hellofresh.com/global/en/job/7434207?gh_jid=7434207",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-27T03:20:19-05:00",
    "source": "Greenhouse:hellofresh",
    "scraped_at": "2026-01-15T20:14:09.059864",
    "domain": "hellofresh.com",
    "description": "The role\n\nAs a Senior Marketing Data Analyst in our Global Marketing Analytics organisation, you will play a pivotal role in driving data-informed decision-making at HelloFresh. Based in our Berlin Headquarters, you’ll join the Market Insights team - an internal analytics function supporting senior leadership across 15+ HelloFresh markets spanning 3 continents.\n\nYou will turn data into strategic recommendations, challenge the status quo, and directly shape how our global brands grow and operate.\n\nWhat You’ll Do\n\nAct as a trusted advisor to Global Marketing leadership: understand their challenges, frame analytical problem statements, and translate insights into actionable strategic recommendations\n\nMeasure, benchmark, and monitor brand and market performance, proactively identifying opportunities to improve key Marketing and business KPIs\n\nInfluence and optimize Marketing budgets and planning processes by challenging assumptions and ensuring data-driven decision making\n\nLead high-impact analytical projects, often partnering directly with senior stakeholders to enhance performance frameworks, forecasting, growth strategies, and reporting ecosystems\n\nBuild and enhance reporting and visualization assets that support day-to-day decision-making and strengthen global performance oversight\n\nCollaborate with and mentor analysts within the team, fostering a high-performing and supportive analytics community\n\nStreamline analytical processes and workflows, championing scalable and automated solutions\n\nWhat You’ll Bring\n\nA motivated, collaborative mindset with strong team-working skills and a passion for solving complex business problems\n\n5+ years of experience in Marketing Analytics, Finance Analytics, or a related quantitative field—ideally in a fast-paced B2C or subscription business\n\nStrong understanding of Marketing and Growth metrics, and how they connect to overall business performance\n\nA results-oriented and structured approach, able to turn vague or ambiguous business q...",
    "salary": null,
    "job_type": null,
    "department": "Marketing"
  },
  {
    "id": "7349066",
    "title": "Senior Data Scientist, MarTech Alliance (m/f/x)",
    "company": "HelloFresh",
    "url": "https://careers.hellofresh.com/global/en/job/7349066?gh_jid=7349066",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-23T09:52:32-05:00",
    "source": "Greenhouse:hellofresh",
    "scraped_at": "2026-01-15T20:14:09.059370",
    "domain": "hellofresh.com",
    "description": "The Role\n\nAre you ready to drive a huge business impact? As Senior Data Scientist for AdTech Search Optimisation, you will be responsible to maximise the performance of our Search channels. Your work will be crucial to increase return on investment for HelloFresh’s marketing budget. Hence you will have a direct impact on the company’s goals to drive and increase marketing efficiency.\n\nIn this role, you will design and implement statistical and machine learning models which take into account various data sources from internal conversion data to external ads platform data.\n\nTo succeed in this role you will be curious, a fast learner, and someone who relentlessly prioritises problem statements and tailor the solution accordingly. You will be comfortable suggesting multiple solutions based on your experience, and prioritizing tasks based on effort and likely impact.&nbsp;\n\nWhat you’ll do:\n\nJoin and become an integral part of an amazing and fun team consisting of highly skilled data scientists, and engineers\n\nCollaborate closely within cross-functional teams (engineering, product, marketing) to translate business objectives into concrete, data-driven strategies.\n\nTake ownership of our scientific optimisation models and algorithms from data collection to operationalization and closely align them with non-technical stakeholders\n\nExperiment and explore opportunities to constantly improve and refine the approaches\n\nLeverage statistical analysis and machine learning algorithms in development and production to enhance our incrementality measurements solutions\n\nThink out of the box to come up with new ways of how we can improve our data products we deliver to our stakeholders\n\nMentor and support data scientists and colleagues, fostering a collaborative and knowledge-sharing environment.\n\nWhat you’ll bring\n\nProven track record of scientific work in your Bachelors, Masters or PhD in statistics, physics, economics, mathematics, data science or similar.\n\nLong-term (3+ yrs) work exp...",
    "salary": null,
    "job_type": null,
    "department": "Tech "
  },
  {
    "id": "7428569",
    "title": "Senior Data Scientist, MarTech Alliance (f/m/x) ",
    "company": "HelloFresh",
    "url": "https://careers.hellofresh.com/global/en/job/7428569?gh_jid=7428569",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-29T04:03:11-05:00",
    "source": "Greenhouse:hellofresh",
    "scraped_at": "2026-01-15T20:14:09.059177",
    "domain": "hellofresh.com",
    "description": "The Role\n\nAs a Senior Data Scientist on the AI Decisioning team in the Communications Tribe, you will be at the heart of optimizing the intelligence that transforms HelloFresh's customer engagement strategy. You will focus on complex feature engineering and optimization, developing the critical data features and applying advanced analytical techniques to maximize the performance of our state of the art AI decisioning platform. Your work provides the rich, predictive data and continuous optimization that allows this automated engine to determine the right message, for the right customer, at the right time, on the right channel. This is a unique opportunity to drive impactful business outcomes through enhanced personalization and predictive analytics , while also exploring how Generative AI can automate and scale content in an iterative process with marketing stakeholders, directly influencing how we engage with millions of customers globally\n\nWhat You’ll Do\n\nIn this role, you will be a key contributor to our decisioning intelligence. You will take ownership of critical analytical initiatives while applying advanced analytics and collaborating across the business to drive impact.\n\nModeling &amp; Optimization\n\nLead Predictive Analysis: Lead the development and application of machine learning models to solve complex business problems, from churn prediction to large-scale personalization\n\nDevelop &amp; Validate Data Features: Develop, prepare, and validate the critical data features that fuel our models, ensuring they are robust and predictive\n\nChampion Model Performance: Drive improvements in model quality and reliability by implementing best practices in validation, monitoring, and A/B testing\n\nStrategic Collaboration &amp; Impact\n\nEnable Data-Driven Decisions: Partner with Product and Marketing teams, translating complex findings into actionable insights that guide strategy\n\nAct as a Strategic Analytics Partner: Proactively collaborate with stakeholders to frame busin...",
    "salary": null,
    "job_type": null,
    "department": "Tech "
  },
  {
    "id": "7511754",
    "title": "Senior Data Scientist, Growth Alliance(m/f/d)",
    "company": "HelloFresh",
    "url": "https://careers.hellofresh.com/global/en/job/7511754?gh_jid=7511754",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-23T09:52:39-05:00",
    "source": "Greenhouse:hellofresh",
    "scraped_at": "2026-01-15T20:14:09.058897",
    "domain": "hellofresh.com",
    "description": "The role\n\nAs a Senior Data Scientist in Conversions, you will play a key role in shaping the intelligence that drives customized user journeys across our funnels. You will work on complex feature engineering and optimization efforts, contributing to the data foundations and analytical approaches that power our decisioning platform for personalized experiences. Your work will help enable an automated engine that determines the right journey, for the right user, at the right time, based on intent, channel, and campaign context. You will operate in a highly cross-functional environment, partnering closely with Product, Engineering, and Marketing to design, evaluate, and scale personalization across teams. This is a high-impact role with direct responsibility for advancing our data strategy and improving how millions of users experience HelloFresh across markets.\n\nWhat you'll do\n\nBuild and iterate on machine learning models powering personalisation that run in production behind high-traffic, performance-critical conversion pages.\n\nWork on decisioning models that determine the best next step in the conversion funnel for each user.\n\nContribute to system design by working with Engineering to ensure data science solutions integrate cleanly into the overall funnel architecture.\n\nWork directly with Product and Engineering to shape how ML-driven decisions are embedded into the conversion funnels, including where models decide and how failures are handled.\n\nOwn experimentation design for decisioning models, defining success metrics, guardrails, and how results are interpreted in high-noise, high-traffic environments.\n\nEnsure models remain safe and effective in production by monitoring performance, input data reliability, and latency, and iterating when issues are detected.\n\nWhat you’ll bring\n\n5+ years of professional experience in data science or a related quantitative field.\n\nStrong foundation in machine learning concepts relevant to personalization and marketing communication...",
    "salary": null,
    "job_type": null,
    "department": "Tech "
  },
  {
    "id": "7408641",
    "title": "Marketing Data Analyst - Actives (m/f/x)",
    "company": "HelloFresh",
    "url": "https://careers.hellofresh.com/global/en/job/7408641?gh_jid=7408641",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-23T09:52:34-05:00",
    "source": "Greenhouse:hellofresh",
    "scraped_at": "2026-01-15T20:14:09.057987",
    "domain": "hellofresh.com",
    "description": "The role\n\nAs a Senior Marketing Data Analyst – Actives in Global Marketing Analytics, you will help shape data-driven Marketing strategies focused on the existing HelloFresh customer base across 30+ markets on 3 continents. Based in our Berlin Headquarters, you’ll partner closely with the Global Actives Engagement Marketing function to drive customer engagement, retention, and overall business performance.\n\nWhat you’ll do\n\nAct as a trusted advisor to the Global Actives Engagement Marketing function: understand their challenges, turn data into clear analytical problem statements, and translate insights into actionable strategic recommendations\n\nBuild and evolve reporting and visualization assets that support day-to-day decision-making and strengthen global performance oversight\n\nMeasure, benchmark, and monitor Global Actives Engagement performance, proactively identifying opportunities to improve key customer and business KPIs\n\nLead high-impact analytical projects, partnering closely with Marketing, and also Product and Tech stakeholders to drive clarity and alignment cross-functionally\n\nStreamline analytical processes, championing scalable, automated and standardised solutions\n\nCoach and mentor more junior analysts within Global Marketing Analytics, contributing to a supportive and high-performing analytics community\n\nWhat you’ll bring\n\nA motivated, collaborative mindset with strong team-working skills and a passion for solving complex business problems\n\n5+ years of experience in Customer Analytics, Marketing Analytics, or a related quantitative field—ideally in a fast-paced B2C or subscription business\n\nStrong understanding of Customer Engagement/ Retention metrics and how they connect to overall business performance\n\nA structured, results-oriented approach with the ability to turn ambiguous questions into clear analytical frameworks and insights\n\nSolid technical skills, including:\n\nSQL and Spreadhseets (required)\n\nTableau or a similar visualisation tool (e.g. Look...",
    "salary": null,
    "job_type": null,
    "department": "Marketing"
  },
  {
    "id": "1283486501",
    "title": "Information Systems Security Engineer (m/f/d)- Sovereign Cloud Delivery Germany",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/St_-Leon-Rot-Information-Systems-Security-Engineer-%28mfd%29-Sovereign-Cloud-Delivery-Germany-68789/1283486501/",
    "location": "St. Leon-Rot, DE, 68789",
    "city": "St. Leon-Rot",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-01-14T21:12:18.405590",
    "domain": null,
    "description": ">\r\n\nWhat you will do\r\n\nConfigure, maintain, administer and deploy a wide range of cyber security technologies such as IDS/IPS, EDR/XDR, SIEM, SOAR, Cloud vulnerability assessment, cloud-native security technologies (CSPM, CNAPP, CASB, CIEM, etc…)\r\n\nProvide technical leadership in the architecture, design, deployment, management, configuration and use of Cyber Security technologies\r\n\nDevelop configuration controls and automations to identify compliance gaps\r\n\nIdentify gaps in our current processes, workflows, designs, and controls\r\n\nSolve complex problems using data driven recommendations for changes and improvements while considering people, processes, and technology\r\n\nProvide mentoring and contribute to the overall growth and development of the team\r\n\nWhat you will bring\r\n\nBachelor's degree, ideally in Cyber Security, Information Security, Computer Science, Engineering, Information Technology\r\n\nMinimum 3 years of practical experience in a Security Engineer role working with cloud technologies\r\n\nKnowledge of cloud security, vulnerability management, major security compliance and development frameworks and principles\r\n\nMastery in at least one of the SecDevOps practices, such as Security as Code, CI/CD, Infrastructure as Code, Secure Coding Practices, Cloud Governance and Compliance…\r\n\nExperience working with cloud native security platforms a plus - CNAPP, CWPP, CSPM, CIEM, etc...\r\n\nIn-depth technical knowledge of cloud platforms - AWS, Azure, and GCP.\r\n\nPrevious work experience with the various phases of security incident response\r\n\nExperience working in a dynamic environment requiring collaboration across multiple organizations\r\n\nStrong analytical and reasoning, problem-solving, and decision-making skills\r\n\nWillingness to expand and grow\r\n\nExcellent written, oral communication, and documentation skills\r\n\nA keen curiosity about all aspects of cyber security (especially in the Cloud)\r\n\nUse industry sources to stay current with known Cloud security issues\r\n\nPersonable,...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "R0043400",
    "title": "Machine Learning Engineer, CV",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/Vienna-Austria/Machine-Learning-Engineer--CV_R0043400-1",
    "location": "Vienna, Austria",
    "city": "Vienna",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.726106",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "R0043108",
    "title": "Machine Learning Platform Engineer",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/Vienna-Austria/Machine-Learning-Platform-Engineer_R0043108-1",
    "location": "Vienna, Austria",
    "city": "Vienna",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.726106",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "R0043783",
    "title": "Lead Machine Learning Engineer, Gen AI",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/London-United-Kingdom/Machine-Learning-Engineer_R0043783",
    "location": "London, United Kingdom",
    "city": "London",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.725109",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "R0043784",
    "title": "Machine Learning Engineer, Gen AI",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/London-United-Kingdom/Machine-Learning-Engineer_R0043784",
    "location": "London, United Kingdom",
    "city": "London",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.725109",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "R0043787",
    "title": "Senior Machine Learning Engineer, Gen AI",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/London-United-Kingdom/Machine-Learning-Engineer_R0043787",
    "location": "London, United Kingdom",
    "city": "London",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.725109",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "R0043764",
    "title": "Machine Learning Engineering Manager, Gen AI",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/London-United-Kingdom/Machine-Learning-Engineering-Manager_R0043764",
    "location": "London, United Kingdom",
    "city": "London",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.725109",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "R0041758",
    "title": "Software Engineer, ML Infrastructure",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/London-United-Kingdom/Software-Engineer--ML-Infrastructure_R0041758",
    "location": "London, United Kingdom",
    "city": "London",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.725109",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "7522593",
    "title": "Senior Marketing Data Analyst",
    "company": "N26",
    "url": "https://n26.com/en-eu/careers/positions/7522593?gh_jid=7522593",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-15T09:08:10-05:00",
    "source": "Greenhouse:n26",
    "scraped_at": "2026-01-12T20:27:49.771786",
    "domain": "n26.com",
    "description": "About the opportunity\n\nAs a Senior Data Analyst focusing on our Acquisition segment, you will enable our Marketing team to make data-driven decisions. You will monitor, measure and analyse the effectiveness of your marketing teams’ initiatives, as well as help drive the strategy of your stakeholder teams. You are here to establish a data-mindset and thereby to foster a culture of continuous learning and improvement. You will work in a cross functional setup, working closely with other analysts, engineers, scientists and marketing managers.\n\n&nbsp;\n\nIn this role, you will:\n\nLead the Acquisition Measurement team: own the Acquisition Marketing Measurement domain roadmap and prioritisation with stakeholders from both Business and Technical backgrounds.\n\nContribute to OKRs and goals definitions: goals: develop clear and measurable targets based on an initiatives’ scope.\n\nAct as a Partner to Marketing Stakeholders: be an internal go-to-person for several Marketing&nbsp; teams (incl. Paid Media, Marketing Strategy, Friend Referral, Product Marketing) when it comes to data related questions and measurement strategy.\n\nCollaborate with Senior Leadership: advising on Measurement techniques and evaluating and presenting results or complexity analysis on a strategic level, helping to steer business decisions that drive overall company success.\n\nDrive Marketing Science initiatives: act as the Analytics focal point on Marketing Mix Model (in collaboration with Data Science &amp; Analytics Engineering); increase adoption of Customer Lifetime Value by Marketing Acquisition channels; own the Acquisition Marketing Test &amp; Learn workstream end-to-end, from experiments design to analysis and share-out.&nbsp;\n\nBuild scalable, reliable, and self-serve resources: Enrich analytics foundations through Measurement Frameworks, scalable Data Modeling lineage, and design (and maintain) Analytics dashboards that allow Marketing Teams to interact with data to monitor channel and campaigns perfo...",
    "salary": null,
    "job_type": null,
    "department": "Marketing Data"
  },
  {
    "id": "1265850501",
    "title": "Senior Sovereign Cloud Architect & Advisor (f/m/d)",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/St_-Leon-Rot-Senior-Sovereign-Cloud-Architect-&amp;-Advisor-%28fmd%29-68789/1265850501/",
    "location": "St. Leon-Rot, DE, 68789",
    "city": "St. Leon-Rot",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-01-12T09:09:47.586810",
    "domain": null,
    "description": "an>\r\n\nWhat you'll do\r\n\nAre you a cloud maestro who can orchestrate the hybrid/multi-cloud environment, having a visionary mindset to translate the customer needs to Sovereign cloud strategies with technical precision, strategic governance, and effective cross-team coordination.\r\n\nExpectation and Tasks\r\n\nPresent Sovereign Cloud offering, technical details, and engagement model, managed service offerings to customers and stakeholders.\r\n\nPresent the technical and value proposition for private cloud on various platforms (AWS, Azure, GCP, SCI etc.)\r\n\nEnable the customer to understand Sovereign cloud principles, operational aspects, and managed services\r\n\nAdvise on non-functional capabilities like Business Continuity, Security, Compliance\r\n\nProvide ongoing deal support by being part of VAT and a trusted advisor\r\n\nHandover to delivery for deployment / provisioning\r\n\nWhat you bring\r\n\nRequired Skills\r\n\n6+ years of customer facing and SAP consulting experience with high proficiency in customer communication and presentation\r\n\nGood understanding of SAP solution releases and dependencies \r\n\nGood understanding of the hyperscaler like AWS, Azure, GCP and SCI capabilities \r\n\nSAP HANA, S/4 HANA, SAP NetWeaver, OS/DB migration, SAP HANA, TOGAF certifications\r\n\nProficiency in SAP product portfolio, Industry solutions and offerings, specifically knowledge of SAP BTP and Integration\r\n\nSelf-sufficient and work under critical timelines, continuous learne\r\n\nWillingness to go through personal security clearance (Government process)\r\n\nPreferred Skills\r\n\nPrior experience in pre-sales \r\n\nExperience in service delivery, ITSM , SAP system operations and management\r\n\nCertification of the hyperscaler AWS, Azure, GCP \r\n\nThe position can also be filled in part time.\r\n\nMeet the team\r\n\nSovereign Cloud solutions help organizations comply with data privacy, residency, and sovereignty laws by keeping information systems within national borders.  SAP Sovereign Cloud Services is a specialized unit within ...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "1281287201",
    "title": "(Senior) DevOps Engineer (f/m/d) AI Core Operations",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/Walldorf-%28Senior%29-DevOps-Engineer-%28fmd%29-AI-Core-Operations-69190/1281287201/",
    "location": "Walldorf, DE, 69190",
    "city": "Walldorf",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-01-12T09:09:47.586800",
    "domain": null,
    "description": "h, great benefits, and a team that wants you to grow and succeed. \r\n\nWhat you'll do\r\n\nReady to take ownership of a large-scale AI platform? We're looking for a (Senior) DevOps Engineer (f/m/d) to help us run, automate, and scale SAP's AI Core services. In this role, you’ll work across different technologies to ensure our platform is stable, secure, and performs flawlessly for our users. Your tasks include to:\n\nDesign, build, and automate our cloud infrastructure using Kubernetes and Infrastructure as Code (IaC) to ensure it's scalable, reliable, and secure.\r\n\nDevelop our observability stack (monitoring, logging, tracing) to guarantee platform health and drive continuous improvements in our systems and practices.\r\n\nPartner closely with development, security, and quality teams to create a seamless and robust platform.\r\n\nEmbrace a \"you build it, you run it\" culture. This includes participating in an on-call rotation to support the systems you help create.\n\nWhat you bring\r\n\n5+ years of relevant professional experience with a focus on Kubernetes and Helm, including deployment, scaling, and troubleshooting.\r\n\nHands-on experience with observability tools such as VictoriaMetrics, Loki, Jaeger and/or Grafana.\r\n\nStrong troubleshooting skills and a willingness to ensure platform reliability through participation in an on-call rotation. \r\n\nSkilled in managing cloud resources via Infrastructure as Code (IaC), with strong proficiency in scripting and automation using Go, Python, Bash, or other.\r\n\nFluent English language skills, both written and spoken with excellent communication and collaboration skills.\r\n\nBeneficial\r\n\nFamiliarity with SAP BTP (Business Technology Platform) \r\n\nKnowledge of Crossplane for managing infrastructure as data\n\n#SAPAICareers #SAPBusinessAICareers #SAPEUAICloudCareers\r\n\n​\r\n\nBring out your best\nSAP innovations help more than four hundred thousand customers worldwide work together more efficiently and use business insight more effectively. Originally known...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "1265850801",
    "title": "Expert Sovereign Cloud Architect & Advisor (f/m/d)",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/St_-Leon-Rot-Expert-Sovereign-Cloud-Architect-&amp;-Advisor-%28fmd%29-68789/1265850801/",
    "location": "St. Leon-Rot, DE, 68789",
    "city": "St. Leon-Rot",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-01-12T09:09:47.586791",
    "domain": null,
    "description": "an>\r\n\nWhat you'll do\r\n\nAre you a cloud maestro who can orchestrate the hybrid/multi-cloud environment, having a visionary mindset to translate the customer needs to Sovereign cloud strategies with technical precision, strategic governance, and effective cross-team coordination.\r\n\nExpectation and Tasks\r\n\nPresent Sovereign Cloud offering, technical details, and engagement model, managed service offerings to customers and stakeholders.\r\n\nPresent the technical and value proposition for private cloud on various platforms (AWS, Azure, GCP, SCI etc.)\r\n\nConduct customer assessment workshops to define the cloud roadmap from As-is to To-Be\r\n\nEnable the customer to understand Sovereign cloud principles, operational aspects, and managed services\r\n\nPlan the migration roadmap together with partners, system integrators and or SAP Professional Services\r\n\nAdvise on non-functional capabilities like Business Continuity, Security, Compliance\r\n\nOwn technical discussions with the customer and liaise internally\r\n\nProvide ongoing deal support by being part of VAT and a trusted advisor\r\n\nHandover to delivery for deployment / provisioning\r\n\nWhat you bring\r\n\nRequired Skills\r\n\n8+ years of customer facing and SAP consulting experience with high proficiency in customer communication and presentation\r\n\nGood understanding of SAP solution releases and dependencies\r\n\nSolid understanding of cloud and platform stacks like virtualization, compute, network, storage \r\n\nGood understanding of the hyperscaler like AWS, Azure, GCP and SCI capabilities \r\n\nSAP HANA, S/4 HANA, SAP NetWeaver, OS/DB migration, SAP HANA, TOGAF certification\r\n\nHigh proficiency in SAP product portfolio, Industry solutions and offerings, specifically high-level knowledge about SAP BTP and Integration\r\n\nSelf-sufficient and work under critical timelines, continuous learner\r\n\nWillingness to go through personal security clearance (Government process)\r\n\nPreferred Skills\r\n\nKnowledge of Cybersecurity, FIPS, Data Privacy laws \r\n\nPrior experi...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "1259638401",
    "title": "Sovereign Cloud Expert DevOps Engineer (f/m/d) - SAP SuccessFactors (HCM)",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/St_-Leon-Rot-Sovereign-Cloud-Expert-DevOps-Engineer-%28fmd%29-SAP-SuccessFactors-%28HCM%29-68789/1259638401/",
    "location": "St. Leon-Rot, DE, 68789",
    "city": "St. Leon-Rot",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-01-12T09:09:47.586777",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "1276633501",
    "title": "Site Reliability Engineer - SCI (f/m/d)",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/Berlin-Site-Reliability-Engineer-SCI-%28fmd%29-10557/1276633501/",
    "location": "Berlin, DE, 10557",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-01-12T09:09:47.586767",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "1258190301",
    "title": "Network Engineer Expert (m/f/d) - Sovereign Cloud Germany",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/St_-Leon-Rot-Network-Engineer-Expert-%28mfd%29-Sovereign-Cloud-Germany-68789/1258190301/",
    "location": "St. Leon-Rot, DE, 68789",
    "city": "St. Leon-Rot",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-01-12T09:09:47.586758",
    "domain": null,
    "description": "t network infrastructure to deliver exceptional support to our customers.\r\n\nWhat you'll do:\r\n\nOperate and maintain complex Hyperscaler/SAP Cloud Infrastructure networks, track significant problems, monitor performance, and perform upgrades as required.\r\n\nEngage with customers in network architecture discussions to meet their security requirements.  \r\n\nImprove our network concepts based on customer feedback.\r\n\nRespond to and resolve escalated customer requests in a timely fashion.\r\n\nParticipate in deep level incident troubleshooting.\r\n\nParticipate in complex change preparation and execution.\r\n\nOther support tasks, duties, and responsibilities, e.g., hardware installations, troubleshooting, and administration\r\n\nWhat you bring:\r\n\nBachelor's Degree in Computer Science, Information Systems, Computer Engineering, or related field\r\n\nStrong experience with Hyperscaler networking (AWS, Azure or GCP) and/or SAP Cloud Infrastructure.\r\n\nExperience managing networking for SAP’s solutions, e.g. S/4, BTP, etc.\r\n\nExperience implementing security on AWS with VPC, IAM, Security Groups, UTM solutions, NACLS, etc.)\r\n\nPerform and lead diagnostics of problems, troubleshoot and develop solutions on AWS, Azure & GCP\r\n\nImplement security requirements across all Cloud platforms\r\n\nA willingness to work in a 24/7 environment with on-call duties and flexibility to work in shifts is required, ensuring consistent coverage and support. The role includes an attractive remuneration package for shift work and on-call duties\r\n\nCommitment to maintaining daily office presence for efficient team collaboration\r\n\nDue to the potentially classified nature of our work, your willingness is required to subject yourself to a governmental security clearance process\r\n\n​\r\n\nBring out your best\nSAP innovations help more than four hundred thousand customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software,...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "7293242",
    "title": "Senior Director, Data Science (all genders)",
    "company": "HelloFresh",
    "url": "https://careers.hellofresh.com/global/en/job/7293242?gh_jid=7293242",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-23T09:52:31-05:00",
    "source": "Greenhouse:hellofresh",
    "scraped_at": "2026-01-12T09:09:45.025899",
    "domain": "hellofresh.com",
    "description": "About the role: What's in the Box\n\nAs a Senior Director of Data Science, you will lead a multidisciplinary organization of data scientists, data engineers and analysts who partner deeply with product and engineering teams to drive measurable business impact. Your mission is to elevate how data, experimentation, and machine learning power our products and decisions - focusing on all aspects of personalization and search for the consumer product organization.\n\nWhat you’ll do: The Recipe\n\nDefine the Strategy: Set and execute the holistic data science and data engineering strategy, aligning model innovation with consumer product objectives and company goals, specifically focusing on all aspects of personalization and search.\n\nLead the Organization: Build and lead a multidisciplinary organization (Data Engineering, Product Analytics, Data Scientists/ML Engineers).\n\nDrive Personalization: Define and execute the strategy for smart personalization, including ranking, recommendations, and behavioral analysis to maximize customer-facing impact and order rate for both subscribers and non-subscribers.\n\nEnsure Productionization: Oversee the design, development, and deployment of ML models, pipelines, and data products, ensuring the team moves models from development to reliable, scalable production with strong ML Ops and feedback loops.\n\nChampion the Culture: Embed a data-first and experimentation-driven culture across product teams, supporting discovery and decision-making with causal inference, advanced analytics, and ensuring data quality and governance.\n\nLead Cross-Functionally: Act as a credible voice with executive stakeholders, clearly communicating the impact of data initiatives and ensuring KPI alignment with business outcomes, not just model performance.\n\nWhat you’ll bring: The Ingredients\n\n10+ years of experience in Data Science or ML, with 5+ years in leadership roles.\n\nProven success leading multidisciplinary teams (data science, data engineering, ML).\n\nGood underst...",
    "salary": null,
    "job_type": null,
    "department": "Data - General "
  },
  {
    "id": "2720306",
    "title": "Senior Applied Scientist (GenAI & Computer Vision) - Size & Fit (All Genders)",
    "company": "Zalando",
    "url": "https://jobs.zalando.com/en/jobs/2720306-Senior-Applied-Scientist-(GenAI-%26-Computer-Vision)",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "ZalandoScraper",
    "scraped_at": "2026-01-12T09:09:44.468092",
    "domain": null,
    "description": "EN\nDE",
    "salary": null,
    "job_type": null,
    "department": "Applied Science & Research"
  },
  {
    "id": "2722068",
    "title": "Principal Applied Scientist (Economics / Experimentations) - Size & Fit (All Genders)",
    "company": "Zalando",
    "url": "https://jobs.zalando.com/en/jobs/2722068-Principal-Applied-Scientist-(Economics-%2F-Experimen",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "ZalandoScraper",
    "scraped_at": "2026-01-12T09:09:44.468077",
    "domain": null,
    "description": "EN\nDE",
    "salary": null,
    "job_type": null,
    "department": "Applied Science & Research"
  },
  {
    "id": "2722050",
    "title": "Applied Scientist - Merchandise Integrity (all genders)",
    "company": "Zalando",
    "url": "https://jobs.zalando.com/en/jobs/2722050-Applied-Scientist---Merchandise-Integrity-(all-gen",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "ZalandoScraper",
    "scraped_at": "2026-01-12T09:09:44.468068",
    "domain": null,
    "description": "EN\nDE",
    "salary": null,
    "job_type": null,
    "department": "Applied Science & Research"
  },
  {
    "id": "2722523",
    "title": "Principal Applied Scientist - ZMS (all genders)",
    "company": "Zalando",
    "url": "https://jobs.zalando.com/en/jobs/2722523-Principal-Applied-Scientist---ZMS-(all-genders)",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "ZalandoScraper",
    "scraped_at": "2026-01-12T09:09:44.468033",
    "domain": null,
    "description": "EN\nDE",
    "salary": null,
    "job_type": null,
    "department": "Applied Science & Research"
  },
  {
    "id": "744000089288603",
    "title": "Senior/Staff Data Analyst - People Analytics",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000089288603",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2025-10-22T15:15:02.853Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-12T09:09:41.241745",
    "domain": "deliveryhero.com",
    "description": "We are on the lookout for a Senior/Staff Data Analyst - People Analytics to join the People & Culture team on our journey to always deliver amazing experiences.&#xa0;\nJoin the team that champions the employee experience at Delivery Hero. As part of the People & Culture Team, you’ll help attract, develop, and retain top talent, creating a workplace where people feel valued, supported, and empowered to grow. With each initiative you support, you’ll be building a positive culture that fuels innovation, teamwork, and a sense of belonging across our global organization.\nYou'll collaborate closely with senior business stakeholders, People & Culture Department leaders, and regional P&C teams from across the world, transforming raw data into actionable intelligence. You’ll analyze people data, identify trends, and develop strategies for optimization. Your work will directly impact decision making at Delivery Hero, fueling organizational performance and enhancements in employee experience with the generation of advanced data insights and predictive intelligence. You’ll be a key contributor to improving our operational excellence and strategic planning.\nDevelop, maintain and improve analytical pipelines to ensure efficient data processing and reporting.\nProactively analyse people data to identify trends and establish key performance metrics to monitor areas for improvement and optimisation.&#xa0;\nPartner with stakeholders to understand their data needs and provide actionable insights.\nCommunicate findings and recommendations to stakeholders through clear and concise reports and presentations. Translating technical information into digestible content to drive action plans and decision-making.&#xa0;\nRaise the bar in the data analysis of employee attrition, org design, efficiency drivers, D&I and other key metrics that bring best practices to the People & Culture department.\nDrive data literacy training and upskill people&#xa0;partners and other key stakeholders in the use and u...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000097517559",
    "title": "Senior Software Engineer (Machine Learning) - Quick commerce",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000097517559",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2025-12-08T13:01:25.512Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-12T09:09:40.159185",
    "domain": "deliveryhero.com",
    "description": "We are on the lookout for a Senior Software Engineer (Machine Learning) to join the Quick Commerce Data Science team on our journey to always deliver amazing experiences.&#xa0;\nAs part of the Integrated Partners Science team, you’ll be part of the ideation, design, prototyping and deployment of Data Products that help solve and scale solutions for our local business partners. A couple examples are: recommendations system for item replacement and a Data Product to help reduce items being out of stock when a picker is fulfilling the orders.\nAs a Senior Software Engineer, your primary value lies in tackling problems at scale by building and maintaining the high-performance serving layer for our ML models. A core part of this is integrating multiple microservices in real-time to fetch external data, apply business rules, and enforce operational constraints to enrich model predictions and shape the final decision. This critical layer directly impacts the algorithm's logic, leading to best-in-class efficiency and service across the Delivery Hero network.\n\nScale and Perform: Architect and build solutions at scale, optimizing for low-latency performance and high efficiency in production.\n\nSystem Ownership: Take end-to-end ownership of the backend serving layer, from design through deployment and maintenance.\n\nCollaborate and Optimize: Work closely with Data Scientists, Analysts, and Data Engineers to understand needs and build solutions that optimize their workflows and transition models to production.\n\nInnovate and Suggest: Proactively suggest how the team can leverage new technologies and architectures to support new use cases.\n\nLeverage Cloud: Utilize modern technologies and public cloud infrastructure to build highly available systems for multiple teams using CI/CD and Infrastructure as Code.\n&#xa0;\nBe part of redefining how customers experience quick commerce. You’ll help build technology that scales our non-food offerings, reaching new market segments and driving reve...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000099127020",
    "title": "Senior Data Scientist - (Logistics, Workforce)",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000099127020",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2025-12-16T10:30:55.916Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-12T09:09:40.159148",
    "domain": "deliveryhero.com",
    "description": "We are looking for a Senior Data Scientist - Logistics, Workforce to join our Logistics team to help us create a fast, reliable and transparent delivery experience. You will make an impact in optimizing our on-demand last-mile delivery operations, involving hundreds of thousands of couriers and restaurants, improving the experience for millions orders per day in 70+ countries.&#xa0;\nYour mission:\n\nConceptualize the right modeling approach for challenges in the field of Logistics at scale, together with your squad lead and our stakeholders.\n\nInnovate new modeling solutions by drawing from fields like Machine Learning, Operations Research and&#xa0; Statistics that drive value for our business.\n\nPair-program with your squad to engineer solutions that automate the retraining of models and generation of predictions.\n\nProvide ideas in brainstorming sessions with your Data Science colleagues to solve the toughest modeling problems together.\n\nHelp defining data needs to bring value to the projects, collaborate with the data engineering and tech teams in planning their roadmap.\n\nWork with (semi-)structured data from our BigQuery DWH architecture and process with Spark where necessary.&#xa0;",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000099135684",
    "title": "Director, Data Science - Deep Learning & AI",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000099135684",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2025-12-16T11:21:12.813Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-12T09:09:40.159144",
    "domain": "deliveryhero.com",
    "description": "We are seeking a Director of Data Science, Deep Learning to lead our deep learning team within the AdTech space, specifically within the Vendor Data team, to shape the future of AI-driven ads and deals at Delivery Hero. In this pivotal role, you will jointly architect state-of-the-art deep learning models, influence AI strategy, and develop cutting-edge methodologies to significantly enhance the success of thousands of vendors - restaurants, shops, and local businesses - across our platform.\nAs a senior leader within the Vendor Team, you will be instrumental in building and optimising our AdTech products by leveraging advanced deep learning techniques. These AI models will play a pivotal role in our AdTech ecosystem, helping vendors to maximise visibility, enhance their conversion rate, and drive substantial revenue growth.\nOperating in nearly 70 countries, our AdTech infrastructure connects millions of businesses with their ideal customers daily. With AdTech projected to generate over €1 billion in revenue in 2024/25, your leadership in deep learning-driven data will be critical in shaping our profitability strategy and advancing our market position.\nKey Responsibilities:\n\nDeep Learning Mastery: Exceptional expertise in designing and implementing advanced deep learning architectures, particularly transformers and other sequence-based attention-driven AI models, generative ranking approaches, and long-term interest networks for sophisticated user personalisation in AdTech.\n\nRigorous Model Evaluation and Business Impact: Proficient in establishing comprehensive evaluation frameworks for deep learning models, encompassing both internal model-centric metrics (such as NCE, ROCAUC, PRAUC) and the meticulous measurement of business metrics during live A/B testing and experimentation.\n\nCross-Functional Leadership and Alignment: Demonstrated ability to collaborate and align effectively across diverse functions, including engineering, commercial, and product teams, to drive ...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000099336285",
    "title": "Principal Data Scientist - AdTech Ranking",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000099336285",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2025-12-17T12:14:55.613Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-12T09:09:40.159125",
    "domain": "deliveryhero.com",
    "description": "We are on the lookout for Principal Data Scientists to join the AdTech data science team (Ranking Team) on our journey to always deliver amazing experiences.\nAs part of our Vendor Team, you’ll be the driving force behind the success of thousands of restaurants, shops, and local businesses. Your contributions will empower vendors with advanced tools to manage their operations, boosting their visibility, and reach. Every feature you help build will create growth opportunities for businesses of all sizes, strengthening Delivery Hero’s ecosystem and impact.\nAt Delivery Hero, AdTech introduces people to new food they love and enables our partners to meet their future customers at the perfect moment. We have developed a range of products to offer advertising solutions for restaurants helping them to increase their visibility and reach, improve their order conversion, and eventually drive more sales by covering the entire marketing funnel. Operating across over 50 countries around the clock, our Ad Tech connects the ideal advertiser with the ideal customer millions of times every day. Ad Tech is a fundamental area for us on our path to profitability. our data science team is at the heart of this growth, powering personalisation, Ranking, relevance, and recommendation.&#xa0;\nYou will be a thought leader, driving innovation by designing and deploying our models to the forefront of technology to solve complex problems, delivering revenue for Delivery Hero at the frontline of our growth & profitability journey. In this role you will\n&#xa0;\nDrive transformative innovation in AI-powered ranking and bidding systems for digital advertising.\nLead the creation of advanced models and strategies that redefine auction dynamics, maximise advertiser ROI, and deliver exceptional user experiences.\nAs an expert and visionary, you will elevate our advertising intelligence capabilities, setting new industry benchmarks while shaping the future of data-driven decision-making at scale.",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000099339200",
    "title": "Staff Data Scientist - AdTech Bidding",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000099339200",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2025-12-17T12:32:23.485Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-12T09:09:40.159121",
    "domain": "deliveryhero.com",
    "description": "We are on the lookout for&#xa0;Staff Data Scientists&#xa0;to join the AdTech data science team (Bidding Team) on our journey to always deliver amazing experiences.\nAs part of our Vendor Team, you’ll be the driving force behind the success of thousands of restaurants, shops, and local businesses. Your contributions will empower vendors with advanced tools to manage their operations, boosting their visibility, and reach. Every feature you help build will create growth opportunities for businesses of all sizes, strengthening Delivery Hero’s ecosystem and impact.\nAt Delivery Hero, AdTech introduces people to new food they love and enables our partners to meet their future customers at the perfect moment. We have developed a range of products to offer advertising solutions for restaurants helping them to increase their visibility and reach, improve their order conversion, and eventually drive more sales by covering the entire marketing funnel. Operating across over 50 countries around the clock, our Ad Tech connects the ideal advertiser with the ideal customer millions of times every day. Ad Tech is a fundamental area for us on our path to profitability. our data science team is at the heart of this growth, powering personalisation, Ranking, relevance, and recommendation.&#xa0;\nYou will be a thought leader, driving innovation by designing and deploying our models to the forefront of technology to solve complex problems, delivering revenue for Delivery Hero at the frontline of our growth & profitability journey. In this role you will\nDrive transformative innovation in AI-powered bidding systems for digital advertising.\nLead the creation of state-of-the-art models and strategies that redefine auction dynamics, maximise advertiser ROI, and deliver exceptional user experiences.\nAs an expert, you will elevate our advertising intelligence capabilities, setting new industry benchmarks while shaping the future of data-driven decision-making at scale.\n&#xa0;",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000099345205",
    "title": "Staff Data Scientist - AdTech Ranking",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000099345205",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2025-12-17T13:12:23.927Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-12T09:09:40.159113",
    "domain": "deliveryhero.com",
    "description": "We are on the lookout for&#xa0;Staff Data Scientists&#xa0;to join the AdTech data science team (Ranking Team) on our journey to always deliver amazing experiences.\nAs part of our Vendor Team, you’ll be the driving force behind the success of thousands of restaurants, shops, and local businesses. Your contributions will empower vendors with advanced tools to manage their operations, boosting their visibility, and reach. Every feature you help build will create growth opportunities for businesses of all sizes, strengthening Delivery Hero’s ecosystem and impact.\nAt Delivery Hero, AdTech introduces people to new food they love and enables our partners to meet their future customers at the perfect moment. We have developed a range of products to offer advertising solutions for restaurants helping them to increase their visibility and reach, improve their order conversion, and eventually drive more sales by covering the entire marketing funnel. Operating across over 50 countries around the clock, our Ad Tech connects the ideal advertiser with the ideal customer millions of times every day. Ad Tech is a fundamental area for us on our path to profitability. our data science team is at the heart of this growth, powering personalisation, Ranking, relevance, and recommendation.&#xa0;\nYou will be a thought leader, driving innovation by designing and deploying our models to the forefront of technology to solve complex problems, delivering revenue for Delivery Hero at the frontline of our growth & profitability journey. In this role you will\nDrive transformative innovation in AI-powered ranking and bidding systems for digital advertising.\nLead the creation of advanced models and strategies that redefine auction dynamics, maximise advertiser ROI, and deliver exceptional user experiences.\nAs an expert and visionary, you will elevate our advertising intelligence capabilities, setting new industry benchmarks while shaping the future of data-driven decision-making at scale.\n&#xa0;\n&#x...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "2904846",
    "title": "Kernel/Hypervisor Engineer, EC2 Accelerated Nitro",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/2904846",
    "location": "DE, BE, Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "February 18, 2025",
    "updated_time": "about 20 hours",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233632",
    "domain": null,
    "description": "EC2 is looking for an experienced Kernel & Hypervisor Engineer for one of our virtualization organizations. As part of the team, you will be given the chance to have a significant impact on our systems, our business and most importantly our customers, working in diverse work environment with a flexible schedule. You will be building the lowest layer of the Amazon Web Services software stack, engineering new EC2 instance families and developing the EC2 Nitro Hypervisor for AWS. You will have the opportunity to innovate, make new engineering proposals, and explore new areas.<br/><br/>EC2 Accelerated Nitro is an organization that powers the EC2 Nitro instance families, focusing on hypervisors, virtualization and accelerated computing. We build highly operable quiescent hypervisors that provide near bare metal performance to EC2 instances. We also integrate hardware accelerators (GPUs, FPGAs, etc.) into the EC2 instance families to support advanced workloads, such as machine learning, high performance computing, inference or graphics processing.<br/><br/>For more information please feel free to visit https://aws.amazon.com/ec2/nitro/<br/><br/>Utility Computing (UC) <br/><br/>AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.<br/><br/>Key job responsibilities<br/>- Take end to end ownership of the software development life cycle: You will build new solutions across the virtualization software stack; developing  virtualization components and automating infrastructure flows. This includes design, testing and deployment.<br/><br/>- Drive operational excellence, improving the quality of the hypervisor and our instance platforms.<br/><br/>- Influence and contribute to the technological roadmap of your team.<br/><br/>- Work with other EC2 teams like hardware, software and firmware groups across the globe, driving innovative solutions.<br/><br/>A day in the life<br/>You will:<br/><br/>- Work with your manager and other engineers in delivering to the roadmap.<br/>- Focus on high quality delivery and operational excellence.<br/>- Solve technical challenges impacting our customers.<br/><br/>About the team<br/>EC2 Accelerated Nitro has a two-fold mission:<br/><br/>- Leave no customer workload on-premises by engineering new EC2 instance families with hardware acceleration devices.<br/>- Build the most feature-rich virtualization technology in the cloud.<br/><br/>About AWS<br/>Diverse Experiences<br/>AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. <br/>Why AWS?<br/>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/>Inclusive Team Culture<br/>AWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.<br/>Mentorship & Career Growth<br/>We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. <br/>Work/Life Balance<br/>We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. <br/>",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3010831",
    "title": "Kernel/Hypervisor Engineer, EC2 Deep Learning Accelerators",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3010831",
    "location": "DE, BE, Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "June 17, 2025",
    "updated_time": "3 months",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233628",
    "domain": null,
    "description": "EC2 is looking for an experienced Kernel & Hypervisor Engineer for one of our virtualization organizations. As part of the team, you will be given the chance to have a significant impact on our systems, our business and most importantly our customers, working in diverse work environment with a flexible schedule. You will be building the lowest layer of the Amazon Web Services software stack, engineering new EC2 instance families and developing the EC2 Nitro Hypervisor for AWS. You will have the opportunity to innovate, make new engineering proposals, and explore new areas.<br/><br/>EC2 Accelerated Nitro is an organization that powers the EC2 Nitro instance families, focusing on hypervisors, virtualization and accelerated computing. We build highly operable quiescent hypervisors that provide near bare metal performance to EC2 instances. We also integrate hardware accelerators (GPUs, FPGAs, etc.) into the EC2 instance families to support advanced workloads, such as machine learning, high performance computing, inference or graphics processing.<br/><br/>For more information please feel free to visit https://aws.amazon.com/ec2/nitro/<br/><br/>Utility Computing (UC)<br/><br/>AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.<br/><br/>Key job responsibilities<br/>* Take end to end ownership of the software development life cycle: You will build new solutions across the virtualization software stack; developing virtualization components and automating infrastructure flows. This includes design, testing and deployment.<br/><br/>* Drive operational excellence, improving the quality of the hypervisor and our instance platforms.<br/>Influence and contribute to the technological roadmap of your team.<br/><br/>* Work with other EC2 teams like hardware, software and firmware groups across the globe, driving innovative solutions.<br/><br/>* This position involves On-call responsibility. We work as a team to root-cause the issues and ensure our systems are resilient and fault-tolerant.<br/><br/>A day in the life<br/>You will:<br/><br/>* Work with your manager and other engineers in delivering to the roadmap.<br/><br/>* Focus on high quality delivery and operational excellence.<br/><br/>* Solve technical challenges impacting our customers.<br/><br/>About the team<br/>EC2 Accelerated Nitro has a two-fold mission:<br/><br/>Leave no customer workload on-premises by engineering new EC2 instance families with hardware acceleration devices.<br/><br/>Build the most feature-rich virtualization technology in the cloud.<br/><br/>Serve customer needs for cloud computing infrastructure with a wide portfolio of accelerated EC2 instance types.<br/><br/>About AWS<br/>Diverse Experiences<br/>AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. <br/>Why AWS?<br/>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/>Inclusive Team Culture<br/>AWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.<br/>Mentorship & Career Growth<br/>We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. <br/>Work/Life Balance<br/>We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. <br/>",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "2998387",
    "title": "Manager, Programmatic Solutions Consultants, Amazon Ads Global Sales, Programmatic Solutions Consultants",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/2998387",
    "location": "DE, HH, Hamburg",
    "city": "Hamburg",
    "country": "Germany",
    "posted_date": "June  3, 2025",
    "updated_time": "15 days",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233627",
    "domain": null,
    "description": "Amazon Ads is seeking an experienced Manager for our Programmatic Solutions Consultants team to join our growing business based in Germany (Hamburg or Munich).<br/><br/>Key job responsibilities<br/>Navigate a high level of ambiguity. You love whitespace, and treat this space as your own company. You identify key business problems to prioritize then present the solutions to solve them on behalf of the business.<br/>Take ownership of managing a team of Programmatic Solutions Consultants, including resource planning and driving success for the team’s customer category, possessing a complete understanding of internal and external variables that impact the business.<br/>Work tactically and strategically. Determines the right strategy and where to simplify or extend solutions for the best outcome of the assigned category.<br/>Be comfortable working with data to develop new opportunity areas, track program metrics, and use findings to influence business decisions.<br/>Set goals and direction for the team, ensuring alignment with broader business goals and vision.<br/>Hire, develop, and lead a team of technical and non-technical Programmatic Solutions Consultants.<br/>Thrive on technology and data and have expertise in monitoring and managing a services organization to maximum efficiency, productivity, and quality.<br/>Generate and implement big ideas to drive business improvement, innovation, and scale within the team and across the business as a whole. Lead cross functional collaboration to get big ideas implemented.<br/>Anticipate bottlenecks, assess risks, mitigate issues, provide escalation management, anticipate and make trade-offs.<br/>Have strong communication skills and experience working across diverse stakeholder groups.<br/>Represent Amazon when meeting with senior executive teams from top customers and build long term strategic relationships.<br/><br/>A day in the life<br/>You lead the frontline team tasked with enabling trading desk customers to be successful in using the Amazon DSP. <br/>As a results-oriented supervisor, you attend a meeting with client leadership to review customer certification and support plans. <br/>You join a call with Ad Tech Sales stakeholders to determine strategy and coverage for specific accounts. <br/>You meet with Product and partner teams to review a document you and your team wrote, proposing feature upgrades to unblock customer needs and influence roadmap prioritization.<br/>You attend a one-on-one with a direct report, and discuss where they are headed in their career path, as well as the rollout of a new tool.<br/>You prepare your section of a weekly business review document, to review data-driven insights and spark discussion with leadership on team wins and areas for improvement.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3041640",
    "title": "Principal Engineer, EC2",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3041640",
    "location": "DE, BE, Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "July 23, 2025",
    "updated_time": "about 2 months",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233625",
    "domain": null,
    "description": "As a Principal Engineer on EC2 in the Accelerated Nitro team, you will have the opportunity to make a significant impact on the core infrastructure powering Amazon Web Services. You will be at the forefront of developing the next generation of EC2 instance families, driving innovations in virtualization, hardware acceleration, and cloud computing.<br/><br/>The EC2 Accelerated Nitro team focuses on building highly efficient and secure hypervisors, as well as integrating advanced hardware accelerators like GPUs and FPGAs into the EC2 instance families. This enables us to deliver near bare-metal performance and support a wide range of workloads, from machine learning and high-performance computing to graphics processing.<br/><br/>In this role, you will:<br/><br/>   - Lead the Development of Core EC2 Capabilities: Spearhead the design and architecture of new EC2 instance features, from CPU scheduling and memory management to device emulation and PCIe subsystem integration. Your technical guidance will shape the roadmap and implementation across multiple global teams.<br/>   - Advance Virtualization Security: Drive security-focused initiatives that enhance the integrity and resilience of our virtualization platform, ensuring the highest standards of data protection for our customers.<br/>   - Mentor and Grow Engineering Talent: Leverage your deep technical expertise to develop other engineers, providing architecture reviews, design proposals, and hands-on coding support to elevate the skills of the broader team.<br/>   - Influence the Future of Cloud Computing: Contribute your thinking to shape the technological direction of EC2 instances and features, advocating for innovative solutions that deliver exceptional performance and value to our customers.<br/><br/>This role is exclusively based in our Berlin, Germany office. The successful candidate must be willing and able to be physically present in the Berlin office every day to collaborate closely with the cross-functional engineering and product teams driving the development of our next-generation EC2 instance families. Remote work arrangements or locating in another Amazon office are not possible for this role. This level of dedicated, on-site participation is essential to the effective execution and advancement of this strategic cloud computing initiative.<br/><br/>To excel in this role, you will need a proven track record as a solid technical Principal Engineer, with expertise in low-level system software, hardware acceleration, and cloud infrastructure. You should also possess strong leadership abilities, the capacity to thrive in a fast-paced, startup-like environment, and a passion for mentoring and developing engineering talent.<br/><br/>If you are excited by the prospect of redefining the boundaries of cloud computing, and are able to commit to full-time, in-person work in our Berlin office, we encourage you to apply for this transformative Principal Engineer opportunity on the EC2 Accelerated Nitro team.<br/><br/>This is your opportunity to drive strategic programs with visibility to the highest levels of the company, while working with new technologies and talented, passionate teams. Are you ready to redefine the economics of large-scale computing?<br/><br/>Utility Computing (UC) AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon's Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS's services and features apart in the industry. As a member of the UC organization, you'll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS. Within AWS UC, Amazon Dedicated Cloud (ADC) roles engage with AWS customers who require specialized security solutions for their cloud services.<br/><br/><br/>Key job responsibilities<br/>    - Deliver new EC2 instance platforms by giving technical guidance to multiple teams across different time zones and locations, and working closely with product managers and technical program managers.<br/>    - Drive virtualization-related security initiatives.<br/>    - Design and architect new EC2 instance features and deliver them by growing other engineers.<br/>    - Influence and contribute to the technological roadmap of EC2 instances and features, through compelling customer justification.<br/>    - Improve the efficiency of their organization by offering technical solutions to operational bottlenecks.<br/><br/><br/>A day in the life<br/>As a Principal Engineer in the EC2 Accelerated Platforms and Hypervisor organization, you'll drive technical excellence across multiple high-impact initiatives. Your typical day includes:<br/> - Technical Leadership: Overseeing strategic projects while collaborating with internal teams, external partners, and customers to provide technical vision for next-generation EC2 instance types and hypervisor features.<br/> - Design and Innovation: Creating prototypes that validate concepts and establish timelines, developing design documents that guide engineering efforts across organizations.<br/> - Hands-on Engineering: Actively participating in development, debugging, and release management to deliver customer value on schedule.<br/> - Strategic Planning: Partnering with management on progress reporting and future planning to effectively prioritize initiatives across the organization.<br/><br/><br/>About the team<br/>The EC2 Accelerated Nitro team has a bold mission: to leave no customer workload on-premises and build the most feature-rich virtualization platform in the cloud. The team develops new EC2 instance families powered by the latest hardware accelerators, enabling customers to run their most demanding workloads with unparalleled performance, efficiency, and cost-effectiveness. Simultaneously, the team enhances the Nitro virtualization system, pushing the boundaries of cloud computing through innovations in memory management, security, and live migration, giving customers unprecedented flexibility, reliability, and control.<br/><br/>At the core of the team's two-fold mission is a relentless drive to engineer new capabilities that eliminate any remaining barriers for customers to fully embrace the cloud. The team solves high-impact, technically complex challenges that are shaping the future of cloud computing, from developing the next generation of hardware-accelerated instance types to building the most feature-rich virtualization technology available.<br/>If you are excited by the prospect of redefining the boundaries of cloud infrastructure and enabling customers to run any workload in the cloud, we encourage you to explore this transformative Principal Engineer opportunity on the EC2 Accelerated Nitro team.<br/><br/>About AWS<br/>Diverse Experiences <br/>Amazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. <br/><br/>Why AWS <br/>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/>Work/Life Balance <br/>We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. <br/>Inclusive Team Culture <br/>Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.<br/>Mentorship and Career Growth<br/>We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. <br/>",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3037589",
    "title": "Senior Support Engineer, AWS Monetization",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3037589",
    "location": "DE, BE, Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "July 17, 2025",
    "updated_time": "14 days",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233624",
    "domain": null,
    "description": "AWS has the most services and more features within those services, than any other cloud provider–from infrastructure technologies like compute, storage, and databases–to emerging technologies, such as machine learning and artificial intelligence, data lakes and analytics, and Internet of Things. Whether its Identity features such as access management and sign on, cryptography, console, builder & developer tools, and even projects like automating all of our contractual billing systems, AWS Platform is always innovating with the customer in mind. The AWS Platform team sustains over 750 million transactions per second.<br/><br/>Our team also puts a high value on work-life balance. Striking a healthy balance between your personal and professional life is crucial to your happiness and success here, which is why we aren’t focused on how many hours you spend at work or online. Instead, we’re happy to offer a flexible schedule so you can have a more productive and well-balanced life—both in and outside of work.<br/><br/>We have a formal mentor search application that lets you find a mentor that works best for you based on location, job family, job level etc. Your manager can also help you find a mentor or two, because two is better than one. In addition to formal mentors, we work and train together so that we are always learning from one another, and we celebrate and support the career progression of our team members.<br/><br/>Here at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.<br/><br/>The L6 Support Engineer will establish the monthly billing process, lead process documentation, create support runbooks, establishes operational metrics, and manage account growth. The engineer will collaborate with engineering teams to implement AI-driven support solutions. This option creates a dedicated support team but limits the automation development capacity. <br/><br/>The core deliverables for this role would include the monthly manual discounting processes, invoice consolidation, and Request for Payment (RFP) generation, and Audit processes. The role requires working within EU data sovereignty requirements while managing customer cases, documenting solutions, and maintaining billing support procedures. They would identify and resolve root causes of billing issues, participate in support retrospectives, and work with system developers to improve billing operations. <br/><br/>An effective candidate will be a creative problem solver, committed to the team, and able to work around obstacles. The engineer will support customer inquiries and contribute toward immediate resolution as well as longer-term solutions. This team member will have an opportunity to innovate through process improvement and participate in cross-functional team initiatives.<br/>•\tWork with AWS customers to address billing issues and gather valuable feedback<br/>•\tSupport monthly billing processes between multiple external and internal AWS teams by auditing billing data, providing data management, and discount calculations<br/>•\tProactively identify and implement operational improvements, enhancements, and system customizations that meet business requirements<br/>•\tActively seek solutions to business/customer needs and suggest innovative solutions on behalf of the customer experience<br/>•\tSupport projects and ensures successful execution in an interdisciplinary environment, partners with business leaders and team members, including Account Managers, Technology partners and Service teams, etc., to deliver on billing objectives of timeliness and accuracy.<br/>•\tSupport recurring and ad hoc reporting for various internal/external stakeholders<br/><br/>About AWS<br/><br/>Diverse Experiences<br/>AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. <br/><br/>Why AWS?<br/>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/><br/>Inclusive Team Culture<br/>AWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.<br/><br/>Mentorship & Career Growth<br/>We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. <br/><br/>Work/Life Balance<br/>We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. <br/><br/>Key job responsibilities<br/>• Work with AWS customers to address billing issues and gather valuable feedback<br/>• Work with AWS customers to address billing issues and gather valuable feedback<br/>• Support monthly billing processes between multiple external and internal AWS teams by auditing billing data, providing data management, and discount calculations<br/>• Proactively identify and implement operational improvements, enhancements, and system customizations that meet business requirements<br/>• Actively seek solutions to business/customer needs and suggest innovative solutions on behalf of the customer experience<br/>• Support projects and ensures successful execution in an interdisciplinary environment, partners with business leaders and team members, including Account Managers, Technology partners and Service teams, etc., to deliver on billing objectives of timeliness and accuracy.<br/>• Support recurring and ad hoc reporting for various internal/external stakeholders<br/><br/>About the team<br/>Utility Computing (UC) <br/><br/>AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3086479",
    "title": "Sr Solutions Architect GenAI, Automotive&Manufacturing GenAI SA",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3086479",
    "location": "DE, BY, Munich",
    "city": "Munich",
    "country": "Germany",
    "posted_date": "September 17, 2025",
    "updated_time": "6 days",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233622",
    "domain": null,
    "description": "Are you passionate about pioneering the future of generative AI and eager to help global enterprises solve real-world challenges using AI solutions? The Automotive & Manufacturing Generative AI Solutions Architecture team at AWS seeks experienced technologists who possess a unique balance of technical depth and strong interpersonal skills. As a trusted customer advocate and Generative AI Solutions Architect, you'll partner with some of the world's largest automotive and manufacturing companies to craft highly scalable AI architectures that address critical business problems and accelerate the adoption of AWS's comprehensive AI stack.<br/>You will join a specialized team of Solutions Architects dedicated exclusively to generative AI, working alongside account managers and account Solutions Architects to drive AI growth and innovation across global customers. Our team's focused expertise has made us a valuable resource for customers seeking guidance on advanced AI solutions. You'll help organizations understand best practices and effectively implement generative AI capabilities within their existing cloud infrastructure. Through close collaboration with product teams, you will influence AWS's generative AI roadmap while architecting sophisticated solutions that combine Amazon Bedrock's foundation models, Amazon SageMaker's AI/ML capabilities, and Amazon Q's enterprise intelligence to transform business processes.<br/>In this role, you will shape and execute strategies to build mind share and broad use of AWS's AI services within automotive & manufacturing customers. The ability to connect AI technology with measurable business value is critical, as you'll develop compelling demos and proof-of-concepts that demonstrate how generative AI can revolutionize business operations through intelligent automation and advanced reasoning capabilities. You'll design architectures that enable AI systems to process complex queries, interact with enterprise data sources, and efficiently complete multistep tasks with agentic AI. <br/>At Amazon, we've been investing deeply in artificial intelligence for over 20 years, and many of the capabilities customers experience in our products today are driven by machine learning. You will join a team that brings deep expertise to customers through every layer of the AI stack, helping organizations think strategically about their AI initiatives and business challenges. Whether implementing RAG-enabled knowledge bases, designing custom model fine-tuning solutions, or architecting enterprise-wide AI systems, you'll help organizations build scalable, maintainable solutions that evolve with their business needs and drive unprecedented transformation across the industry.<br/><br/><br/>Key job responsibilities<br/>•\tDevelop strategic technical roadmaps and implementation plans for generative AI solutions that align with customers’ business objectives and existing architecture<br/>•\tDesign and implement generative AI architectures that orchestrate complex workflows across enterprise systems, leveraging AWS services like Amazon Bedrock, SageMaker, and Amazon Q<br/>•\tCommunicate complex technical concepts to stakeholders, translating technical elements into business language that demonstrates clear value<br/>•\tMentor team members and contribute to knowledge sharing within the organization to advance AI adoption and implementation best practices<br/>•\tLead thought leadership initiatives and externally represent by evangelizing AWS generative AI capabilities through public speaking at industry events (re:Invent and AWS Summit), publishing technical content (blogs, whitepapers, reference architectures), and sharing best practices with the broader AI/ML community<br/>•\tStay current with the latest advancements in generative AI research and AWS service capabilities to improve system performance and recommend optimal technology stacks<br/><br/><br/>A day in the life<br/>•\tReview customer requirements and technical challenges, focusing on opportunities to implement generative AI solutions that can transform business outcomes<br/>•\tDevelop proof-of-concepts that demonstrate how generative AI solutions can transform business processes<br/>•\tInfluence service team leadership and product marketing on the future needs for customers, prioritizing roadmap features and GTM messaging<br/>•\tDedicate time to continuous learning about the latest advancements in AI research and AWS service capabilities<br/>•\tParticipate in knowledge sharing activities with colleagues, creating field enablement materials to help other SAs understand how to integrate generative AI solutions into customer architectures<br/><br/><br/>About the team<br/>The Automotive & Manufacturing Generative AI Solution Architecture team is dedicated to accelerating generative AI adoption across strategic automotive and manufacturing accounts. Our mission is to drive tangible business value through focused execution on strategic generative AI projects, while enabling scale by up-skilling broader field teams. We work at the intersection of AI technology and industry-specific transformation, partnering closely with account teams, technology specialists, and industry specialist teams to deliver comprehensive solutions.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3076389",
    "title": "Software Development Engineer, AWS Fraud Prevention",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3076389",
    "location": "DE, BE, Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "September  5, 2025",
    "updated_time": "14 days",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233620",
    "domain": null,
    "description": "AWS Fraud Prevention has opportunities for Software Development Engineers who want to challenge themselves by building solutions using the latest tech in distributed systems at scale to catch the bad actors who are out there. We are at the forefront of protecting AWS (i.e. all AWS services) and its customers from fraud and compromise attacks. AWS is the world leader in providing a highly reliable, scalable and low-cost infrastructure platform in the cloud. As AWS continues to grow at a rapid rate, fraudsters continue to find new ways to exploit our services. We have built fraud investigation and enforcement platforms that are extensible, configurable and massively scalable. You will work closely with machine learning research scientists to support and extend our current platforms and design next generation fraud and compromise prevention systems. Your work will have a direct impact on AWS cloud products and all our customers. You will work in a quickly evolving environment in a business that needs to rapidly adapt to changing fraud patterns. Our low operational load combined with complicated technical and business problems will provide opportunities to satisfy your curiosity and support professional growth. The ideal candidate will have strong distributed systems and web services design and implementation experience, as well as experience working on high availability production systems.<br/><br/>Key job responsibilities<br/>- You are expected to independently design and deliver well-engineered software components & services. <br/>- You are expected to produce consistently high-quality code and documentation. The quality of the deliverable is measured by peer reviews, operational readiness reviews and system performance after deployment. <br/>- You will own difficult business problems in the fraud prevention space and resolves ambiguity by aligning system requirements and success criteria with the product management, UX & other sister teams. <br/>- You will be responsible for mentoring other SDEs and establish operational rigor.<br/><br/>About the team<br/>AWS Fraud Prevention’s mission is to protect AWS and its customers from the cost, inconvenience, and damage due to fraudulent and abusive behaviors. We aim to provide the best possible customer experience by balancing the cost of financial and reputational risk (e.g. OPEX, service unavailability) against customer friction (e.g. service limits, customer downtime). To accomplish this mission, we employ a strategy that includes preventing access to AWS via the sign-up process, detecting fraudulent and abusive behaviors using Machine Learning models and rules, containing risky accounts by limiting access to service resources, investigating suspicious accounts, and remediating fraud and compromise within AWS by cleaning up account resources to recover service capacity.<br/><br/>Utility Computing (UC) <br/><br/>AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.<br/><br/>About AWS<br/><br/>Diverse Experiences<br/>AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. <br/><br/>Why AWS?<br/>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/><br/>Inclusive Team Culture<br/><br/>AWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.<br/><br/>Mentorship & Career Growth<br/>We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. <br/><br/>Work/Life Balance<br/>We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3104358",
    "title": "Senior Pricing Analyst, AWS Monetization",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3104358",
    "location": "DE, BE, Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "October  8, 2025",
    "updated_time": "14 days",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233618",
    "domain": null,
    "description": "AWS has the most services and more features within those services, than any other cloud provider–from infrastructure technologies like compute, storage, and databases–to emerging technologies, such as machine learning and artificial intelligence, data lakes and analytics, and Internet of Things. Whether its Identity features such as access management and sign on, cryptography, console, builder & developer tools, and even projects like automating all of our contractual billing systems, AWS Platform is always innovating with the customer in mind. The AWS Platform team sustains over 750 million transactions per second.<br/><br/>Our team also puts a high value on work-life balance. Striking a healthy balance between your personal and professional life is crucial to your happiness and success here, which is why we aren’t focused on how many hours you spend at work or online. Instead, we’re happy to offer a flexible schedule so you can have a more productive and well-balanced life—both in and outside of work.<br/><br/>We have a formal mentor search application that lets you find a mentor that works best for you based on location, job family, job level etc. Your manager can also help you find a mentor or two, because two is better than one. In addition to formal mentors, we work and train together so that we are always learning from one another, and we celebrate and support the career progression of our team members.<br/><br/>Here at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.<br/><br/>The Senior Pricing Analyst will establish the monthly billing process, lead process documentation, create support runbooks, establishes operational metrics, and manage account growth. The engineer will collaborate with engineering teams to implement AI-driven support solutions. This option creates a dedicated support team but limits the automation development capacity. <br/><br/>The core deliverables for this role would include the monthly manual discounting processes, invoice consolidation, and Request for Payment (RFP) generation, and Audit processes. The role requires working within EU data sovereignty requirements while managing customer cases, documenting solutions, and maintaining billing support procedures. They would identify and resolve root causes of billing issues, participate in support retrospectives, and work with system developers to improve billing operations. <br/><br/><br/>Key job responsibilities<br/>An effective candidate will be a creative problem solver, committed to the team, and able to work around obstacles. The engineer will support customer inquiries and contribute toward immediate resolution as well as longer-term solutions. This team member will have an opportunity to innovate through process improvement and participate in cross-functional team initiatives.<br/>•\tWork with AWS customers to address billing issues and gather valuable feedback<br/>•\tSupport monthly billing processes between multiple external and internal AWS teams by auditing billing data, providing data management, and discount calculations<br/>•\tProactively identify and implement operational improvements, enhancements, and system customizations that meet business requirements<br/>•\tActively seek solutions to business/customer needs and suggest innovative solutions on behalf of the customer experience<br/>•\tSupport projects and ensures successful execution in an interdisciplinary environment, partners with business leaders and team members, including Account Managers, Technology partners and Service teams, etc., to deliver on billing objectives of timeliness and accuracy.<br/>•\tSupport recurring and ad hoc reporting for various internal/external stakeholders<br/><br/>A day in the life<br/>About AWS<br/><br/>Diverse Experiences<br/>AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. <br/><br/>Why AWS?<br/>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/><br/>Inclusive Team Culture<br/>AWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.<br/><br/>Mentorship & Career Growth<br/>We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. <br/><br/>Work/Life Balance<br/>We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. <br/><br/>About the team<br/>Utility Computing (UC) <br/><br/>AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3127773",
    "title": "Sr. System Dev Engineer (SAP), AWS SAP Engineering, AWS EC2 Commercial Software Services",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3127773",
    "location": "DE, BW, Walldorf",
    "city": "Walldorf",
    "country": "Germany",
    "posted_date": "November 17, 2025",
    "updated_time": "21 days",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233615",
    "domain": null,
    "description": "The Amazon EC2 Commercial Software Services team is seeking a Senior System Development Engineer to create solutions that drive the adoption of SAP workloads on AWS. As a member of the team, you'll design, develop, and own back-end subsystems that solve complex distributed system challenges. You’ll also work on customer-facing APIs used by millions of applications worldwide.<br/><br/>The ideal candidate has deep technical skills in SAP applications and cloud computing, allowing them to create innovative solutions that meet the needs of customers and the SAP community.  Your SAP domain expertise, SAP BASIS / ABAP skills are essential to making a significant impact in this role.<br/><br/>As a Senior System Development Engineer, you'll be responsible for the entire service lifecycle, collaborating with cross-functional teams to drive operational excellence and customer success. If you’re ready to contribute to AWS's growth and work with the latest technologies, from machine learning to advanced processors, we invite you to join us on this exciting journey.<br/><br/>Utility Computing (UC) <br/>AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.<br/><br/><br/>Key job responsibilities<br/>Key Responsibilities:<br/><br/>- Be actively involved in daily engineering activities, providing hands-on technical guidance and support.<br/>- Lead architecture, design, and proof-of-concept efforts for end-to-end project delivery, ensuring high quality and simplicity in complex systems.<br/>- Design, implement, deploy, and maintain innovative distributed system software to enhance service security, durability, availability, performance, and cost-efficiency.<br/>- Take ownership of complex projects, managing broad scopes with autonomy and accountability.<br/>- Communicate with customers and technical teams to define technical strategies and ensure alignment with business goals.<br/>- Stay current with evolving technologies, proactively researching new advancements to recommend and integrate into projects.<br/>- Apply software engineering best practices to maintain a high standard of quality across all team deliverables.<br/><br/>In summary, you'll play a crucial role in the design and implementation of strategic services, focused on enhancing enterprise cloud adoption, particularly for SAP workloads. In this role, you'll lead and excel with minimal technical supervision, work closely with senior engineers, and have direct influence over the direction of the team.<br/><br/>About the team<br/>About the team<br/>Our team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge-sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects that help our team members develop your engineering expertise so you feel empowered to take on more complex tasks in the future.<br/>Diverse Experiences<br/>AWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. <br/>About AWS<br/>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/>Inclusive Team Culture<br/>AWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.<br/>Work/Life Balance<br/>We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. <br/>Mentorship & Career Growth<br/>We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3115016",
    "title": "2026 Applied Scientist Intern, Amazon University Talent Acquisition",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3115016",
    "location": "DE, BE, Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "October 24, 2025",
    "updated_time": "3 months",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233607",
    "domain": null,
    "description": "Are you a MS or PhD student interested in a 2026 internship in the field of machine learning, deep learning, generative AI, large language models, speech technology, robotics, computer vision, optimization, operations research, quantum computing, automated reasoning, or formal methods? If so, we want to hear from you!<br/><br/>We are looking for students interested in using a variety of domain expertise to invent, design and implement state-of-the-art solutions for never-before-solved problems.<br/><br/>You can find more information about the Amazon Science community as well as our interview process via the links below;<br/><br/>https://www.amazon.science/<br/><br/>https://amazon.jobs/content/en/career-programs/university/science<br/><br/>https://amazon.jobs/content/en/how-we-hire/university-roles/applied-science<br/><br/>Key job responsibilities<br/>As an Applied Science Intern, you will own the design and development of end-to-end systems. You’ll have the opportunity to write technical white papers, create roadmaps and drive production level projects that will support Amazon Science.<br/><br/>You will work closely with Amazon scientists and other science interns to develop solutions and deploy them into production. You will have the opportunity to design new algorithms, models, or other technical solutions whilst experiencing Amazon’s customer focused culture.<br/><br/>The ideal intern must have the ability to work with diverse groups of people and cross-functional teams to solve complex business problems. <br/><br/>A day in the life<br/>At Amazon, you will grow into the high impact person you know you’re ready to be. Every day will be filled with developing new skills and achieving personal growth.<br/><br/>How often can you say that your work changes the world? At Amazon, you’ll say it often. Join us and define tomorrow.<br/><br/>Some more benefits of an Amazon Science internship include;<br/><br/>• All of our internships offer a competitive stipend/salary<br/>• Interns are paired with an experienced manager and mentor(s)<br/>• Interns receive invitations to different events such as intern program initiatives or site events<br/>• Interns can build their professional and personal network with other Amazon Scientists<br/>• Interns can potentially publish work at top tier conferences each year<br/><br/>About the team<br/>Applicants will be reviewed on a rolling basis and are assigned to teams aligned with their research interests and experience prior to interviews.<br/><br/>Start dates are available throughout the year and durations can vary in length from 3-6 months for full time internships.<br/><br/>This role may available across multiple locations in the EMEA region (Austria, Estonia, France, Germany, Ireland, Israel, Italy, Jordan, Luxembourg, Netherlands, Poland, Romania, South Africa, Spain, Sweden, UAE, and UK).<br/><br/>Please note these are not remote internships.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3123070",
    "title": "Senior Applied Scientist - Systems for ML Inference and Training Optimization, Deep Science for Systems and Services",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3123070",
    "location": "DE, Tubingen",
    "city": "Tubingen",
    "country": "Germany",
    "posted_date": "November  7, 2025",
    "updated_time": "3 months",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233605",
    "domain": null,
    "description": "We are seeking an exceptional Senior Applied Scientist specializing in ML Systems, training, and inference optimization to join DS3. This role requires deep expertise in performance engineering, kernel development, distributed systems optimization, and AI workload optimization across heterogeneous compute platforms. You will invent and implement novel optimization techniques that directly impact the performance and cost-efficiency of ML training and inference for AWS customers worldwide.<br/>As a Senior Applied Scientist in DS3, you will work at the lowest levels of the software stack—writing custom CUDA kernels, optimizing PTX assembly, developing high-performance operators for GPUs and AWS Neuron, designing efficient communication patterns for multi-GPU and multi-node training, and inventing new algorithmic approaches to accelerate transformer models and emerging architectures. Your work will span from single-node inference optimization to large-scale distributed training systems, influencing the design of AWS training and inference services and setting new standards for ML systems performance across the industry.<br/><br/><br/>Deep Science for Systems and Services (DS3) is a part of AWS Utility Computing (UC) which  provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.<br/><br/><br/>Key job responsibilities<br/>Systems-Level Scientific Innovation: Design and implement novel kernel-level optimizations for ML inference and training workloads, including custom CUDA kernels, PTX-level optimizations, and cross-platform acceleration for CUDA and AWS Neuron SDK.<br/>Performance Engineering Leadership: Drive 2-10× performance improvements in latency, throughput, and memory efficiency for production ML inference & training systems through systematic profiling, analysis, and optimization.<br/>Cross-Platform Optimization: Develop and port high-performance ML operators across GPUs, AWS Inferentia/Trainium, and emerging AI accelerators, ensuring optimal performance on each platform.<br/>Product-Level Impact: Lead the design, implementation, and delivery of scientifically-complex optimization solutions that directly improve customer experience and reduce AWS operational costs at scale.<br/>Scientific Rigor: Produce technical documentation and internal research reports demonstrating the correctness, efficiency, and scalability of your optimizations. Contribute to external publications when aligned with business needs.<br/>Technical Leadership: Influence your team's technical direction and scientific roadmap. Build consensus across engineering and science teams on optimization strategies and architectural decisions.<br/>Mentorship & Knowledge Sharing: Actively mentor junior scientists and engineers on performance engineering best practices, kernel development, and systems-level optimization techniques.<br/><br/>About the team<br/>Deep Science for Systems and Services (DS3) is a science organization within AWS Compute & ML Services focused on advancing AI/ML technologies at the systems level. Our team works at the intersection of machine learning and high-performance computing, developing optimizations for large model inference across diverse hardware platforms. We push the boundaries of what's possible in ML inference performance, working directly with CUDA, AWS Neuron, and other low-level compute abstractions to deliver industry-leading latency, throughput, and cost-performance for AWS customers deploying AI at scale.<br/>About AWS<br/><br/>Diverse Experiences<br/>AWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.<br/><br/>Why AWS?<br/>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/><br/>Inclusive Team Culture<br/>AWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.<br/><br/>Mentorship & Career Growth<br/>We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.<br/><br/>Work/Life Balance<br/>We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3137915",
    "title": "Postdoctoral Scientist, Amazon Robotics",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3137915",
    "location": "DE, BE, Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "December  5, 2025",
    "updated_time": "about 2 months",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233596",
    "domain": null,
    "description": "Amazon is looking for talented Postdoctoral Scientists to join our Robotics team for a one-year, full-time research position. Postdoctoral Scientists will innovate in key areas of computer vision and manipulation challenges in Amazon warehouses.<br/><br/>The Amazon Robotics team seeks to automate the picking activities in Amazon AR Sortable FCs by retrofitting into existing stations. The team develops robotic manipulators, both the related hardware and software (including machine learning approaches). The team was formed in 2022 and is based in Berlin.<br/><br/>Our team focuses on solving computer vision and manipulation challenges in Amazon warehouses. For example, how can robots interact with the fabric pods used to store items. The technical challenges include 3D scene understand for items in clutter, identification of target items in the scene, and placement and/or removal of target items. As the solution space is open ended, the team is looking for postdoc candidates who are excited to apply and advance the state-of-the-art algorithms to this domain.<br/><br/><br/><br/><br/>Key job responsibilities<br/>Key job responsibilities<br/>In this role you will:<br/><br/>• Work closely with a senior science advisor, collaborate with other scientists and engineers, and be part of Amazon’s vibrant and diverse global science community.<br/>• Publish your innovation in top-tier academic venues and hone your presentation skills.<br/>• Be inspired by challenges and opportunities to invent cutting-edge techniques in your area(s) of expertise. ",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3148456",
    "title": "Software Dev Intern - AI / Machine Learning",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3148456",
    "location": "DE, BE, Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "December 23, 2025",
    "updated_time": "15 days",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233582",
    "domain": null,
    "description": "Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions of customers worldwide?<br/>At Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. Customer obsession is part of our company DNA, which has made us one of the world's most beloved brands.<br/>Our Software Development Engineer (SDE) interns use modern technology to solve complex problems while seeing their work's impact first-hand. The challenges SDE interns solve at Amazon are meaningful and influence millions of customers, sellers, and products globally. We seek individuals passionate about creating new products, features, and services while managing ambiguity in an environment where development cycles are measured in weeks, not years. <br/>At Amazon, we believe in ownership at every level. As an SDE intern, you'll own the entire lifecycle of your code - from design through deployment and ongoing operations. This ownership mindset, combined with our commitment to operational excellence, ensures we deliver the highest quality solutions for our customers.<br/>We're looking for curious minds who think big and want to define tomorrow's technology. At Amazon, you'll grow into the high-impact engineer you know you can be, supported by a culture of learning and mentorship. Every day brings exciting new challenges and opportunities for personal growth.<br/><br/>Amazon internships across all seasons are full-time positions, and interns should expect to work in office, Monday-Friday, up to 40 hours per week typically between 8am-5pm. Specific team norms around working hours will be communicated by your manager. Interns should not have conflicts such as classes or other employment during the Amazon work-day. Applicants should have a minimum of one quarter/semester/trimester remaining in their studies after their internship concludes.<br/><br/><br/>Key job responsibilities<br/>•\tCollaborate and communicate effectively with experienced cross-disciplinary Amazonians to design, build, and operate innovative products and services that delight our customers, while participating in technical discussions to drive solutions forward.<br/>•\tDesign and develop scalable solutions using cloud-native architectures and microservices in a large distributed computing environment.<br/>•\tParticipate in code reviews and contribute to technical documentation.<br/>•\tBuild and maintain resilient distributed systems that are scalable, fault-tolerant, and cost-effective.<br/>•\tLeverage and contribute to the development of GenAI and AI-powered tools to enhance development productivity while staying current with emerging technologies. <br/>•\tWrite clean, maintainable code following best practices and design patterns.<br/>•\tWork in an agile environment practicing CI/CD principles while participating in operational responsibilities including on-call duties.<br/>•\tDemonstrate operational excellence through monitoring, troubleshooting, and resolving production issues.<br/><br/><br/>A day in the life<br/>As an intern, you will be matched to a manager and a mentor and will have the opportunity to influence the evolution of Amazon technology and lead critical projects early in your career. <br/><br/>The team requires an internship duration of 3 to 6 months.<br/><br/>In addition to working on an impactful project, you will have the opportunity to engage with Amazonians for both personal and professional development, expand your network, and participate in activities with other interns throughout your internship. No matter the location of your internship, we give you the tools to own your project and learn in a real-world setting.<br/>",
    "salary": null,
    "job_type": "full-time",
    "department": null
  }
]