[
  {
    "id": "744000110403311",
    "title": "Senior Data Analyst (m/f/d) - Recommendation - onsite in Hamburg or Berlin ",
    "company": "AboutYou",
    "url": "https://jobs.smartrecruiters.com/aboutyougmbh/744000110403311",
    "location": "Hamburg, de",
    "city": "Hamburg",
    "country": "de",
    "posted_date": "2026-02-20T15:07:00.450Z",
    "updated_time": null,
    "source": "SmartRecruiters:aboutyougmbh",
    "scraped_at": "2026-02-20T23:03:12.864816",
    "domain": "aboutyou.com",
    "description": "We are looking for a Data Analyst (m/f/d) with a passion for Data Engineering to be part of the development of our Recommendation Engine within our Business Intelligence Applications.\nOur BI App circle is embedded in our circle cluster “Customer & Shop Intelligence”, which is in charge of driving a personalized and inspirational shop experience.\nThe cross-functional team uses data from across the company and transforms it into logics & scores, used to provide the best personalized user shopping experience. You will work at the heart of our recommendation with deep insights into the algorithms behind that. Within this, you will work together with fellow engineers and data scientists to ensure that the systems serve customers in the best possible way, balancing speed and recommendation performance. To achieve this, you will leverage insights into the users engagement with recommendations as well as building a reliable data model within our data platform that scales for new recommendations.\n&#xa0;\nWhat you will do\nWork closely with several professions as a single contributor: Act as a bridge between data scientists, software engineers and product teams, ensuring alignment on recommendation goals and priorities\nCollaborate with stakeholders to understand product objectives, identify key performance indicators (KPIs), and translate them into measurable goals for recommendation performance\nCollaborate and exchange with our core shop analytics team on cross-team initiatives and develop together cross-stack data deliverables\nDevelop and maintain tracking systems, dashboards, and tools to monitor recommendation system performance and user behavior\nContinuously analyze data and update relevant dashboards to ensure that product managers have timely access to recommendation performance data\nAnalyze user behaviour, recommendation success metrics, and click-through data to improve recommendation relevance, usability and overall performance based on analysis and insights\nProvide i...",
    "salary": null,
    "job_type": null,
    "department": "TECH Standard"
  },
  {
    "id": "744000110411276",
    "title": "Senior Data Scientist (m/f/d) - Search Engine - onsite in Hamburg or Berlin",
    "company": "AboutYou",
    "url": "https://jobs.smartrecruiters.com/aboutyougmbh/744000110411276",
    "location": "Hamburg, de",
    "city": "Hamburg",
    "country": "de",
    "posted_date": "2026-02-20T15:27:32.099Z",
    "updated_time": null,
    "source": "SmartRecruiters:aboutyougmbh",
    "scraped_at": "2026-02-20T23:03:12.298313",
    "domain": "aboutyou.com",
    "description": "We are looking for a Senior Data Scientist (m/f/d) to be part of the development of our Search Engine.\nOur Search circle is embedded in our circle cluster “Customer & Shop Intelligence”, which is in charge of driving a personalized and inspirational shop experience.\nResponsibilities include designing and implementing search algorithms, leveraging NLP techniques, and optimizing search results for relevance and efficiency. This role will play a pivotal role in ensuring our Search Engine delivers highly accurate and comprehensive results, enhancing the overall user experience.\n&#xa0;\nWhat you will do\nDesign and develop innovative algorithms to power a personalized shopping experience, leveraging cutting-edge machine learning techniques\nDeploy your solutions into production, taking full ownership and ensuring high performance and scalability\nCombine your data science expertise with a pragmatic, agile approach to find innovative solutions and drive measurable results within a fast-paced environment\nChallenge the status quo by identifying areas for improvement in existing retrieval and reranking systems, particularly those relying heavily on business logic, and propose data-driven solutions\nThrive in a dynamic, fast-paced environment with a flat hierarchy, where your ideas and contributions can make a real difference\n&#xa0;\nWho you are\nProficiency in Python or experience with at least one scientific computing language (e.g., MATLAB, R, Julia, C++)\nStrong SQL skills with experience in analytical or transactional database environments\nTheoretical understanding of machine learning principles, coupled with a hands-on approach to building and iterating on models\nProven experience in building and deploying machine learning solutions that deliver tangible business value\nStrong understanding of data structures, algorithms, and tools for efficiently handling large datasets (e.g. pandas, numpy, dask, arrow, polars, …)\nExperience designing, building, and managing data pipelines\nFami...",
    "salary": null,
    "job_type": null,
    "department": "TECH Standard"
  },
  {
    "id": "7621678",
    "title": "Machine Learning Engineer, Dash",
    "company": "Dropbox",
    "url": "https://jobs.dropbox.com/listing/7621678?gh_jid=7621678",
    "location": "Remote - Germany",
    "city": "Remote - Germany",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-20T05:22:46-05:00",
    "source": "Greenhouse:dropbox",
    "scraped_at": "2026-02-20T23:02:31.957940",
    "domain": "dropbox.com",
    "description": "Role Description\n\nAs a Machine Leaning Engineer on our Multimedia AI team, you will be involved in shaping the future direction of Dropbox Dash and pushing the boundaries on what the world thinks is possible by leveraging the latest advancements in AI/ML. You will join a team of top-tier Machine Learning Engineers and be an inherent part of the product org to create and build delightful new experiences.&nbsp;\n\nCollaborating closely with cross-functional teams, you'll leverage your&nbsp;ML expertise to tackle audacious challenges. Your contributions will directly impact millions of users, as every line of code you write furthers our mission to revolutionize the way people work and collaborate.\n\nOur Engineering Career Framework is viewable by anyone outside the company and describes what’s expected for our engineers at each of our career levels. Check out our blog post on this topic and more here.\n\nResponsibilities\n\n​​Work with large scale data systems, and infrastructure\n\nHelp productionize multimodal and semantic retrieval systems at scale, powering Dash’s multimedia and creative search experiences.\n\n​​Partner with product, design, and infrastructure teams to improve retrieval, ranking, and conversational experiences across image, video, and text content.\n\n​​Build and iterate on quick prototypes and experimental features, driving innovation in multimodal interaction and creative workflows.\n\n​​Run quality and performance benchmarks across individual components and end-to-end systems to identify optimization opportunities.\n\n​​Contribute to open source projects and leverage OSS tools for efficient inference and scaling.\n\nOn-call work may be necessary occasionally to help address bugs, outages, or other operational issues, with the goal of maintaining a stable and high-quality experience for our customers.\n\nRequirements\n\nBS, MS, or PhD in Computer Science, Mathematics, Statistics, or other quantitative fields or related work experience\n\n5+ years of experience in enginee...",
    "salary": null,
    "job_type": null,
    "department": "Dash - Eng (Sub Team)"
  },
  {
    "id": "8429567002",
    "title": "Senior Data Scientist, Ads & Monetisation",
    "company": "Bolt",
    "url": "https://bolt.eu/en/careers/positions/8429567002?gh_jid=8429567002",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-19T09:51:39-05:00",
    "source": "Greenhouse:boltv2",
    "scraped_at": "2026-02-19T21:18:19.655380",
    "domain": "bolt.eu",
    "description": "&nbsp; \nWe're looking for an experienced Data Scientist to join our Ads &amp; Monetization team and help build intelligent ranking, pricing, and bidding systems for our advertising platform. If you're excited about applying machine learning to marketplace monetization challenges across Bolt's 200M+ users, you'll find plenty of impactful work here.\n\n&nbsp; \n\n&nbsp; About us\n&nbsp; \nWith over 200 million users in 50+ countries, Bolt is one of the fastest-growing tech companies in Europe and Africa. And it's all thanks to our people.\n\nWe believe in creating an inclusive environment where everyone is welcome, regardless of race, colour, religion, gender identity, sexual orientation, national origin, age, or ability.\n\nOur ultimate goal is to make cities for people, not cars. And we need your help on this mission!\n&nbsp; \n\n&nbsp; About the role\n&nbsp; \nWe are building an advertising and monetization platform, enabling merchants and brands to reach customers through sponsored listings, banners, and targeted promotions across Bolt Food. You'll drive the data science roadmap for Ads — from building automated pricing and bidding engines that maximize value for advertisers and users to integrating sponsored content into our existing ML ranking systems. This is a foundational role: you'll be the first dedicated Data Science hire for Ads &amp; Monetization, working closely with Product, Engineering and Data Science teams.\n&nbsp; \n\n&nbsp; Main tasks and responsibilities:\n&nbsp; \n\nDevelop bidding and auction algos that enable fair price discovery and efficient budget allocation.\n\nBuild conversion prediction models (pCTR, pCVR) to power automated CPA/CPO pricing for self-serve merchant advertising.\n\nDesign and implement ranking models that blend sponsored listings with organic results, optimizing for user experience and advertiser ROI.\n\nPartner with other data science teams to extend existing ranking infrastructure with ads-specific features and signals.\n\nDesign and run experiments...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "1365447133",
    "title": "Sovereign Cloud DevOps Security Engineer (m/f/d)",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/St_-Leon-Rot-Sovereign-Cloud-DevOps-Security-Engineer-%28mfd%29-68789/1365447133/",
    "location": "St. Leon-Rot, DE, 68789",
    "city": "St. Leon-Rot",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-02-19T09:18:11.667595",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "8330847002",
    "title": "Data Analyst",
    "company": "SumUp",
    "url": "https://sumup.com/careers/positions/8330847002?gh_jid=8330847002",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-19T10:58:35-05:00",
    "source": "Greenhouse:sumup",
    "scraped_at": "2026-02-19T09:17:27.723282",
    "domain": "sumup.com",
    "description": "As part of the Revenue Analytics team, you’ll play a key role in shaping how SumUp understands its growth. We turn complex marketing, brand, CRM, and commercial data into clear, reliable dashboards and visual stories that help teams understand what is happening today and make fast, informed decisions. Our Berlin-based team works closely with Marketing and Engagement stakeholders to drive performance through data. If you’re excited about empowering small business owners around the world through data-driven insights, we’d love to hear from you.\n\nTeam Description: You will join the Revenue Analytics team, focusing specifically on the Marketing &amp; Engagement domain. We are a group of curious, proactive analysts and engineers dedicated to maintaining data integrity while building new analytical products. We bridge the gap between raw data and commercial strategy, ensuring that our stakeholders in Marketing and CRM have the visibility they need to optimize their campaigns and funnel performance.\n\nWhat you’ll do\n\nTurn complex marketing, brand, and CRM data into reliable dashboards and visual stories that enable fast decision-making\n\nMaintain and improve our reporting layer to ensure stable visibility across channels and funnel stages\n\nConduct deep-dive analytical work to uncover performance drivers, patterns, and opportunities for experimentation\n\nBuild new analytical products that extend measurement capabilities, supporting full-funnel reporting and brand impact tracking\n\nIntroduce automation to reduce manual reporting overhead and accelerate iteration cycles\n\nYou’ll be great for this role if\n\nYou have 2-4 years of proven experience as a Data Analyst, preferably within commercial analytics, marketing, or CRM domains.\n\nYou possess strong proficiency in building dashboards and visual analytics (Tableau experience is highly preferred), with the ability to tell clear data stories.\n\nYou are skilled in SQL, capable of writing, optimizing, and validating complex queries.\n\nYou...",
    "salary": null,
    "job_type": null,
    "department": "Data & Analytics"
  },
  {
    "id": "7627429",
    "title": "Staff AI Engineer - Notebooks ",
    "company": "Datadog",
    "url": "https://careers.datadoghq.com/detail/7627429/?gh_jid=7627429",
    "location": "France, Remote; Germany, Remote; Ireland, Remote; Italy, Remote; Spain, Remote",
    "city": "France",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-23T04:17:29-05:00",
    "source": "Greenhouse:datadog",
    "scraped_at": "2026-02-19T09:17:15.243085",
    "domain": "datadoghq.com",
    "description": "We're looking for a Staff Software Engineer with deep experience in AI/ML to join the Notebooks team. Datadog Notebooks provide a flexible tool for ad-hoc data analysis, collaborative investigations, and technical documentation. Its fluidity makes it an ideal surface for agents and humans to interact. The Notebook team is building AI-driven workflows for natural-language data analysis, assisted graph generation, automated investigations, and more. You will act as a technical leader in this domain, focused on building industry-leader AI-powered features. We’re looking for a product-minded ML engineer with strong technical expertise, excellent communication skills, and a track record of driving impactful initiatives end to end.\n\nAt Datadog, we place value in our office culture - the relationships and collaboration it builds and the creativity it brings to the table. We operate as a hybrid workplace to ensure our Datadogs can create a work-life harmony that best fits them.\n\n&nbsp;\n\nWhat You’ll Do:\n\nSpearhead AI initiatives within Notebooks, serving as the technical owner for the design, development, and deployment of ML/AI-driven features.\n\nShape the long-term technical direction and strategy for AI workflows within Notebooks and related products.\n\nChampion the full development cycle: from rapid prototyping and defining success metrics/evaluations to running experiments, iterating, and achieving production-ready scale and reliability.\n\nDrive product direction with a strong user focus, always advocating for the best end-user experience.\n\nCoordinate with other leaders and product teams interested in leveraging Notebooks in their AI-powered workflows.\n\nDevelop robust agent systems, including tools, retrieval and planning strategies, guardrails, prompt management/evaluations, fallbacks, and human-in-the-loop processes.\n\nStay up to date with industry trends, guiding the adoption of new technologies and evolving best-practices.\n\n&nbsp;\n\nWho You Are:\n\nYou have a BS/MS/PhD in ...",
    "salary": null,
    "job_type": null,
    "department": "Dev Eng"
  },
  {
    "id": "7627404",
    "title": "Staff AI Engineer - MCP Services",
    "company": "Datadog",
    "url": "https://careers.datadoghq.com/detail/7627404/?gh_jid=7627404",
    "location": "France, Remote; Germany, Remote; Ireland, Remote; Italy, Remote; Spain, Remote",
    "city": "France",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-23T04:16:12-05:00",
    "source": "Greenhouse:datadog",
    "scraped_at": "2026-02-19T09:17:15.242744",
    "domain": "datadoghq.com",
    "description": "Datadog’s MCP team is scaling the capabilities of our MCP Services — an interface that enables external agents like Claude and Cursor, as well as internal Datadog AI Agents, to interact with Datadog data. As a Staff Engineer, you’ll play a critical role in evolving this agent-friendly tool surface, enabling agentic workflows across metrics, logs, and incidents etc. You'll drive forward advanced evaluation frameworks for agentic systems and contribute to the next generation of agent-tool interaction models. This is a fast-evolving space with deep ambiguity and high impact — ideal for someone eager to help shape Datadog’s applied AI future.\n\nAt Datadog, we place value in our office culture - the relationships and collaboration it builds and the creativity it brings to the table. We operate as a hybrid workplace to ensure our Datadogs can create a work-life harmony that best fits them.\n\n&nbsp;\n\nWhat You’ll Do:\n\nLead efforts to improve Datadog’s public-facing MCP server, enabling intelligent agents to discover and interact with our services\n\nDesign and implement agentic tool surfaces tailored for evaluation and production use across a wide variety of AI agents\n\nBuild and maintain advanced evaluation pipelines for measuring agent performance on Datadog workflows (e.g., investigations, incident triage, metric queries)\n\nInvestigate and resolve failure cases by analyzing tool output, improving query parsing, and enhancing agent feedback mechanisms\n\nCollaborate across Applied AI and internal teams to align on shared standards for tool integration and data access\n\n&nbsp;\n\nWho You Are:\n\nExperienced Staff-level engineer with a strong background in applied AI, agentic programming, and/or the following: LLM-powered automation pipelines, LLM orchestration frameworks (e.g., LangChain, LangGraph, CrewAI), Agent orchestration and tool-use systems\n\nComfortable working in high ambiguity and fast-changing environments; able to define and prioritize direction autonomously\n\nSkilled in bui...",
    "salary": null,
    "job_type": null,
    "department": "Dev Eng"
  },
  {
    "id": "1202972701",
    "title": "Working Student (f/m/d) - Full Stack JavaScript Developer",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/Walldorf-Working-Student-%28fmd%29-Full-Stack-JavaScript-Developer-69190/1202972701/",
    "location": "Walldorf, DE, 69190",
    "city": "Walldorf",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-02-18T09:18:30.248803",
    "domain": null,
    "description": "What you'll do\r\n\nIn this role, you will be counted upon to further enhance SAP’s official broadcast platform and service!\r\n\nCollaborate on a feature rich service management cloud application to improve the team’s daily process\r\n\nEnable a better service and user experience\r\n\nYou will be expected to design and write high-quality code with security and data privacy considerations as a foundation. \r\n\nSome of the technologies you will become familiar with include:\r\n\nVS Code\r\n\nReact, UI5, Next, Typescript\r\n\nAzure DevOps, Cosmos, Kubernetes, Docker\r\n\nWhat you bring \r\n\nDegree in computer science or related field\r\n\nA team player who is comfortable working in an international atmosphere\r\n\nProficient in JavaScript\r\n\nStructured and self-organized working style with a strong attention to detail and quality\r\n\nFluent in German and English    \r\n\nInterests in video production, live streaming are a plus  \r\n\nMeet your team\r\n\nThe interactive broadcast platform is a web app that makes it possible for leaders throughout SAP to reach a broad audience through live streaming and video on-demand. Working alongside a small group of developers and infrastructure experts, you will work in a team committed to delivering a high standard of quality and reliability.\r\n\nThe Broadcast Technologies team is a transnational team spanning multiple time zones. We actively seek to leverage the latest technologies and encourage open dialogue on ideas from all perspectives. Your colleagues bring diverse backgrounds in development, infrastructure, audio/video production and event management – offering a complete service that is highly visible within the company.\r\n\nYour set of application documents should contain a cover letter, a resume in table form, school leaving certificates, certificate of enrollment, current university transcript of records, copies of any academic degrees already earned, and if available, references from former employers (including internships). Please also describe your experience and s...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "2723255",
    "title": "Senior Applied Scientist - CRM (All Genders)",
    "company": "Zalando",
    "url": "https://jobs.zalando.com/en/jobs/2723255-Senior-Applied-Scientist---CRM-(All-Genders)",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "ZalandoScraper",
    "scraped_at": "2026-02-18T09:18:27.545100",
    "domain": null,
    "description": "EN\nDE",
    "salary": null,
    "job_type": null,
    "department": "Applied Science & Research"
  },
  {
    "id": "7423984",
    "title": "Senior Data Analyst, Marketing Analytics (f/m/x) ",
    "company": "HelloFresh",
    "url": "https://careers.hellofresh.com/global/en/job/7423984?gh_jid=7423984",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-20T06:55:20-05:00",
    "source": "Greenhouse:hellofresh",
    "scraped_at": "2026-02-17T09:17:51.430088",
    "domain": "hellofresh.com",
    "description": "The role\n\nAs a Growth Data Analyst in the Growth Analytics team, you will join the wider International Marketing Analytics group which acts as a key consultant for the International part of HelloFresh business. Your main focus will be on supporting your Growth stakeholders in their decision making, and you will be their key contact person regarding data and analytics questions. Your experience with Growth analytics and related technologies, together with your excellent communication, stakeholder management and organizational skills will have a big impact on the company’s performance.\n\nAbove all, we are looking for people who will make HelloFresh better. We believe there are many different ways of developing skills and we love diverse experiences! So even if you don’t “tick all the boxes” but think you’d thrive in this role, we would really like to learn more about you.\n\nWhat you’ll do\n\nProvide cracking insights to optimize marketing campaigns and channel targeting and efficiency\n\nTranslate business questions into meaningful analytics for your stakeholders via multiple Growth channels\n\nCreating ad-hoc insights, Lift Tests, AB test analyses, reporting &amp; visualization\n\nUtilise various databases and querying/programming languages to access, manipulate and present the data needed\n\nImprove how we look at Growth Analytics as a group, bringing key analytical insight to various levels across the organization\n\nYou will not only take responsibility of own projects, but also be a team player to collaborate and share knowledge with other analysts\n\nWhat you’ll bring\n\nProven experience in Growth Marketing Analytics or any of the following domains: Data Analytics/Business Analytics/Marketing Analytics/Product Analytics/Data Science\n\n5+ years of experience in data analytics and statistical modelling\n\nA degree in Analytics, Economics, Statistics, Mathematics, or similar quantitative discipline\n\nPreferably experience in working with web analytics (Google Analytics, Meta AA, ADH et...",
    "salary": null,
    "job_type": null,
    "department": "Marketing"
  },
  {
    "id": "7602240",
    "title": "Senior Data Engineer, Supply Data Engineering",
    "company": "GetYourGuide",
    "url": "https://getyourguide.careers/jobs/7602240?gh_jid=7602240",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-18T09:49:53-05:00",
    "source": "Greenhouse:getyourguide",
    "scraped_at": "2026-02-16T17:03:24.534666",
    "domain": "getyourguide.com",
    "description": "Change the way the world travels\n\nJoin the GetYourGuide journey to connect people with unforgettable travel experiences around the world. Millions look to us for unique activities they can trust, and it’s all powered by our commitment to make every single journey extraordinary - including yours.&nbsp;\n\nReady to unlock your potential with a community of fellow explorers? Find your next role at our Berlin HQ or one of our local offices around the globe, from New York to Bangkok. Head to&nbsp;getyourguide.careers to take the first step.\n\nTeam mission\n\nWithin Supply Data Engineering, part of the strategic Flywheel Data Engineering group, our mission is to build the trusted data foundations and self-serve capabilities for the supply side of our marketplace. We ingest, integrate, and structure critical internal and external datasets into reliable tables, metrics, and data products that help GetYourGuide onboard suppliers, support their success, and scale supply operations. We achieve this through close partnership with Supply, Product and Data, enabling teams to move faster with confidence.\n\nYour mission\n\nOwn the data end-to-end: Deliver reliable, high-quality data solutions that enable supply decision-making.\n\nBe a trusted thought partner: Work closely with Supply, Product, and Data to translate business needs into delivered outcomes and drive adoption of trusted, self-serve data capabilities.\n\nDrive technical excellence in the stack: Proactively manage and evolve the team’s data eco-system with a long-term mindset - covering architecture, testing, monitoring/observability, performance, and cost efficiency.\n\nImprove what’s already in production: Lead system design for new capabilities and continuously improve deployed systems through pragmatic refactors, reliability work, and simplification.\n\nUnblock and level up the team: Raise the engineering bar through strong code reviews, design input, and hands-on support - unblocking other engineers and sharing expertise to grow t...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "7602318",
    "title": "Engineering Manager, Supply Data Engineering",
    "company": "GetYourGuide",
    "url": "https://getyourguide.careers/jobs/7602318?gh_jid=7602318",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-18T09:49:53-05:00",
    "source": "Greenhouse:getyourguide",
    "scraped_at": "2026-02-16T17:03:24.533934",
    "domain": "getyourguide.com",
    "description": "Change the way the world travels\n\nJoin the GetYourGuide journey to connect people with unforgettable travel experiences around the world. Millions look to us for unique activities they can trust, and it’s all powered by our commitment to make every single journey extraordinary - including yours.&nbsp;\n\nReady to unlock your potential with a community of fellow explorers? Find your next role at our Berlin HQ or one of our local offices around the globe, from New York to Bangkok. Head to getyourguide.careers to take the first step.\n\nTeam mission\n\nWithin Supply Data Engineering - part of the strategic Flywheel Data Engineering group - our mission is to build the trusted data foundations and self-serve capabilities for the supply side of our marketplace. We ingest, integrate, and structure critical internal and external datasets into reliable tables, metrics, and data products that help GetYourGuide onboard suppliers, support their success, and scale supply operations. We achieve this through close partnership with Supply, Product and Data, enabling teams to move faster with confidence.\n\nYour mission\n\nBuild and lead a high-performing team: Hire, coach, and support data engineers to do their best work through clear expectations, direct feedback, and performance management.\n\nSet direction and deliver outcomes: Shape the roadmap, strategy, and long-term vision for Supply Data Engineering - aligned with the priorities of Product, Sales, and Data partners working in the space\n\nBe a trusted thought partner: Act as a strategic advisor to stakeholders across Supply, Product and Data, building strong relationships and driving adoption of trusted datasets and self-serve capabilities.\n\nRaise the bar on technical excellence: Ensure strong data architecture, reliability, and data quality. Establish effective engineering practices and standards while balancing hands-on technical leadership with people leadership.\n\nPower critical decision-making and initiatives: Lead work that integrat...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "7585609",
    "title": "Senior Data Analyst, Product ",
    "company": "GetYourGuide",
    "url": "https://getyourguide.careers/jobs/7585609?gh_jid=7585609",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-18T09:49:53-05:00",
    "source": "Greenhouse:getyourguide",
    "scraped_at": "2026-02-15T13:45:35.133580",
    "domain": "getyourguide.com",
    "description": "Change the way the world travels\n\nJoin the GetYourGuide journey to connect people with unforgettable travel experiences around the world. Millions look to us for unique activities they can trust, and it’s all powered by our commitment to make every single journey extraordinary - including yours.&nbsp;\n\nReady to unlock your potential with a community of fellow explorers? Find your next role at our Berlin HQ or one of our local offices around the globe, from New York to Bangkok. Head to&nbsp;getyourguide.careers to take the first step.\n\nTeam mission\n\nThe Analytics department's mission is to enable the organisation to take action based on data. We work on a variety of problems and datasets as members of cross-functional mission teams. We take ownership of the entire analytics funnel, from exploration through recommendations to impact measurement and take pride in the insights we generate.\n\nAs a Senior Data Analyst in the Product Analytics team, you will help drive measurement, strategy, and tactical decision-making within GetYourGuide. You will solve problems that could range from understanding how to best display our inventory to travelers; how can travelers explore, refine and compare; or developing a way to measure whether our customers’ on trip experience is optimal.\n\nYour mission\n\nDevelop quantitative analysis to understand customer problems and drive product decisions\n\nHelp the Traveler group to learn about their features' impact by designing and analyzing Experiments.\n\nIn collaboration with stakeholders identify opportunities and dependencies.\n\nCollaborate with Products and Engineering leads to develop a comprehensive understanding of end-to-end product experience.\n\nDesign and implement data models, metrics and dashboards to guide the teams’ product strategy and success.\n\nSupport the technical teams in tracking and producing more insightful data.&nbsp;&nbsp;\n\nContribute to the learning and experimentation culture of the company by promoting hypothesis-driven pro...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "7629374003",
    "title": "Senior AI Engineer (x/f/m)",
    "company": "Doctolib",
    "url": "https://job-boards.greenhouse.io/doctolib/jobs/7629374003",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-17T05:03:31-05:00",
    "source": "Greenhouse:doctolib",
    "scraped_at": "2026-02-15T13:45:30.974218",
    "domain": "doctolib.com",
    "description": "What we do\n\nJoin a team of passionate and hardworking entrepreneurs to transform healthcare!\n\nWorking in the tech team at Doctolib involves building innovative products and features to improve the daily lives of care teams and patients. We work in feature teams in an agile environment, while collaborating with product, design, and business teams.\n\nWhat you'll do\n\nWe are looking for a Senior AI Engineer (Python) to join the Conversational AI (CAI) team in the Practice Efficiency domain.\n\nAs a Senior AI Engineer, your mission will be to build and scale a new product in the Doctolib suite: our Phone Assistant, with the vision to revolutionize access to care for patients and day-to-day practice management for practitioners. This opportunity will allow you to leverage the latest technologies in AI, NLP, and speech recognition to build delightful user experiences and scale your product to millions of users.\n\nYour responsibilities include but are not limited to:\n\n&nbsp;\n\nDesign, ship, and operate production-grade agentic LLM systems that improve patient-practitioner interaction and streamline healthcare workflows\n\nValidate hypothesis with offline evaluation datasets and A/B tests on real traffic\n\nPartner with other machine learning teams to design and improve evaluation pipelines, security/safety guardrails, and metrics\n\nDevelop and maintain core agentic capabilities, including memory, reasoning orchestration, and tool adapters, ensuring strong observability, fallback mechanisms, and fail-safe behaviors\n\nOwn performance, observability, and security: monitoring dashboards, SLO/SLI, security posture\n\nEnsure privacy and security by design\n\nContribute to cross-functional initiatives that shape Doctolib's future AI platform and best practices in building agentic systems that will reinvent the work of health professionals and improve people's health\n\nAbout our tech environment\n\nOur solutions are built on a single, fully cloud-native platform that supports web and mobile app inte...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "1293220801",
    "title": "SAP BTP Project Management Office iXp Intern (f/m/d) - Support for analytics projects",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/Berlin-SAP-BTP-Project-Management-Office-iXp-Intern-%28fmd%29-Support-for-analytics-projects-10557/1293220801/",
    "location": "Berlin, DE, 10557",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-02-13T09:17:54.711129",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "8387225002",
    "title": "Early-Career Machine Learning Engineer - Accelerator Programme",
    "company": "SumUp",
    "url": "https://sumup.com/careers/positions/8387225002?gh_jid=8387225002",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-22T12:51:05-05:00",
    "source": "Greenhouse:sumup",
    "scraped_at": "2026-02-12T09:18:28.575978",
    "domain": "sumup.com",
    "description": "Location: On-site with the team in Berlin, Germany\n\nProgramme length: Up to 12 months (full-time, paid)\n\nStart: April 2026\n\nCohort size: Limited (14 total across all tracks - Data Analyst, Software Engineer, ML Engineering, and Data Scientist)\n\nTarget profiles: Final-year students, recent graduates, early-career engineers (0–2 years’)\n\nBuild AI-powered products that impact millions of small businesses - at the start of your career.\n\nAt SumUp, we build fintech solutions that empower over 4 million merchants across 37 markets to run and grow their businesses. Every day, this generates rich payments and business data - and SumUp’s next-gen AI tools turn that data into practical insights and intelligent tools that create real merchant value.\n\nThe SumUp Accelerator is a two-part, up to 12-month, full-time, paid programme for early-career engineers who want to learn fast by working on real production systems.\n\nThis is not a traditional internship. From day one, you’ll learn how machine learning systems are designed, shipped, and operated in real production environments - with guidance from experienced engineers and data scientists.\n\n👉 Curious what that actually looks like? Watch how our Accelerator participants become contributors to real-world features at SumUp.\n\n&nbsp;\n\nYour impact and what you’ll be doing\n\nAs part of an Accelerator squad, you’ll work alongside experienced engineers, data scientists, and product managers to:\n\nDesign, build, and deploy machine learning and LLM-powered solutions in customer-facing products, learning how models are productionized through APIs, services, and scalable backend systems\n\nDevelop and operate ML pipelines covering data processing, model training, evaluation, and serving\n\nMonitor, evaluate, and improve models to ensure strong performance, reliability, and robustness in production\n\nApply software engineering best practices such as version control, CI/CD, testing, and code reviews\n\nExperiment with prompt engineering and LLM-based wo...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "8387220002",
    "title": "Early Career Data Scientist - Accelerator Programme",
    "company": "SumUp",
    "url": "https://sumup.com/careers/positions/8387220002?gh_jid=8387220002",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-22T12:46:59-05:00",
    "source": "Greenhouse:sumup",
    "scraped_at": "2026-02-12T09:18:28.575571",
    "domain": "sumup.com",
    "description": "Location: On-site with the team in Berlin, Germany\n\nProgramme length: Up to 12 months (full-time, paid)\n\nStart: April 2026\n\nCohort size: Limited (14 total across all tracks - Data Analyst, Software Engineer, ML Engineering, Data Scientist)\n\nTarget profiles: Final-year students, recent graduates, early-career (0–2 years)\n\nBuild AI-powered products that impact millions of small businesses - at the start of your career.\n\nAt SumUp, we build fintech solutions that empower over 4 million merchants across 37 markets to run and grow their businesses. Every day, this generates rich payments and business data - and SumUp’s next-gen AI tools turn that data into practical insights and intelligent tools that create real merchant value.\n\nThe SumUp Accelerator is a two part, up to 12-month, full-time, paid programme for early-career engineers who want to learn fast by working on real production systems.\n\nThis is not a traditional internship. From day one, you’ll join a product squad, contribute to shared codebases, and ship production code used by merchants every day - with guidance from experienced data scientists.\n\n👉 Curious what that actually looks like? Watch how our Accelerator participants become contributors to real-world features at SumUp.\n\n&nbsp;\n\nYour impact and what you’ll be doing\n\nAs part of an Accelerator squad, you’ll work alongside experienced engineers, data scientists, and product managers to:\n\nBuild end-to-end product features for SumUp - from backend APIs to user-facing services (Web, Android, and iOS).\n\nIntegrate with core SumUp systems, databases, and internal tooling\n\nWrite clean, testable, well-documented code following team standards\n\nParticipate fully in team rituals: planning, technical discussions, code reviews, and knowledge-sharing sessions.\n\nLearn and apply engineering best practices across software development, AI systems, and UI/UX design.\n\nTake ownership, iterate quickly on ideas and prototypes, and learn by shipping real features.\n\nYour work will...",
    "salary": null,
    "job_type": null,
    "department": "Data Engineer/Scientist"
  },
  {
    "id": "744000108612025",
    "title": "Data Scientist - Quick Commerce",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000108612025",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2026-02-10T19:28:31.769Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-02-11T09:19:09.280745",
    "domain": "deliveryhero.com",
    "description": "We are on the lookout for a Data Scientist to join our Quick Commerce team on our journey to always deliver amazing experiences.\nWe are redefining how customers experience quick commerce. You’ll help build technology that scales our non-food offerings, reaching new market segments and driving revenue growth. By innovating within our Quick Commerce Team, you’ll make Delivery Hero the go-to platform for a broad range of products, helping us grow faster and deliver more value to customers around the world.\nAt Content & Assortment, we are building the AI engine that powers our global product catalog. We want every product to be perfectly described, categorized, and presented to our customers. Our mission is to automate and optimize the entire lifecycle of our product catalog—from creation and enrichment to categorization and curation—using advanced Machine Learning.\nAs a Data Scientist, you will work side-by-side with Data Scientists, Machine Learning Engineers, and Software Engineers to design, build, and deploy ML models that automate content creation and power a smarter product assortment.\nThis is a role for someone who has a strong background in applied ML, particularly in NLP, classification, or recommendation systems, and is hungry to solve complex catalog problems at scale. You will drive hypotheses, validate model accuracy, and bring ML-powered services for attribute enrichment, product categorization, and assortment curation into production with real business impact.\nIf you’re a strong coder with a problem-solving mentality and thrive in high-scale applied ML problems, we’d love to talk.\nYour mission:\n\nDesign, experiment, and deploy AI/ML models/Agents to automate the enrichment and moderation of product attributes at scale.\n\nDrive experimentation: formulate hypotheses, validate model performance , analyze business impact, and turn insights into production-ready models.\n\nDevelop and provide ML models to intelligently curate the product assortment, including att...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "4778869101",
    "title": "AI Research Engineer - ML Engineering",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4778869101?gh_jid=4778869101",
    "location": "Berlin; London; Munich",
    "city": "Berlin; London; Munich",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-12T04:50:31-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-02-11T09:18:57.931111",
    "domain": "helsing.ai",
    "description": "Who we are\n\nHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.\n\nAs democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.\n\nWe are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers. We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.\n\nThe role\n\nAt Helsing, we are pioneering the future of autonomous decision-making for defence. Our work spans the full AI landscape, including high-volume data processing, RL agent training, and large-scale foundation models. As a member of a cross-functional team, you will architect and implement the tools and platforms that enable these breakthroughs. Your focus will be on abstracting complex distributed systems to maximise training throughput and developer velocity. We are looking for engineers who can navigate the convergence of machine learning and systems engineering to build robust, scalable platforms.\n\nWhat you will do:\n\nExtend our highly integrated deep learning frameworks (built on top of PyTorch), making them efficient and easy to use for a wide range of use cases.\n\nScale our current infrastructure and tooling stack to support faster and larger distributed training.\n\nDesign data strategy to support large scale datasets and efficient storage, ensuring GPUs stay warm.\n\nYou should apply if you:\n\nHold an MSc or PhD in Computer Science or STEM field, with a focus on Machine Learning and Deep Learning.\n\nHave strong software engineering skills in Pyth...",
    "salary": null,
    "job_type": null,
    "department": "AI & Engineering"
  },
  {
    "id": "3176969",
    "title": "TOM Technician (Level 3), EU TOM TIE",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3176969",
    "location": "DE, Gattendorf",
    "city": "Gattendorf",
    "country": "Germany",
    "posted_date": "February  9, 2026",
    "updated_time": "14 days",
    "source": "AmazonScraper",
    "scraped_at": "2026-02-09T21:55:11.827465",
    "domain": null,
    "description": "Amazon’s EU Transportation Operations Management (TOM) Tech Integration and Execution team is looking for Technicians who want to create a best-in-class network and maintain sustainable yard systems within Amazon Transportation Services.<br/>As a TIE(Technology Integration and Execution) Technician, you will use your knowledge and specialized skills to implement technical solutions and provide high quality support for computer and electronic hardware and, operating systems, and software used in TOM managed yards. You are able to determine when it is appropriate to deviate from a standard practice to accomplish the desired result. You can troubleshoot and solve straightforward problems that do not have defined SOPs.<br/><br/><br/>Key job responsibilities<br/>•\tManage and resolve technical tickets within SLA timelines<br/>•\tComprehensively understand the Gatehouse PC configurations (hardware and software) and how 8-9 GH automation devices (per lane) are connected to the PC (their individual drivers, mac and IP address etc).<br/>•\tGet a comprehensive understanding of all TIE SOPs that guide towards potential issues causing the problem. Technician has to use their developed knowledge to isolate the root cause by iterative testing of various variables in combination.<br/>•\tOwn and manage the inventory of all GH automation equipment, keeping log of items checked out and raise ticket for fresh orders.<br/>•\tCoordinate with TIE Procurement, OTS, RME, and RYA/Gate teams<br/>•\tConduct daily health checks across all RRG sites and perform early fault detection<br/>•\tMonitor equipment performance metrics (license plate detection, vehicle detection, audio quality)<br/>•\tPerform quarterly preventive maintenance on RRG infrastructure<br/>•\tConduct deep-dive investigations for critical system performance issues<br/>•\tDocument findings, root cause analysis, corrective actions, and prevention recommendations<br/>•\tMaintain inventory accuracy through weekly monitoring and audits<br/>•\tServe as primary liaison with vendors and conduct post-work inspections<br/>•\tCollaborate with RYA and Gate teams on operational issues and dashboard accuracy<br/>•\tRaise tickets with clear problem descriptions, impact assessments, and supporting documentation<br/><br/>About the team<br/>Amazon couldn’t deliver at pace without the Amazon Transportation Service (ATS) team. As part of ATS, you’ll be welcomed into a diverse team that plays a central role in our success. Using air, sea and road transport, as well as sortation centres equipped with the latest technology, you’ll help Amazon’s transport run at maximum efficiency. Our team captures data and uses it to drive decisions. They are key to making Amazon more innovative and efficient.<br/>We put safety first as our people are our priority. And we use the expertise of our people to get packages to their destination.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3176965",
    "title": "TOM Technician (Level 3), EU TOM TIE",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3176965",
    "location": "DE, Helmstedt",
    "city": "Helmstedt",
    "country": "Germany",
    "posted_date": "February  9, 2026",
    "updated_time": "14 days",
    "source": "AmazonScraper",
    "scraped_at": "2026-02-09T21:55:11.827463",
    "domain": null,
    "description": "Amazon’s EU Transportation Operations Management (TOM) Tech Integration and Execution team is looking for Technicians who want to create a best-in-class network and maintain sustainable yard systems within Amazon Transportation Services.<br/>As a TIE(Technology Integration and Execution) Technician, you will use your knowledge and specialized skills to implement technical solutions and provide high quality support for computer and electronic hardware and, operating systems, and software used in TOM managed yards. You are able to determine when it is appropriate to deviate from a standard practice to accomplish the desired result. You can troubleshoot and solve straightforward problems that do not have defined SOPs.<br/><br/><br/>Key job responsibilities<br/>•\tManage and resolve technical tickets within SLA timelines<br/>•\tComprehensively understand the Gatehouse PC configurations (hardware and software) and how 8-9 GH automation devices (per lane) are connected to the PC (their individual drivers, mac and IP address etc).<br/>•\tGet a comprehensive understanding of all TIE SOPs that guide towards potential issues causing the problem. Technician has to use their developed knowledge to isolate the root cause by iterative testing of various variables in combination.<br/>•\tOwn and manage the inventory of all GH automation equipment, keeping log of items checked out and raise ticket for fresh orders.<br/>•\t<br/>•\tCoordinate with TIE Procurement, OTS, RME, and RYA/Gate teams<br/>•\tConduct daily health checks across all RRG sites and perform early fault detection<br/>•\tMonitor equipment performance metrics (license plate detection, vehicle detection, audio quality)<br/>•\tPerform quarterly preventive maintenance on RRG infrastructure<br/>•\tConduct deep-dive investigations for critical system performance issues<br/>•\tDocument findings, root cause analysis, corrective actions, and prevention recommendations<br/>•\tMaintain inventory accuracy through weekly monitoring and audits<br/>•\tServe as primary liaison with vendors and conduct post-work inspections<br/>•\tCollaborate with RYA and Gate teams on operational issues and dashboard accuracy<br/>•\tRaise tickets with clear problem descriptions, impact assessments, and supporting documentation<br/><br/><br/>About the team<br/>Amazon couldn’t deliver at pace without the Amazon Transportation Service (ATS) team. As part of ATS, you’ll be welcomed into a diverse team that plays a central role in our success. Using air, sea and road transport, as well as sortation centres equipped with the latest technology, you’ll help Amazon’s transport run at maximum efficiency. Our team captures data and uses it to drive decisions. They are key to making Amazon more innovative and efficient.<br/>We put safety first as our people are our priority. And we use the expertise of our people to get packages to their destination.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3176950",
    "title": "TOM Technician (Level 3), EU TOM TIE",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3176950",
    "location": "DE, NW, Dortmund",
    "city": "Dortmund",
    "country": "Germany",
    "posted_date": "February  9, 2026",
    "updated_time": "14 days",
    "source": "AmazonScraper",
    "scraped_at": "2026-02-09T21:55:11.827461",
    "domain": null,
    "description": "Amazon’s EU Transportation Operations Management (TOM) Tech Integration and Execution team is looking for Technicians who want to create a best-in-class network and maintain sustainable yard systems within Amazon Transportation Services.<br/>As a TIE(Technology Integration and Execution) Technician, you will use your knowledge and specialized skills to implement technical solutions and provide high quality support for computer and electronic hardware and, operating systems, and software used in TOM managed yards. You are able to determine when it is appropriate to deviate from a standard practice to accomplish the desired result. You can troubleshoot and solve straightforward problems that do not have defined SOPs.<br/><br/><br/>Key job responsibilities<br/>•\tManage and resolve technical tickets within SLA timelines<br/>•\tComprehensively understand the Gatehouse PC configurations (hardware and software) and how 8-9 GH automation devices (per lane) are connected to the PC (their individual drivers, mac and IP address etc).<br/>•\tGet a comprehensive understanding of all TIE SOPs that guide towards potential issues causing the problem. Technician has to use their developed knowledge to isolate the root cause by iterative testing of various variables in combination.<br/>•\tOwn and manage the inventory of all GH automation equipment, keeping log of items checked out and raise ticket for fresh orders.<br/>•\t<br/>•\tCoordinate with TIE Procurement, OTS, RME, and RYA/Gate teams<br/>•\tConduct daily health checks across all RRG sites and perform early fault detection<br/>•\tMonitor equipment performance metrics (license plate detection, vehicle detection, audio quality)<br/>•\tPerform quarterly preventive maintenance on RRG infrastructure<br/>•\tConduct deep-dive investigations for critical system performance issues<br/>•\tDocument findings, root cause analysis, corrective actions, and prevention recommendations<br/>•\tMaintain inventory accuracy through weekly monitoring and audits<br/>•\tServe as primary liaison with vendors and conduct post-work inspections<br/>•\tCollaborate with RYA and Gate teams on operational issues and dashboard accuracy<br/>•\tRaise tickets with clear problem descriptions, impact assessments, and supporting documentation<br/><br/><br/>About the team<br/>Amazon couldn’t deliver at pace without the Amazon Transportation Service (ATS) team. As part of ATS, you’ll be welcomed into a diverse team that plays a central role in our success. Using air, sea and road transport, as well as sortation centres equipped with the latest technology, you’ll help Amazon’s transport run at maximum efficiency. Our team captures data and uses it to drive decisions. They are key to making Amazon more innovative and efficient.<br/>We put safety first as our people are our priority. And we use the expertise of our people to get packages to their destination.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "8401443002",
    "title": "Data Scientist - Price",
    "company": "Trivago",
    "url": "https://careers.trivago.com/job/r8401443002?gh_jid=8401443002",
    "location": "Düsseldorf",
    "city": "Düsseldorf",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-18T02:11:55-05:00",
    "source": "Greenhouse:trivago",
    "scraped_at": "2026-02-09T09:22:36.598239",
    "domain": "trivago.com",
    "description": "When travelers are searching for a hotel, we want the obvious choice to be trivago! Our leading metasearch engine is super fast and constantly optimized – enabling millions of travelers to compare hotel prices from hundreds of booking sites and find great deals in just a few clicks. We use cutting-edge technology, real-time auction, and machine learning techniques with petabytes of data to create an experience, time and money saved! In the lively city of Düsseldorf, we seize opportunities to learn everyday, innovate, and make an enduring mark on the travel industry. At trivago you will find those who aren’t afraid of change but rather embrace it, turning every challenge into a pathway for growth. Join trivago, work with a great team, and grow with us!\n\nJoin us in making a difference\n\nAs part of our Price team within the Deals Product unit, you'll design and optimize algorithms that revolutionize how millions of travellers discover hotel deals across hundreds of booking sites daily. This is a newly formed team where your expertise in pricing strategies, model development, and product sense will directly shape our product direction. Working closely with product managers, engineers, and peer data science teams, you'll combine experimental design, machine learning, and optimization to solve complex challenges at scale and deliver strategic insights that drive our mission forward. If you have a strong track record of delivering impactful analyses and ML solutions in production environments, we invite you to apply and drive the future of data-driven pricing innovation today!\n\nGet an inside look at data science at trivago:\n\nHow you’ll make an impact:\n\nDesign analytical frameworks and models that inform pricing strategy and product decisions through data-driven insights and simulations\n\nBuild and deploy production-ready ML models for price prediction and caching optimization that serve millions of users in real-time\n\nEstablish experimentation standards by designing A/B test...",
    "salary": null,
    "job_type": null,
    "department": "Price (Ruoyun Lin)"
  },
  {
    "id": "7594703",
    "title": "Senior ML Ops Engineer, AI Platform Team",
    "company": "GetYourGuide",
    "url": "https://getyourguide.careers/jobs/7594703?gh_jid=7594703",
    "location": "berlin",
    "city": "berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-18T09:49:52-05:00",
    "source": "Greenhouse:getyourguide",
    "scraped_at": "2026-02-08T18:30:38.642073",
    "domain": "getyourguide.com",
    "description": "Change the way the world travels\n\nBe part of the GetYourGuide journey and connect people with unforgettable travel experiences worldwide. Since 2009, millions of travelers have booked unique activities with us in over 12,000 cities. Our headquarters in Berlin is supported by 16 other local offices across the globe.&nbsp;\n\nReady to join a diverse community of over 850 fellow explorers dedicated to revolutionizing the travel experience industry? Check out our careers site to learn more.\n\nTeam mission\n\nSince 2020, GetYourGuide has established a Machine Learning (ML) Platform team, providing the tools and best practices to help the Data Products team build and maintain production-ready ML/AI systems. The team's mission is to enable our diverse teams and ML/AI use-cases via self-service tools and automation. More recently the team was renamed as AI Platform Team as a way to better reflect our ambition to become an AI-first organization.\n\nAs a Senior MLOps Engineer, you'll join our AI Platform Team and have a chance to make an enormous impact across all of our data products. You'll work closely with our Data Products teams to build systems that enable ML/AI algorithms to go to production. If you are interested in contributing to the success of a product that is used by millions of travelers around the world then keep on reading.\n\nYour mission:\n\nYou'll design and implement systems and tools for scalable and more efficient machine learning solutions.\n\nYou will work to increase the amount of data products in production reliably, reduce the time to production, and reduce operational costs.\n\nYou'll be partnering/collaborating with product teams to bring advanced algorithms into production, following MLOps best practices.\n\nYour toolkit:\n\nSoftware Engineering: You have strong fundamentals in Computer Science and a polyglot mindset. Python is your language of choice; you are able to migrate between various programming languages though. Delivering clean code and investigating new ...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "1290739201",
    "title": "Working Student (f/m/d) - Cloud Delivery Architecture",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/Walldorf-Working-Student-%28fmd%29-Cloud-Delivery-Architecture-69190/1290739201/",
    "location": "Walldorf, DE, 69190",
    "city": "Walldorf",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-02-06T09:17:37.611222",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "7593660",
    "title": "Koordinator für Arbeitssicherheit und Notfallmanagement (all genders)",
    "company": "HelloFresh",
    "url": "https://careers.hellofresh.com/global/en/job/7593660?gh_jid=7593660",
    "location": "Barleben, Saxony-Anhalt, Germany; Magdeburg, Saxony-Anhalt, Germany",
    "city": "Barleben",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-20T06:55:20-05:00",
    "source": "Greenhouse:hellofresh",
    "scraped_at": "2026-02-06T09:16:32.909531",
    "domain": "hellofresh.com",
    "description": "Deine Rolle\n\nAls Koordinator für Arbeitssicherheit und Notfallmanagement&nbsp;(all genders) unterstützt Du dein Team bei der Umsetzung von Health-&amp;-Safety-Programmen, führst Risikobewertungen durch und förderst aktiv eine nachhaltige Sicherheitskultur am Produktionsstandort von HelloFresh in Barleben. Die Position richtet sich an eine proaktive, strukturierte und detailorientierte Persönlichkeit mit Leidenschaft für Gesundheit und Sicherheit am Arbeitsplatz.\n\nBitte beachte, dass diese Position auf 24 Monate befristet ist; eine anschließende Entfristung wird angestrebt.\n\nDein Verantwortungsbereich\n\nDu übernimmst die Rolle als Sicherheitsbeauftragte Person und bist Mitglied des Arbeitsschutzausschusses (ASA).\n\nDu begleitest regelmäßige Sicherheitsbegehungen und Audits und stellst die Einhaltung aller relevanten Sicherheitsstandards und gesetzlichen Vorgaben sicher.\n\nDu unterstützt bei der Untersuchung von Arbeits- und Beinaheunfällen sowie sicherheitsrelevanten Vorfällen.\n\nDu wirkst an der Entwicklung, Umsetzung und Überprüfung von Notfall- und Evakuierungsplänen mit und nimmst an Notfallübungen teil.\n\nDu koordinierst Ersthelfer:innen während der Schicht und stellst die ordnungsgemäße Durchführung von Erste-Hilfe-Maßnahmen sicher.\n\nDu unterstützt bei der Planung, Durchführung und Nachbereitung von Sicherheitsunterweisungen und Schulungen für Mitarbeitende.\n\nDu führst Sicherheitsprüfungen an Geräten und Werkzeugen durch und sorgst für die Einsatzbereitschaft von Erste-Hilfe- und Notfallausrüstung.\n\nDu begleitest regelmäßige Risikobewertungen, identifizierst potenzielle Gefährdungen und empfiehlst geeignete Präventionsmaßnahmen.\n\nDu unterstützt Begehungen und Kontrollen im Bereich Brandschutz.\n\nDein Profil&nbsp;\n\nDu verfügst über ein gutes Verständnis der Arbeitsabläufe in einem produzierenden Umfeld, idealerweise durch frühere Berufserfahrung.\n\nDu hast Erfahrung als Sicherheitsbeauftragte Person und Kenntnisse im Bereich Brandschutz.\n\nDu bringst großes Interesse an...",
    "salary": null,
    "job_type": null,
    "department": "Food Safety and Quality"
  },
  {
    "id": "744000107070935",
    "title": "Staff Data Analyst - AdTech",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000107070935",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2026-02-03T13:46:30.568Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-02-03T14:45:16.541934",
    "domain": "deliveryhero.com",
    "description": "We are on the lookout for a Staff Data Analyst for our AdTech team.\nThe Data Analyst, will be responsible for optimizing our commercial and product strategies through data-driven insights. This role will collaborate closely with the commercial,&#xa0; product, and engineering teams, and regional analytics teams to analyze the efficacy and areas of improvement of the Ad product portfolio.\n&#xa0;\nYour key responsibilities include :\n\nDrive Decision Making: Guide critical commercial decisions by transforming raw data into actionable strategic insights.\n\nPerformance Monitoring: Architect robust KPI frameworks and tools to assess business health and continuously monitor performance trends.\n\nAdvanced Analysis: Build and optimize predictive machine learning models to uncover behavioral drivers, foresee challenges, and identify revenue opportunities.\n\nStakeholder Influence: Translate complex technical findings into compelling narratives that influence stakeholders and align with organizational strategy.\n\nData Governance: Collaborate with Commercial, Product, and Engineering teams to define data standards and establish global guidelines for data consumption.\n\nCommunication: Present high-level recommendations to senior leadership with clarity to drive immediate business action.",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "8392213002",
    "title": "Senior Data Scientist, Rides Dynamic Pricing",
    "company": "Bolt",
    "url": "https://bolt.eu/en/careers/positions/8392213002?gh_jid=8392213002",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-05T11:08:53-05:00",
    "source": "Greenhouse:boltv2",
    "scraped_at": "2026-02-03T14:44:55.666282",
    "domain": "bolt.eu",
    "description": "We’re looking for an experienced Data Scientist to join our Rides Dynamic Pricing team and help build our autonomous pricing and incentives engine.&nbsp;&nbsp;\n\nIf you're excited about applying machine learning and automated decision-making tools to real-world mobility pricing challenges, you’ll find plenty of impactful work here.\n\n&nbsp;\n\nAbout us\n\nWith over 200 million customers in 50+ countries, Bolt is one of the fastest-growing tech companies in Europe and Africa. And it's all thanks to our people.\n\n&nbsp;\n\nWe believe in creating an inclusive environment where everyone is welcome, regardless of race, colour, religion, gender identity, sexual orientation, age, or disability.\n\n&nbsp;\n\nOur ultimate goal is to make cities for people, not cars, and we need your help to achieve this mission!\n\nAbout the role\n\nWe are building automated, scalable solutions to optimize pricing performance across diverse global markets. You’ll work on everything from modeling price elasticity to experimenting with dynamic pricing strategies that support growth, profitability, and reliability, while maintaining market guardrails. You’d also help to optimise real-time data streams and automation endpoints to ensure our systems run smoothly at scale.\n\nMain tasks and responsibilities:\n\nIdentify, research and prioritise hypotheses to improve automated pricing algorithms.\n\nDevelop, deploy, and monitor automated pricing systems, ranging from classical supervised to reinforcement learning and advanced control system designs.\n\nDesign and run experiments to validate pricing approaches and estimate their impact.\n\nLead the automation-first approach to pricing in the company.\n\nPartner with analysts, engineers and operations specialists to identify pricing problems and develop the most efficient solutions.\n\n&nbsp;\n\nAbout you:\n\n&nbsp;\n\n5+ years of experience in applied machine learning for marketplace pricing.\n\nMastery in Python and SQL.\n\n Exceptional knowledge of machine learning algorithms, statistica...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "1289712901",
    "title": "Working Student (f/m/d) - Contract Accounting Development",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/Walldorf-Working-Student-%28fmd%29-Contract-Accounting-Development-69190/1289712901/",
    "location": "Walldorf, DE, 69190",
    "city": "Walldorf",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-02-03T09:14:38.880144",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000106856865",
    "title": "Senior Computer Vision Engineer - Berlin - (f/m/x)",
    "company": "AUTO1 Group",
    "url": "https://jobs.smartrecruiters.com/auto1/744000106856865",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2026-02-02T15:14:51.011Z",
    "updated_time": null,
    "source": "SmartRecruiters:auto1",
    "scraped_at": "2026-02-03T09:14:33.433591",
    "domain": "auto1-group.com",
    "description": "What You'll Do\n\nMaintain, optimize, and ensure the reliability of our complex, multi-stage computer vision pipeline, which includes models for semantic segmentation, object detection, image classification, and optical flow estimation.\n\nSet the technical vision and roadmap for specific parts of the CV pipeline, making key architectural and algorithmic decisions to drive performance and accuracy.\n\nLead the adaptation of existing models and the development of new components for upcoming projects, translating business needs into technical solutions.\n\nOversee the entire data lifecycle for your models, from defining clear annotation guidelines to managing data quality and iterating on the feedback loop with our in-house annotation team.\n\nWrite clean, maintainable, and robust production-level Python code, adhering to strong software engineering best practices.\n\nManage model training, experimentation, and evaluation on our on-premise Linux server infrastructure.",
    "salary": null,
    "job_type": null,
    "department": "Technology"
  },
  {
    "id": "7582805",
    "title": "Senior AI Engineer - APM Integrations",
    "company": "Datadog",
    "url": "https://careers.datadoghq.com/detail/7582805/?gh_jid=7582805",
    "location": "Germany, Remote; Italy, Remote; Spain, Remote",
    "city": "Germany",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-02T08:52:02-05:00",
    "source": "Greenhouse:datadog",
    "scraped_at": "2026-02-03T09:13:48.055139",
    "domain": "datadoghq.com",
    "description": "IDM is the team that works on Datadog APM integrations: the parts that connect Datadog to the tools and services customers use. The team’s job is to make it easier for engineers to build and maintain integrations over time, and to keep quality and reliability high.&nbsp;You will build AI-assisted tools that help with day-to-day engineering work, like drafting code changes, suggesting fixes, and checking results with tests and other automated checks. The goal is building tools that engineers can trust in real production work. You’ll also work closely with other teams, understand how they work, and build solutions that fit their process.&nbsp;You will define what “good” means for these tools, measure results, and improve them over time. You’ll set up evaluation and testing so the AI output stays correct and doesn’t silently get worse. This is a senior role with high ownership, from early prototypes to production and ongoing support.\n\nAt Datadog, we place value in our office culture - the relationships and collaboration it builds and the creativity it brings to the table. We operate as a hybrid workplace to ensure our Datadogs can create a work-life harmony that best fits them.\n\n&nbsp;\n\nWhat You’ll Do:\n\nBuild agent workflows that take an integration need from plan to implementation and validation with humans approving at the right checkpoints.\n\nCreate systems that synthesize context from codebases, docs, specs, telemetry, and historical incidents to make changes that match Datadog conventions and customer expectations.\n\nGenerate and evolve integration code and tests, including end-to-end scenarios that reflect real customer workloads and product features.\n\nDesign evaluation harnesses that prevent silent regressions: golden sets, scenario baselines, semantic checks, performance thresholds, and release gating.\n\nBuild portfolio-level automation: proactive updates for upstream breaking changes, tracer feature rollouts across the catalog, migrations to new schemas/semantics...",
    "salary": null,
    "job_type": null,
    "department": "Dev Eng"
  },
  {
    "id": "1288961501",
    "title": "Client Delivery Manager (m/f/d) - Sovereign Cloud Delivery Germany",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/St_-Leon-Rot-Client-Delivery-Manager-%28mfd%29-Sovereign-Cloud-Delivery-Germany-68789/1288961501/",
    "location": "St. Leon-Rot, DE, 68789",
    "city": "St. Leon-Rot",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-01-30T16:39:21.987039",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000106519456",
    "title": "(Junior) Data Analyst (m/f/d) - Supply Data Solutions",
    "company": "AboutYou",
    "url": "https://jobs.smartrecruiters.com/aboutyougmbh/744000106519456",
    "location": "Hamburg, de",
    "city": "Hamburg",
    "country": "de",
    "posted_date": "2026-01-30T14:26:31.135Z",
    "updated_time": null,
    "source": "SmartRecruiters:aboutyougmbh",
    "scraped_at": "2026-01-30T16:39:01.149182",
    "domain": "aboutyou.com",
    "description": "We are looking for a (Junior) Data Analyst to join our Supply Data Solutions&#xa0;team, where we build end-to-end data-driven decision-making tools. These solutions work in sync to guide daily operations in the Supply Unit at ABOUT YOU, supporting Pricing & Steering, Demand Planning, and Inventory Management.\nIn this role, you will work mainly with business stakeholders as well as data scientists and engineers. You will provide analytical support, transforming fuzzy business requirements into actionable insights that drive strategic decisions and operational improvements.\nWhat you will do\nGather, analyze, and interpret data to fulfill reporting requests from business stakeholders\nTranslate complex data into clear, actionable insights that support business strategy\nSupport ad hoc analysis and contribute to data-driven decision-making\nAutomate routine reporting processes and maintain existing reports to ensure reliability and improve data workflows\nMaintain, design, and implement advanced dashboards using tools like Google Looker Studio, enabling self-service analytics across the organization\nCollaborate with data engineers, data scientists, and stakeholders across the organization to ensure data quality and consistency while delivering data-driven insights that support supply-related business decisions\nCommunicate findings effectively to technical and non-technical audiences\nFoster a data-driven culture within the organization, promoting the use of analytics in decision-making processes\nWho you are\nYou have at least 1-2 years of experience as a Data Analyst\nProficiency in SQL for complex data analysis, reporting, and querying large datasets\nExperience with Google BigQuery\nExperience with data visualization tools (e.g., Looker Studio, Excel, or similar) to create compelling dashboards and reports\nExcellent communication skills in English\nAbility to translate fuzzy business requirements from diverse stakeholders into analytical requirements.\nProactive and self-driven, ...",
    "salary": null,
    "job_type": null,
    "department": "TECH Standard"
  },
  {
    "id": "1216615101",
    "title": "Working Student (f/m/d) - Developer",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/Dresden-Working-Student-%28fmd%29-Developer-01067/1216615101/",
    "location": "Dresden, DE, 01067",
    "city": "Dresden",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-01-30T09:14:10.514368",
    "domain": null,
    "description": "an>\n\nWhat you'll do\r\n\nCan you imagine an IT infrastructure world without manual configuration and management tasks? In this role it is your task to create this. The construction and lifecycle management of large IT landscapes at the push of a button up to the use of Al support.\nAs Developer (f/m/d), you will be part of the Cloud Provider Interface team developing automations to enable deployments of different SAP cloud offerings on Hyperscaler and SAP owned datacenters and to build the automation and integration into the existing operations tool set and processes. Leverage AI functionalities to ease and support end-user automation usage experience.\nYou will drive the process to transform and mature the prototyped code to a production ready solution that can become managed by the infrastructure operation teams. This includes continuous refinements of the prototyped solution and conducting knowledge transfer sessions to the relevant operation teams.\r\n\nWhat you bring\r\n\nStudent (f/m/d) at a university or a university of applied sciences\r\n\nStudies in computer sciences or comparable subject (min. 4 Semester)\r\n\nAbility to work in an international team\r\n\nSoftware development skills in programming/scripting languages e.g., Python, JAVA, Perl …\r\n\nFamiliar with scrum development method and CI/CD deployment pipelines\r\n\nGeneral web services development skills HTTP/HTTPS, RESTful APIs, Open API, Swagger\r\n\nKnowledge and experience with microservices, container, Kubernetes\r\n\nFamiliar with Linux operating system\r\n\nStrong analytical and logical skills\r\n\nAbility to familiarize oneself with existing Codebase\r\n\nWillingness to learn and own initiative; Teamplayer but also autonomous work\r\n\nCustomer orientation with a strong focus on quality\r\n\nGood English language skills fluent in spoken and written\r\n\nIdeally but not necessarily you do have experience with:\r\n\nusage of Public Cloud Infrastructures (Google Cloud Platform, Amazon Web Services, Azure etc.)\r\n\ncentral infrastructure services (...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "8395599002",
    "title": "AI Engineer - FDE (Forward Deployed Engineer)",
    "company": "Databricks",
    "url": "https://databricks.com/company/careers/open-positions/job?gh_jid=8395599002",
    "location": "Munich, Germany",
    "city": "Munich",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-19T16:10:28-05:00",
    "source": "Greenhouse:databricks",
    "scraped_at": "2026-01-29T14:38:56.362130",
    "domain": "databricks.com",
    "description": "AI Engineer - FDE (Forward Deployed Engineer) (ALL LEVELS)\n\nReq ID: CSQ426R237\n\nMission\n\nThe AI Forward Deployed Engineering (AI FDE) team is a highly specialised customer-facing AI team at Databricks. We deliver professional services engagements to help our customers build and productionize first-of-its-kind AI applications. We work cross-functionally to shape long-term strategic priorities and initiatives alongside engineering, product, and developer relations, as well as support internal subject matter expert (SME) teams. We view our team as an ensemble: we look for individuals with strong, unique specialisations to improve the overall strength of the team. This team is the right fit for you if you love working with customers, teammates, and fueling your curiosity for the latest trends in GenAI, LLMOps, and ML more broadly.\n\nWe welcome remote applicants located near our offices. The preferred locations (in priority order) are London (UK), Munich (Germany), Paris (France), and Amsterdam (NL).\n\nThe impact you will have:\n\nDevelop cutting-edge GenAI solutions, incorporating the latest techniques from our Mosaic AI research to solve customer problems\n\nOwn production rollouts of consumer and internally facing GenAI applications\n\nServe as a trusted technical advisor to customers across a variety of domains\n\nPresent at conferences such as Data + AI Summit, recognized as a thought leader internally and externally\n\nCollaborate cross-functionally with the product and engineering teams to influence priorities and shape the product roadmap&nbsp;\n\nWhat we look for:\n\nExperience building GenAI applications, including RAG, multi-agent systems, Text2SQL, fine-tuning, etc., with tools such as HuggingFace, LangChain, and DSPy\n\nExpertise in deploying production-grade GenAI applications, including evaluation and optimizations&nbsp;\n\nExtensive years of hands-on industry data science experience, leveraging common machine learning and data science tools, i.e. pandas, scikit-learn, PyTorc...",
    "salary": null,
    "job_type": null,
    "department": "Professional Services Operations"
  },
  {
    "id": "744000106252995",
    "title": "Team Lead Data Science (f/m/x)",
    "company": "AUTO1 Group",
    "url": "https://jobs.smartrecruiters.com/auto1/744000106252995",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2026-01-29T09:08:00.433Z",
    "updated_time": null,
    "source": "SmartRecruiters:auto1",
    "scraped_at": "2026-01-29T09:16:03.790569",
    "domain": "auto1-group.com",
    "description": "Collaborate closely with your team and key stakeholders to convert business requirements into Machine Learning solutions\nFoster a culture that values data-driven decision-making within the organization and aid in the enhancement of our data platform\nOffer ML and engineering expertise and ensure your team builds, deploys and maintains high standards models\nDrive innovation and creativity within your team, encouraging them to explore new data science techniques and approaches\nEmpower your team by supporting members to grow and take ownership of data science projects\nCultivate and demonstrate an action-oriented approach, encouraging your team to experiment, iterate,&#xa0;drive initiatives forward, even amidst ambiguite and continually assess and improve the team's performance, setting clear expectations and providing constructive feedback\n&#xa0;",
    "salary": null,
    "job_type": null,
    "department": "Technology"
  },
  {
    "id": "744000106245485",
    "title": "Duales Studium Data Science – in Kooperation mit der DHBW Stuttgart",
    "company": "Sixt",
    "url": "https://jobs.smartrecruiters.com/sixt/744000106245485",
    "location": "Munich, de",
    "city": "Munich",
    "country": "de",
    "posted_date": "2026-01-29T08:25:16.368Z",
    "updated_time": null,
    "source": "SmartRecruiters:sixt",
    "scraped_at": "2026-01-29T09:15:56.696276",
    "domain": "sixt.com",
    "description": "Du hast (bald)&#xa0;Dein Abitur&#xa0;in der Tasche und interessierst Dich für Daten, Analysen und Programmierung? Du willst direkt in die Praxis einsteigen und gleichzeitig ein Studium absolvieren?&#xa0;Dann starte dein duales Studium&#xa0;Data Science&#xa0;bei SIXT in Kooperation mit der DHBW Stuttgart.&#xa0;\nBei SIXT&#xa0;wirst Du vom ersten Tag an Teil unseres&#xa0;internationalen Unternehmens.&#xa0;Du erhältst Einblicke in alle zentralen Bereiche rund um das Thema Data Science&#xa0;und lernst praxisnah&#xa0;wie Du im Team datengetriebene Lösungen entwickelst und so aktiv zur digitalen Transformation unseres Unternehmens beiträgst.&#xa0;\nDabei kombinierst Du Theorie und Praxis auf ideale Weise und legst damit den Grundstein für Deine Karriere im&#xa0;Data Science. Klingt interessant? Dann bewirb Dich jetzt!&#xa0;\nHinweis: Bitte füge Deiner Bewerbung Dein Schulabschlusszeugnis bzw. eine aktuelle Notenübersicht bei.&#xa0;\nStartdatum: 01.09.2026\nDEIN DUALES STUDIUM&#xa0;\nDu absolvierst Dein duales Studium mit Theoriephasen an der DHBW Stuttgart und Praxisphasen bei SIXT am Campus bei München in einem Blockmodell (jeweils 3 Monate)&#xa0;\nDu kombinierst fundierte&#xa0;BWL-Kenntnisse&#xa0;(z. B. Business Administration, Economics,&#xa0;Finanzierung und Rechnungswesen,&#xa0;Recht)&#xa0;mit&#xa0;spezifischen&#xa0;Kenntnissen&#xa0;innerhalb&#xa0;Wirtschaftsinformatik&#xa0;&#xa0;\nDu erwirbst praxisnahes Wissen in&#xa0;Wirtschaft und Data Management&#xa0;und vertiefst zugleich&#xa0;deine Kenntnisse in der&#xa0;Programmierung, Datenbanken und&#xa0;künstliche Intelligenz und Big Data&#xa0;\nDu arbeitest bei SIXT aktiv&#xa0;an&#xa0;spannenden&#xa0;Projekten&#xa0;mit und erhältst Einblicke in verschiedene Geschäftsbereiche&#xa0;\nDu hast die Möglichkeit, eine&#xa0;Praxisphase im Ausland&#xa0;an einem internationalen SIXT-Standort zu absolvieren&#xa0;\nDu wirst durch&#xa0;Mentoring und Trainings&#xa0;individuell gefördert&#xa0;\nDEINE SPEZIALISIERUNG&#xa0;\nIn Deinem Studium kannst d...",
    "salary": null,
    "job_type": null,
    "department": "TECH & Engineering"
  },
  {
    "id": "744000106245685",
    "title": "Duales Studium Data Science – in Kooperation mit der DHBW Stuttgart",
    "company": "Sixt",
    "url": "https://jobs.smartrecruiters.com/sixt/744000106245685",
    "location": "Stuttgart, de",
    "city": "Stuttgart",
    "country": "de",
    "posted_date": "2026-01-29T08:25:41.476Z",
    "updated_time": null,
    "source": "SmartRecruiters:sixt",
    "scraped_at": "2026-01-29T09:15:56.029049",
    "domain": "sixt.com",
    "description": "Du hast (bald)&#xa0;Dein Abitur&#xa0;in der Tasche und interessierst Dich für Daten, Analysen und Programmierung? Du willst direkt in die Praxis einsteigen und gleichzeitig ein Studium absolvieren?&#xa0;Dann starte dein duales Studium&#xa0;Data Science&#xa0;bei SIXT in Kooperation mit der DHBW Stuttgart.&#xa0;\nBei SIXT&#xa0;wirst Du vom ersten Tag an Teil unseres&#xa0;internationalen Unternehmens.&#xa0;Du erhältst Einblicke in alle zentralen Bereiche rund um das Thema Data Science&#xa0;und lernst praxisnah&#xa0;wie Du im Team datengetriebene Lösungen entwickelst und so aktiv zur digitalen Transformation unseres Unternehmens beiträgst.&#xa0;\nDabei kombinierst Du Theorie und Praxis auf ideale Weise und legst damit den Grundstein für Deine Karriere im&#xa0;Data Science. Klingt interessant? Dann bewirb Dich jetzt!&#xa0;\nHinweis: Bitte füge Deiner Bewerbung Dein Schulabschlusszeugnis bzw. eine aktuelle Notenübersicht bei.&#xa0;\nStartdatum: 01.09.2026\nDEIN DUALES STUDIUM&#xa0;\nDu absolvierst Dein duales Studium mit Theoriephasen an der DHBW Stuttgart und Praxisphasen bei SIXT am Campus bei München in einem Blockmodell (jeweils 3 Monate)&#xa0;\nDu kombinierst fundierte&#xa0;BWL-Kenntnisse&#xa0;(z. B. Business Administration, Economics,&#xa0;Finanzierung und Rechnungswesen,&#xa0;Recht)&#xa0;mit&#xa0;spezifischen&#xa0;Kenntnissen&#xa0;innerhalb&#xa0;Wirtschaftsinformatik&#xa0;&#xa0;\nDu erwirbst praxisnahes Wissen in&#xa0;Wirtschaft und Data Management&#xa0;und vertiefst zugleich&#xa0;deine Kenntnisse in der&#xa0;Programmierung, Datenbanken und&#xa0;künstliche Intelligenz und Big Data&#xa0;\nDu arbeitest bei SIXT aktiv&#xa0;an&#xa0;spannenden&#xa0;Projekten&#xa0;mit und erhältst Einblicke in verschiedene Geschäftsbereiche&#xa0;\nDu hast die Möglichkeit, eine&#xa0;Praxisphase im Ausland&#xa0;an einem internationalen SIXT-Standort zu absolvieren&#xa0;\nDu wirst durch&#xa0;Mentoring und Trainings&#xa0;individuell gefördert&#xa0;\nDEINE SPEZIALISIERUNG&#xa0;\nIn Deinem Studium kannst d...",
    "salary": null,
    "job_type": null,
    "department": "TECH & Engineering"
  },
  {
    "id": "8364210002",
    "title": "(Senior) Data Engineer",
    "company": "SumUp",
    "url": "https://sumup.com/careers/positions/8364210002?gh_jid=8364210002",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-19T10:58:35-05:00",
    "source": "Greenhouse:sumup",
    "scraped_at": "2026-01-28T19:56:59.964721",
    "domain": "sumup.com",
    "description": "As part of the Platform tribe, you will help build a self-service, AI-Ready Data Platform. The Data Platform team supports our next big bets: Data, AI, and real-time analytics. We are a team focused on building scalable, reliable infrastructure to enable our global data community.\n\nWhat you’ll do\n\nBuild and maintain a best-in-class data infrastructure to support critical processes\n\nDevelop features to improve platform self-service capabilities, including ETL and orchestration\n\nOptimize processes to improve compute resource efficiency and reduce costs\n\nImplement automations to ensure our infrastructure remains highly available 24/7\n\nContribute to the design and implementation of new services within our platform\n\nYou’ll be great for this role if\n\nYou have 3+ years of experience with a modern data stack, including DBT, Airflow, and Snowflake.\n\nYou are proficient in Software Engineering using Python or GoLang.\n\nYou have experience building and maintaining performant API layers.\n\nYou possess a pragmatic mindset and a \"team-first\" attitude.\n\nYou are self-motivated and able to work independently while managing stakeholder needs.\n\nAbout SumUp&nbsp;\n\nWe believe in the everyday hero. Small business owners are at the heart of all we do, so we're creating tools that help them run their businesses. With a founder’s mentality and a 'team-first’ attitude, our diverse teams across Europe, South America, and the United States work together to ensure that the small business owners we partner with can be successful doing what they love. SumUp is an Equal Employment Opportunity employer that proudly pursues and hires a diverse workforce. SumUp does not make hiring or employment decisions on the basis of race, colour, religion or religious belief, ethnic or national origin, nationality, sex, gender, gender identity, sexual orientation, disability, age or any other basis protected by applicable laws or prohibited by company policy. SumUp also strives for a healthy and safe workplace and ...",
    "salary": null,
    "job_type": null,
    "department": "Data Engineer/Scientist"
  },
  {
    "id": "7454717",
    "title": "Senior Data Scientist (all genders)",
    "company": "HelloFresh",
    "url": "https://careers.hellofresh.com/global/en/job/7454717?gh_jid=7454717",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-20T06:55:20-05:00",
    "source": "Greenhouse:hellofresh",
    "scraped_at": "2026-01-27T20:28:16.539542",
    "domain": "hellofresh.com",
    "description": "The role\n\nAs a Senior Data Scientist in our Global Consumer Alliance, you will be at the forefront of creating the right ecosystem at HelloFresh so that we are truly customer centric in everything we do. Our Global Customer Experience (GCX) team’s mission is to understand our customers’ journeys and empower market leads with insights and intelligent solutions that improve satisfaction, retention, and efficiency. We build scalable models and GenAI systems that turn unstructured feedback into actionable sentiment insights, personalize compensation to balance cost with loyalty, and enhance every customer interaction — from self-serve automation to agent-led support.\n\nWe are looking for a Senior Data Scientist with experience in translating complex customer and behavioral data into measurable business impact — skilled in predictive modeling, NLP or GenAI, and passionate about using data to shape meaningful customer experiences. If you enjoy working with diverse data sources, solving open-ended problems, and driving tangible improvements for millions of customers, this could be the perfect role for you — and you might just be our missing ingredient.\n\nAbove all, we are looking for people who will make HelloFresh better. We believe there are many different ways of developing skills and we love diverse experiences! So even if you don’t “tick all the boxes” but think you’d thrive in this role, we would really like to learn more about you.\n\nWhat you’ll do\n\nPartner with data scientists and other engineers in a cross-functional team.\n\nDesign, implement, and deploy full-stack scalable machine learning models with a focus on maintainability, observability, scalability and stability.\n\nMaintain high-quality, version-controlled code repositories for the various working environments and products.\n\nConduct code and model reviews of peers, providing actionable feedback to ensure a high quality of standard\n\nDrive day-to-day operations for our complex, ambiguous and large scale AI/ML pro...",
    "salary": null,
    "job_type": null,
    "department": "Insights & Experience"
  },
  {
    "id": "4766708101",
    "title": "AI Research Engineer - Foundation Models",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4766708101?gh_jid=4766708101",
    "location": "Berlin; London; Munich; Paris",
    "city": "Berlin; London; Munich; Paris",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-12T04:50:24-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-27T09:10:03.612396",
    "domain": "helsing.ai",
    "description": "Who we are\n\nHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.&nbsp;\n\nAs democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.&nbsp;\n\nWe are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers.&nbsp;We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.&nbsp;\n\nThe role\n\nAt Helsing, we are redefining perception by building foundational intelligence for the physical world. You will research, design, and train large-scale Foundational Models that transform complex multimodal sensor data into cutting-edge autonomous capabilities.\n\nWe are seeking an individual at the intersection of AI Research and Machine Learning Engineering, with a proven track record in LLM/VLM/(multimodal) backbones. Your primary focus will be training and fine-tuning Vision-Language Models on our custom datasets to power our different products. You'll be responsible for the entire model lifecycle, from data curation and training to evaluation.\n\nYou should apply if you\n\nHold an MSc or PhD in Machine Learning, Computer Science, or Mathematics with a focus on Deep Learning.\n\nPossess theoretical understanding and practical experience in training Foundational Models (LLMs, VLMs, or other large-scale multimodal models) from scratch or through fine-tuning.\n\nHave strong software engineering skills in Python and fluency with modern DL frameworks (PyTorch/JAX). You don’t just import libraries; you are comfortable writing custom l...",
    "salary": null,
    "job_type": null,
    "department": "AI & Engineering"
  },
  {
    "id": "744000105609775",
    "title": "Project Manager Fulfillment-Services (m/w/d)",
    "company": "AboutYou",
    "url": "https://jobs.smartrecruiters.com/aboutyougmbh/744000105609775",
    "location": "Hamburg, de",
    "city": "Hamburg",
    "country": "de",
    "posted_date": "2026-01-26T11:32:36.048Z",
    "updated_time": null,
    "source": "SmartRecruiters:aboutyougmbh",
    "scraped_at": "2026-01-26T12:34:47.786262",
    "domain": "aboutyou.com",
    "description": null,
    "salary": null,
    "job_type": null,
    "department": "BUSINESS Standard"
  },
  {
    "id": "744000069977377",
    "title": "Senior Data Scientist – Operations Research (m/f/d) ",
    "company": "Sixt",
    "url": "https://jobs.smartrecruiters.com/sixt/744000069977377",
    "location": "Munich, de",
    "city": "Munich",
    "country": "de",
    "posted_date": "2025-07-11T06:47:49.351Z",
    "updated_time": null,
    "source": "SmartRecruiters:sixt",
    "scraped_at": "2026-01-23T20:56:05.090025",
    "domain": "sixt.com",
    "description": "Join our team of data science and machine learning experts to shape next-generation pricing strategies! We combine cutting-edge techniques - like price elasticity modeling, bid price strategies, and advanced ML - to optimize pricing decisions for millions of customers. Our work directly drives efficient revenue management processes and enhances the user experience.\nWe’re looking for a Senior Data Scientist – Operations Research&#xa0;(m/f/d) with deep revenue management expertise and a solid background in mathematical optimization. Ideal candidates have hands-on experience in dynamic pricing, bid price optimization, and have worked in (or closely with) the airline or car rental industry. Join us in Pullach near Munich!\nYOUR ROLE AT SIXT\nRevenue Management & Price Optimization: You design, develop, and deploy advanced revenue management systems focusing on dynamic pricing and bid price optimization strategies\nOperations Research Modeling: You formulate and solve complex optimization problems (linear, nonlinear, dynamic, stochastic) to maximize revenue and support key decision-making processes\nDemand Forecasting & Customer Willingness-to-Pay: You create and refine forecasting models using time series and machine learning methods to capture customer demand and willingness-to-pay\nAlgorithm & Tool Development: You build and maintain robust algorithms that integrate seamlessly with production systems, ensuring efficiency and scalability\nCross-Functional Collaboration: You work closely with product managers, data engineers, and software developers to deploy end-to-end solutions and continuously improve analytical models\nThought Leadership: You stay current on the latest research in revenue management, operations research, and machine learning; and you provide mentorship and guidance to junior team members\nYOUR SKILLS MATTER\nIndustry Experience: You have 1+ year&#xa0;experience&#xa0;in data science and operations research roles, ideally in car rental, airlines, or similar tr...",
    "salary": null,
    "job_type": null,
    "department": "TECH & Engineering"
  },
  {
    "id": "744000102550261",
    "title": "Senior Data Scientist Workforce Optimization (m/f/d)",
    "company": "Sixt",
    "url": "https://jobs.smartrecruiters.com/sixt/744000102550261",
    "location": "Munich, de",
    "city": "Munich",
    "country": "de",
    "posted_date": "2026-01-09T10:39:10.788Z",
    "updated_time": null,
    "source": "SmartRecruiters:sixt",
    "scraped_at": "2026-01-23T20:56:04.391702",
    "domain": "sixt.com",
    "description": "Join our Data Science team and make the magic happen. We drive business processes like capacity planning and many more with the use of sophisticated algorithms. For this purpose, we design, develop, and maintain state-of-the-art machine learning models and manifold optimization solvers as well as simulation models. Are you ready to join a team where your work will enhance the experience of millions of our customers and have a direct impact on our business success? Apply now and join our journey in Pullach near Munich.\nYOUR ROLE AT SIXT\n&#xa0;\nYou engage with technical and business stakeholders to translate business problems into technical solutions\nYou design, develop, refine and test data science solutions focusing on time series predictions, capacity optimizations and time models\nYou understand operational dynamics and can build models that balance service levels with resource efficiency across both tactical (weeks to months) and strategic (quarterly to annual) planning horizons\nYou stay updated on the latest research in forecasting techniques and optimizations but are not afraid to use classical or greedy solutions when relevant\nYou work closely with business stakeholders, MLOps engineers, and software developers to deploy end-to-end solutions and continuously improve models\n&#xa0;\nYOUR SKILLS MATTER\n&#xa0;\nWorkforce Management and Optimization&#xa0;You have experience in resource planning, scheduling, and capacity optimization (e.g., constraint programming, linear/integer programming, heuristic optimization methods)\nMachine Learning & Forecasting You are proficient in modern ML techniques (time series forecasting, regression, optimization algorithms and reinforcement learning)\nProduct & Strategy Insight You combine analytical depth with business acumen, contributing to product strategy, shaping roadmaps, and ensuring that data science solutions directly influence decision-making and long-term business outcomes\nAnalytical Mindset You show the ability to translate...",
    "salary": null,
    "job_type": null,
    "department": "TECH & Engineering"
  },
  {
    "id": "744000104684846",
    "title": "Machine Learning Engineering Manager (m/f/d) ",
    "company": "Sixt",
    "url": "https://jobs.smartrecruiters.com/sixt/744000104684846",
    "location": "Munich, de",
    "city": "Munich",
    "country": "de",
    "posted_date": "2026-01-21T13:13:37.923Z",
    "updated_time": null,
    "source": "SmartRecruiters:sixt",
    "scraped_at": "2026-01-23T20:56:02.415570",
    "domain": "sixt.com",
    "description": "Our vision is: Transform the world&#xa0;moves, because&#xa0;people expect better.&#xa0;Join our Data Science&#xa0;organization&#xa0;and make the magic happen. We drive business processes like pricing and many more with the use of sophisticated algorithms&#xa0;and building&#xa0;highly scaling algorithms. Apply now and&#xa0;be part of&#xa0;our journey.&#xa0;\nYOUR ROLE AT SIXT\n\nYou will lead and scale our Machine Learning Engineering team that partners with data scientists to transform models into production-grade ML applications on our central MLOps platform&#xa0;\n\nYou will shape ML Engineering standards by establishing best practices, design patterns, and quality benchmarks that enable data scientists to build scalable, maintainable ML solutions&#xa0;\n\nYou will drive technical strategy and architecture across data science, MLOps, and engineering teams, ensuring alignment with business objectives and communicating system designs to tech leadership&#xa0;\n\nYou will bridge platform and practice by translating MLOps platform capabilities into practical guidance for data science teams, while channeling ML engineering requirements back to the MLOps platform team&#xa0;\n\nYou will foster collaboration and excellence by building strong relationships across cross-functional teams, mentoring engineers, and creating a culture of innovation and continuous improvement&#xa0;\nYOUR SKILLS MATTER\n\nProven leadership experience with 3+ years managing machine learning or software engineering teams, ideally across multiple locations, with a track record of building high-performing teams&#xa0;\n\nStrategic technical vision with experience leading complex, multi-stakeholder ML/data science initiatives from concept to production&#xa0;\n\nDeep ML and cloud expertise including hands-on experience with machine learning frameworks, MLOps practices, and AWS cloud services &#xa0;\n\nProduction ML deployment experience with real-world examples of deploying and maintaining large-scale ML systems in producti...",
    "salary": null,
    "job_type": null,
    "department": "TECH & Engineering"
  },
  {
    "id": "744000094613685",
    "title": "Senior Data Analyst (m/f/d) - Shop Analytics - onsite in Hamburg",
    "company": "AboutYou",
    "url": "https://jobs.smartrecruiters.com/aboutyougmbh/744000094613685",
    "location": "Hamburg, de",
    "city": "Hamburg",
    "country": "de",
    "posted_date": "2025-11-20T13:20:54.219Z",
    "updated_time": null,
    "source": "SmartRecruiters:aboutyougmbh",
    "scraped_at": "2026-01-23T20:55:58.553051",
    "domain": "aboutyou.com",
    "description": "Join our&#xa0;Shop Analytics Team&#xa0;within the Customer & Shop Intelligence cluster and directly impact millions of fashion shoppers' experiences. You'll analyze complex e-commerce data to drive product decisions, optimize conversion funnels, and power personalization features that keep users engaged.\nWorking closely with Product Owners and cross-functional teams, you'll provide full-cycle A/B test analytical support, create tracking concepts, and translate user behavior and shop performance insights into actionable business recommendations.\n&#xa0;\nWhat you will do\nConduct in-depth analyses on shop user behavior to uncover actionable insights\nDrive shop optimization and growth by providing analytical insights to Business and Product Owners and influencing product enhancements\nShape the success metrics for our shop, developing and monitoring KPIs that directly impact millions of users' shopping experiences\nProvide full-cycle A/B test analytical support to optimize shop performance\nDefine tracking requirements and support QA of tracking implementations to ensure data accuracy and reliability\nDesign and implement advanced dashboards, enabling self-service analytics across the organization\nCollaborate with multiple stakeholders across the organization to answer shop-related questions with analytical insights, supporting business decision-making\n&#xa0;\nWho you are\nAdvanced proficiency in SQL for complex data analysis and querying large datasets\nExpertise in e-commerce KPIs and funnel analysis\nSolid understanding of web analytics and experience working with frontend tracking data (GA4 experience is a plus)\nExperience with data visualization tools (e.g., Looker Studio, Tableau, or similar) to create compelling dashboards and reports\nAdvanced knowledge of A/B testing methodology and statistical analysis for experiment design and interpretation\nStrong understanding of customer segmentation and cohort analysis in the&#xa0; e-commerce context\nProactive and self-driven, with...",
    "salary": null,
    "job_type": null,
    "department": "TECH Standard"
  },
  {
    "id": "744000097993562",
    "title": "Senior Financial Data Analyst (m/f/d)",
    "company": "AboutYou",
    "url": "https://jobs.smartrecruiters.com/aboutyougmbh/744000097993562",
    "location": "Hamburg, de",
    "city": "Hamburg",
    "country": "de",
    "posted_date": "2025-12-10T09:23:52.632Z",
    "updated_time": null,
    "source": "SmartRecruiters:aboutyougmbh",
    "scraped_at": "2026-01-23T20:55:57.939063",
    "domain": "aboutyou.com",
    "description": "Our Financial Data and Automation Team drives the digital transformation of ABOUT YOU's Finance organization, collaborating closely with diverse teams across the company. They go beyond reporting and automation, unlocking value from Germany’s first e-commerce unicorn's extensive data ecosystem - spanning over €1.9 billion in group revenue, 4,000+ brands, and multiple revenue streams.\n\nAs a Senior Financial Data Analyst (m/f/d), you will play a key role in shaping our data and reporting landscape. You transform complex financial and operational data into actionable insights and enable data-driven decision-making across the organization.\nResponsibilities\nDevelop robust data models based on financial and operational data to enable complex analyses for our Finance teams\nConduct advanced quantitative analyses of large, multi-source data sets, aligning operational and transactional accounting data with financial reporting standards\nLead end-to-end data-driven financial reporting projects using descriptive, diagnostic, and predictive analytics to deliver actionable insights to stakeholders\nPerform advanced exploratory data analysis (EDA) and data modeling to uncover underlying structures and relationships in the data - even in the absence of explicit business context\nAct as a trusted partner and thought leader on data and finance topics\nDesign and implement interactive dashboards in Google BigQuery and Looker Studio\nRequirements\nUniversity degree in Business Informatics, Finance, Economics, Business Administration, or a related field\nSeveral years of professional experience in Data Analytics, ideally with a financial focus\nStrong proficiency in data modeling and exploratory analysis using SQL and Python\nProven ability to interpret complex data, identify root causes, and communicate findings clearly to both technical and non-technical audiences\nHigh analytical capability, curiosity, and attention to detail\nProactive, solution-oriented mindset with a strong sense of ownershi...",
    "salary": null,
    "job_type": null,
    "department": "BUSINESS Standard"
  },
  {
    "id": "744000104913221",
    "title": "(Senior) Data Engineer (m/f/d) - Finance Tech",
    "company": "AboutYou",
    "url": "https://jobs.smartrecruiters.com/aboutyougmbh/744000104913221",
    "location": "Hamburg, de",
    "city": "Hamburg",
    "country": "de",
    "posted_date": "2026-01-22T12:54:48.349Z",
    "updated_time": null,
    "source": "SmartRecruiters:aboutyougmbh",
    "scraped_at": "2026-01-23T20:55:56.742994",
    "domain": "aboutyou.com",
    "description": "Our online fashion store ABOUT YOU is one of the fastest growing eCommerce players in Europe and has already won several awards. As a fashion and technology company, we work together towards our goal of making the shopping experience more inspiring and personal for our customers.\nWe are currently looking for a skilled & passionate Data Engineer (m/f/d)&#xa0;to join our Commerce Finance Tech Circle Cluster at ABOUT YOU!&#xa0;Our ABOUT YOU Commerce Finance Tech Circle Cluster is responsible for connecting to the ABOUT YOU Commerce ERP solution to ensure the regulatory compliance of our commerce business.&#xa0;Furthermore, the team is responsible for building an ETL platform used by other stakeholders and the team itself, such as for generating financial reports.\n&#xa0;\nWhat you will do\nDevelopment and evaluation of statistical models and algorithms for complex marketing issues\nIndependent analysis of complex data with the aim of identifying new insights and potential for performance optimization\nIdentifying direct and indirect correlations between relevant key figures and deriving recommendations for action\nLinking and using the content of data from tracking systems and other reporting sources\nSupport in the further development and testing of performance-relevant (attribution) models\nInitiation and further development of prediction and classification models using machine learning algorithms\n&#xa0;\nWho you are\nYou bring at least two years of hands-on experience in Data Science, ideally in an agency, e-commerce, or performance-driven environment\nYou have initial experience with machine learning algorithms and a solid understanding of common data analysis methods such as regression and clustering; knowledge of marketing attribution models is a strong plus\nYou are proficient in SQL and either Python or R (both are a bonus)\nExperience with Dagster or comparable data orchestration tools is highly appreciated\nYou are naturally curious, enjoy exploring new topics, statistical...",
    "salary": null,
    "job_type": null,
    "department": "TECH Standard"
  },
  {
    "id": "744000104916210",
    "title": "Staff Data Engineer (m/f/d) - Finance Tech",
    "company": "AboutYou",
    "url": "https://jobs.smartrecruiters.com/aboutyougmbh/744000104916210",
    "location": "Hamburg, de",
    "city": "Hamburg",
    "country": "de",
    "posted_date": "2026-01-22T12:59:53.855Z",
    "updated_time": null,
    "source": "SmartRecruiters:aboutyougmbh",
    "scraped_at": "2026-01-23T20:55:56.022739",
    "domain": "aboutyou.com",
    "description": "Our online fashion store ABOUT YOU is one of the fastest growing eCommerce players in Europe and has already won several awards. As a fashion and technology company, we work together towards our goal of making the shopping experience more inspiring and personal for our customers.\nWe are currently looking for a skilled & passionate Data Engineer (m/f/d)&#xa0;to join our Commerce Finance Tech Circle Cluster at ABOUT YOU!&#xa0;Our ABOUT YOU Commerce Finance Tech Circle Cluster is responsible for connecting to the ABOUT YOU Commerce ERP solution to ensure the regulatory compliance of our commerce business.&#xa0;Furthermore, the team is responsible for building an ETL platform used by other stakeholders and the team itself, such as for generating financial reports.\n&#xa0;\nWhat you will do\nDevelopment and evaluation of statistical models and algorithms for complex marketing issues\nIndependent analysis of complex data with the aim of identifying new insights and potential for performance optimization\nIdentifying direct and indirect correlations between relevant key figures and deriving recommendations for action\nLinking and using the content of data from tracking systems and other reporting sources\nSupport in the further development and testing of performance-relevant (attribution) models\nInitiation and further development of prediction and classification models using machine learning algorithms\n&#xa0;\nWho you are\nYou bring at least seven years of hands-on experience in Data Science, ideally in an agency, e-commerce, or performance-driven environment\nYou have initial experience with machine learning algorithms and a solid understanding of common data analysis methods such as regression and clustering; knowledge of marketing attribution models is a strong plus\nYou are proficient in SQL and either Python or R (both are a bonus)\nExperience with Dagster or comparable data orchestration tools is highly appreciated\nYou are naturally curious, enjoy exploring new topics, statistic...",
    "salary": null,
    "job_type": null,
    "department": "TECH Standard"
  },
  {
    "id": "7385709",
    "title": "Data Engineer (Java/Scala)",
    "company": "GetYourGuide",
    "url": "https://getyourguide.careers/jobs/7385709?gh_jid=7385709",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-18T09:49:51-05:00",
    "source": "Greenhouse:getyourguide",
    "scraped_at": "2026-01-23T20:55:30.796919",
    "domain": "getyourguide.com",
    "description": "Change the way the world travels\n\nJoin the GetYourGuide journey to connect people with unforgettable travel experiences around the world. Millions look to us for unique activities they can trust, and it’s all powered by our commitment to make every single journey extraordinary - including yours.&nbsp;\n\nReady to unlock your potential with a community of fellow explorers? Find your next role at our Berlin HQ or one of our local offices around the globe, from New York to Bangkok. Head to&nbsp;getyourguide.careers to take the first step.\n\nGetYourGuide is the place to book the best experiences in destinations across the globe. We are now seeking a full-time Data Engineer for the Core Data Platform at our Berlin office.\n\nTeam mission\n\nThe Core Data Platform team is at the heart of GetYourGuide’s data landscape, empowering the entire engineering department and enabling data-driven innovation across the company. We architect, build, and operate the foundational data platform that powers everything from AB experimentation and AI-powered use cases to advanced analytics and business intelligence.\n\nOur platform processes over 600 million events daily and manages multiple petabytes of data, while ensuring that the data is accessible, reliable, and efficient to query for all teams. We provide robust, scalable solutions for real-time clickstream ingestion, cost-efficient data lake management, and seamless ETL pipeline development—making it easy for analysts, BI engineers, and developers to work with data at scale.\n\nWe work with a modern tech stack, including Apache Airflow, DBT, Databricks, Kafka, and Spark, while fostering a culture of learning and collaboration. Joining our team means tackling complex technical challenges, driving impact across GetYourGuide, and continuously growing your skills in a supportive environment.\n\nYour mission\n\nDesign, build, and evolve our core data and analytics platform, enabling seamless scaling to multiple petabytes of data.\n\nOptimize and enhance ...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "6301453003",
    "title": "Senior Software Engineer - Python/AI/ML Infrastructure",
    "company": "Celonis",
    "url": "https://job-boards.greenhouse.io/celonis/jobs/6301453003?gh_jid=6301453003",
    "location": "Munich, Germany",
    "city": "Munich",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-10T14:11:52-05:00",
    "source": "Greenhouse:celonis",
    "scraped_at": "2026-01-23T20:55:30.438372",
    "domain": "celonis.com",
    "description": "We're Celonis, the global leader in Process Intelligence technology and one of the world's fastest-growing SaaS firms. We believe there is a massive opportunity to unlock productivity by placing AI, data and intelligence at the core of business processes - and for that, we need your help. Care to join us?\nThe Team\n\nCelonis AI Group (CeloAI) is dedicated to developing state-of-the-art AI/ML technologies for Celonis products and empower enterprises and institutions to make intelligent business decisions and achieve operational excellence. Our dual mission focuses on both the immediate term goals of designing and implementing advanced AI/ML product features and solutions for our customers and the long term goals of establishing competitive advantages of Celonis Process Intelligence platform.\n\nWe are a global organization with presence in both Germany and the US. CeloAI Germany has its presence in Munich, Darmstadt, and Aachen.\n\nThe Role\n\nAs a Senior Software Engineer on the AI/ML Infrastructure team, you will play a key role in designing, developing, and deploying the infrastructure that supports our AI/ML/LLM initiatives. You will collaborate with software engineers, machine learning engineers, and platform infrastructure engineers to deliver scalable and high-quality solutions.\n\nYou will be responsible for architecting and implementing robust technical components that drive the next generation of Process Intelligence. These components will leverage technologies such as computer vision, natural language processing, data mining, recommendation systems, knowledge bases, and business intelligence.\n\nThe work you’ll do\n\nUnderstand and translate business and technical requirements into effective solutions.\n\nDesign and develop highly scalable and performant systems.\n\nBuild and maintain low-latency infrastructure for serving AI/ML/LLM models.\n\nDevelop intelligent techniques for integrating and processing large-scale enterprise operational data.\n\nCreate and maintain APIs, libr...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "7189283",
    "title": " Machine Learning Engineer",
    "company": "Free Now",
    "url": "https://job-boards.greenhouse.io/freenow/jobs/7189283",
    "location": "Hamburg",
    "city": "Hamburg",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-19T05:42:30-05:00",
    "source": "Greenhouse:freenow",
    "scraped_at": "2026-01-23T20:55:30.184778",
    "domain": "free-now.com",
    "description": "Location: We are flexible! Come and join us either in Hamburg, Berlin, Barcelona or Athens.&nbsp;\n\nFreenow empowers smarter mobility decisions helping people to move freely and cities to thrive.\n\nThe Freenow marketplace is a real-time, two-sided platform connecting millions of riders and drivers. Its efficiency and scalability are powered by a sophisticated ecosystem of Machine Learning systems spanning key domains such as Pricing, Allocation, and Marketplace Payment&amp;Risk.\n\nIn this role, you’ll help advance our MLOps practices, build the services and the infrastructure that scales ML models from research to real-time production and observe how they impact the daily lives of our users and our business.\n\nBe ready to work in a multinational, diverse, highly motivated and collaborative team of passionate developers who strive for excellence and like to have fun doing it.&nbsp; Are you ready for your next ride?\n\nYOUR DAILY ADVENTURES WILL INCLUDE:\n\nDeveloping and maintaining high-performance, distributed systems that serve ML models at scale with low latency\n\nCollaborating with Data scientists and Software Engineers to solve business-critical problems in real-time.\n\nStreamlining online serving for classical and deep learning models to accelerate A/B testing cycles and reduce time-to-market\n\nEnhancing our MLOps platform capabilities to support AI state of the art\n\nImplementing ML Monitoring and Observability best practices, including automated data drift detection and self-healing system triggers\n\nContributing to the evolution of our MLOps stack and practices.\n\nOur Techstack: Python | Airflow | Java | Kubernetes | Kafka | Databricks |AWS &amp; more\n\nTO BE SUCCESSFUL IN THIS ROLE:\n\nM.S or B.S in Computer Science, Machine Learning, Mathematics or equivalent technical background with related field\n\n3+ years of professional experience deploying, scaling and monitoring ML models in production environment&nbsp;\n\nProficiency in Python. Experience in JVM based programming lan...",
    "salary": null,
    "job_type": null,
    "department": "Tech"
  },
  {
    "id": "7391030",
    "title": "Machine Learning Engineer",
    "company": "Free Now",
    "url": "https://job-boards.greenhouse.io/freenow/jobs/7391030",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-19T05:43:52-05:00",
    "source": "Greenhouse:freenow",
    "scraped_at": "2026-01-23T20:55:30.184547",
    "domain": "free-now.com",
    "description": "Location: We are flexible! Come and join us either in Hamburg, Berlin, Barcelona or Athens.&nbsp;\n\nFreenow empowers smarter mobility decisions helping people to move freely and cities to thrive.\n\nThe Freenow marketplace is a real-time, two-sided platform connecting millions of riders and drivers. Its efficiency and scalability are powered by a sophisticated ecosystem of Machine Learning systems spanning key domains such as Pricing, Allocation, and Marketplace Payment&amp;Risk.\n\nIn this role, you’ll help advance our MLOps practices, build the services and the infrastructure that scales ML models from research to real-time production and observe how they impact the daily lives of our users and our business.\n\nBe ready to work in a multinational, diverse, highly motivated and collaborative team of passionate developers who strive for excellence and like to have fun doing it.&nbsp; Are you ready for your next ride?\n\nYOUR DAILY ADVENTURES WILL INCLUDE:\n\nDeveloping and maintaining high-performance, distributed systems that serve ML models at scale with low latency\n\nCollaborating with Data scientists and Software Engineers to solve business-critical problems in real-time.\n\nStreamlining online serving for classical and deep learning models to accelerate A/B testing cycles and reduce time-to-market\n\nEnhancing our MLOps platform capabilities to support AI state of the art\n\nImplementing ML Monitoring and Observability best practices, including automated data drift detection and self-healing system triggers\n\nContributing to the evolution of our MLOps stack and practices.\n\nOur Techstack: Python | Airflow | Java | Kubernetes | Kafka | Databricks |AWS &amp; more\n\nTO BE SUCCESSFUL IN THIS ROLE:\n\nM.S or B.S in Computer Science, Machine Learning, Mathematics or equivalent technical background with related field\n\n3+ years of professional experience deploying, scaling and monitoring ML models in production environment&nbsp;\n\nProficiency in Python. Experience in JVM based programming lan...",
    "salary": null,
    "job_type": null,
    "department": "Tech"
  },
  {
    "id": "6920354",
    "title": "Senior Machine Learning Engineer ",
    "company": "Free Now",
    "url": "https://job-boards.greenhouse.io/freenow/jobs/6920354",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-09T09:51:31-05:00",
    "source": "Greenhouse:freenow",
    "scraped_at": "2026-01-23T20:55:30.184295",
    "domain": "free-now.com",
    "description": "Location: We are flexible! Come and join us either in Hamburg, Berlin, Barcelona or Athens\n\nFreenow empowers smarter mobility decisions helping people to move freely and cities to thrive.\n\nThe Freenow marketplace is a real-time, two-sided platform connecting riders and drivers. Its efficiency and scalability are powered by a sophisticated ecosystem of Machine Learning systems spanning key domains such as Pricing, Allocation, and Marketplace Fraud.\n\nIn this role, you’ll help advance the state of the art of our Marketplace MLOps platform, working on impactful use cases that shape not only our business but also the daily experiences of our users.\n\nBe ready to work in a multinational, diverse, highly motivated and collaborative team of passionate developers who strive for excellence and like to have fun.&nbsp; Are you ready for your next ride?\n\nYOUR DAILY ADVENTURES WILL INCLUDE:\n\nDeveloping and maintaining high-performance, data-driven systems in a distributed infrastructure that impact our marketplace performance.\n\nStreamlining online serving of traditional ML enabling faster A/B tests and reducing go-to-market&nbsp;\n\nEnhancing our MLOps platform capabilities to support cutting edge AI algorithms\n\nEstablishing ML Observability best practices enabling Self-healing system and automatic data drift detection\n\nImplementing and optimizing solutions to some of our most business critical problems as part of a cross functional team consisting of Data and Software Engineering professionals.\n\nCollaborating with other Machine Learning Engineers, Data Scientists and Data Platform Engineers to drive the state of MLOps in Marketplace and FreeNow.\n\nOur Tech Stack: Python | Airflow | Java | Kubernetes | Kafka | Databricks | AWS &amp; more\n\nTO BE SUCCESSFUL IN THIS ROLE:\n\nYou are experienced in training, deploying, serving and observing Statistical/Machine Learning models on large-scale datasets in production.\n\nYou have experience developing and maintaining high throughput microservice...",
    "salary": null,
    "job_type": null,
    "department": "Data & Analytics"
  },
  {
    "id": "6886419",
    "title": "Senior Machine Learning Engineer",
    "company": "Free Now",
    "url": "https://job-boards.greenhouse.io/freenow/jobs/6886419",
    "location": "Hamburg",
    "city": "Hamburg",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-09T09:51:31-05:00",
    "source": "Greenhouse:freenow",
    "scraped_at": "2026-01-23T20:55:30.184048",
    "domain": "free-now.com",
    "description": "Location: We are flexible! Come and join us either in Hamburg, Berlin, Barcelona or Athens\n\nFreenow empowers smarter mobility decisions helping people to move freely and cities to thrive.\n\nThe Freenow marketplace is a real-time, two-sided platform connecting riders and drivers. Its efficiency and scalability are powered by a sophisticated ecosystem of Machine Learning systems spanning key domains such as Pricing, Allocation, and Marketplace Fraud.\n\nIn this role, you’ll help advance the state of the art of our Marketplace MLOps platform, working on impactful use cases that shape not only our business but also the daily experiences of our users.\n\nBe ready to work in a multinational, diverse, highly motivated and collaborative team of passionate developers who strive for excellence and like to have fun.&nbsp; Are you ready for your next ride?\n\nYOUR DAILY ADVENTURES WILL INCLUDE:\n\nDeveloping and maintaining high-performance, data-driven systems in a distributed infrastructure that impact our marketplace performance.\n\nStreamlining online serving of traditional ML enabling faster A/B tests and reducing go-to-market&nbsp;\n\nEnhancing our MLOps platform capabilities to support cutting edge AI algorithms\n\nEstablishing ML Observability best practices enabling Self-healing system and automatic data drift detection\n\nImplementing and optimizing solutions to some of our most business critical problems as part of a cross functional team consisting of Data and Software Engineering professionals.\n\nCollaborating with other Machine Learning Engineers, Data Scientists and Data Platform Engineers to drive the state of MLOps in Marketplace and FreeNow.\n\nOur Tech Stack: Python | Airflow | Java | Kubernetes | Kafka | Databricks | AWS &amp; more\n\nTO BE SUCCESSFUL IN THIS ROLE:\n\nYou are experienced in training, deploying, serving and observing Statistical/Machine Learning models on large-scale datasets in production.\n\nYou have experience developing and maintaining high throughput microservice...",
    "salary": null,
    "job_type": null,
    "department": "Data & Analytics"
  },
  {
    "id": "7025714",
    "title": "Product Data Analyst",
    "company": "Free Now",
    "url": "https://job-boards.greenhouse.io/freenow/jobs/7025714",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-09T07:54:21-05:00",
    "source": "Greenhouse:freenow",
    "scraped_at": "2026-01-23T20:55:30.183732",
    "domain": "free-now.com",
    "description": "Location: We are flexible! Come and join us either in Hamburg, Berlin, Barcelona or Athens.&nbsp;\n\nFREENOW empowers smarter mobility decisions helping people to move freely and cities to thrive.\n\nWe are looking for a Product Data Analyst (m/f/d) to collaborate with our product squads, using data to build a flawless product experience. You will join the Product Data Team and work closely with PMs, designers, UX researchers, developers, and other data functions to discover new product opportunities, validate hypotheses, and launch valuable features to our users.\n\nBe ready to work in a multinational, diverse, highly motivated and collaborative team of passionate analysts who strive for excellence and like to have fun.&nbsp; Are you ready for your next ride?\n\nYOUR DAILY ADVENTURES WILL INCLUDE:\n\nProviding&nbsp; expertise and collaborating with stakeholders to generate new product feature ideas and improvements, and also estimating the potential impact of planned projects.\n\nContinuously engaging with the product squads to gain an understanding of the problems that need to be solved, gathering requirements, and defining the best deliverables to match the business needs.\n\nHaving full ownership of your analysis, from ideation to communication of results and making recommendations to all levels of the company including senior management and prioritization committees.\n\nDeveloping and evaluating A/B test experiments or other analyses to measure and report the performance of released features, ensuring that we are launching the correct changes and features in our apps.\n\nWorking closely with our developers and data engineers to create and capture data that is aligned with the business logic and allows modeling and analysis.\n\nBeing involved throughout the complete product lifecycle in order to guarantee a data-driven process.\n\nBringing new insights and championing them using your analyses, dashboards, and good storytelling! We value ideas over hierarchy, and there's always a new ...",
    "salary": null,
    "job_type": null,
    "department": "Data & Analytics"
  },
  {
    "id": "7025691",
    "title": "Product Data Analyst",
    "company": "Free Now",
    "url": "https://job-boards.greenhouse.io/freenow/jobs/7025691",
    "location": "Hamburg ",
    "city": "Hamburg ",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-09T07:54:21-05:00",
    "source": "Greenhouse:freenow",
    "scraped_at": "2026-01-23T20:55:30.183466",
    "domain": "free-now.com",
    "description": "Location: We are flexible! Come and join us either in Hamburg, Berlin, Barcelona or Athens.&nbsp;\n\nFREENOW empowers smarter mobility decisions helping people to move freely and cities to thrive.\n\nWe are looking for a Product Data Analyst (m/f/d) to collaborate with our product squads, using data to build a flawless product experience. You will join the Product Data Team and work closely with PMs, designers, UX researchers, developers, and other data functions to discover new product opportunities, validate hypotheses, and launch valuable features to our users.\n\nBe ready to work in a multinational, diverse, highly motivated and collaborative team of passionate analysts who strive for excellence and like to have fun.&nbsp; Are you ready for your next ride?\n\nYOUR DAILY ADVENTURES WILL INCLUDE:\n\nProviding&nbsp; expertise and collaborating with stakeholders to generate new product feature ideas and improvements, and also estimating the potential impact of planned projects.\n\nContinuously engaging with the product squads to gain an understanding of the problems that need to be solved, gathering requirements, and defining the best deliverables to match the business needs.\n\nHaving full ownership of your analysis, from ideation to communication of results and making recommendations to all levels of the company including senior management and prioritization committees.\n\nDeveloping and evaluating A/B test experiments or other analyses to measure and report the performance of released features, ensuring that we are launching the correct changes and features in our apps.\n\nWorking closely with our developers and data engineers to create and capture data that is aligned with the business logic and allows modeling and analysis.\n\nBeing involved throughout the complete product lifecycle in order to guarantee a data-driven process.\n\nBringing new insights and championing them using your analyses, dashboards, and good storytelling! We value ideas over hierarchy, and there's always a new ...",
    "salary": null,
    "job_type": null,
    "department": "Data & Analytics"
  },
  {
    "id": "8128496002",
    "title": "Senior Machine Learning Engineer I",
    "company": "SumUp",
    "url": "https://sumup.com/careers/positions/8128496002?gh_jid=8128496002",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-19T10:58:35-05:00",
    "source": "Greenhouse:sumup",
    "scraped_at": "2026-01-23T20:55:29.969960",
    "domain": "sumup.com",
    "description": "About the team:\n\nWithin the Global Operations organisation, our mission is to build the best customer experience in the fintech industry by delivering an effortless customer experience to all our merchants. We are seeking a skilled and passionate Machine Learning Engineer to join our talented AI team and contribute to the development of AI models and algorithms that will drive our customer support service to new heights.\n\nAs a Machine Learning Engineer at SumUp, you will be responsible for building and optimizing state-of-the-art AI models and algorithms. Your expertise with machine learning, deep learning, and AI models will be crucial in driving the success of our AI-driven initiatives. You will work closely with cross-functional teams, including backend engineers, data scientists, and product managers, to translate business requirements into innovative AI solutions. Your contributions will shape the future of our support products and help us stay at the forefront of technological advancements in the field of AI.\n\nWhat you’ll do\n\nArchitect, design, develop, and deploy our AI solutions and systems in production environments, ensuring reliability, high performance, and scalability.\n\nCollaborate and communicate closely with data scientists, product managers, developers, and other business stakeholders to bring state-of-the-art AI solutions to Customer Support, enhancing customer experience and improving operational efficiency.\n\nDevelop and maintain ML infrastructure and pipelines to support efficient data processing, model training, and serving.\n\nOptimize and fine-tune machine learning models to improve accuracy, efficiency, and scalability.\n\nCollect, preprocess, and clean large text datasets to ensure high-quality input for model training and evaluation.\n\nEmbrace software development principles, best practices, and industry standards, including version control, CI/CD processes, and unit testing frameworks as your day-to-day work.\n\nCollaborate with cross-functional t...",
    "salary": null,
    "job_type": null,
    "department": "Data Engineer/Scientist"
  },
  {
    "id": "8309766002",
    "title": "Senior Analytics Engineer",
    "company": "SumUp",
    "url": "https://sumup.com/careers/positions/8309766002?gh_jid=8309766002",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-19T10:58:35-05:00",
    "source": "Greenhouse:sumup",
    "scraped_at": "2026-01-23T20:55:29.969581",
    "domain": "sumup.com",
    "description": "At SumUp, we are motivated by the purpose of levelling the playing field for small businesses. We empower small business owners by creating simple and affordable tools to manage payments, finance and customer relationships. We are a passionate team that thrives on human connection, autonomy and the desire to constantly learn, guided by our values&nbsp;Founder’s Mentality,&nbsp;Team First&nbsp;and&nbsp;We Care. We want to build an enduring organisation that is people-positive, disciplined and that constantly innovates from within. Agility is the essence of an enduring organisation and we strive to create an organisation that fosters it.\n\nIn Global Operations, we build the best customer experience in fintech. The Senior Analytics Engineer role is critical for creating the robust, high-quality data foundation that drives efficiency, powers AI-driven automation, and enables data-driven decisions for our merchants and support agents. You will be the expert who builds and maintains the data engine using dbt and Snowflake, ensuring analysts, product managers, and AI systems have trusted, accessible data.\n\nWhat You'll Be Doing\n\nYou will be the dedicated data owner for the Operations Tribe, focused on transforming raw data into reliable, scalable data products.\n\nOwn, develop, and maintain the Operations data structure (DAOPS) using expert-level SQL and dbt within Snowflake, managing over 200 data models and ensuring clear business logic.\n\nManage and optimize data pipeline orchestration (e.g., Airflow), handling critical third-party ingestions (Trustpilot, NICE) and implementing resource/cost optimizations.\n\nDrive self-service analytics by setting up best practices for data governance, quality, and accessibility, creating documentation and marts for stakeholders.\n\nImplement robust data governance, focusing on PII management, access control, and quality checks to ensure report reliability.\n\nProvide the perfectly structured data foundation for new AI tools being developed to au...",
    "salary": null,
    "job_type": null,
    "department": "Data Engineer/Scientist"
  },
  {
    "id": "8249610002",
    "title": "Senior AI/ML Engineer",
    "company": "SumUp",
    "url": "https://sumup.com/careers/positions/8249610002?gh_jid=8249610002",
    "location": "Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-19T10:58:35-05:00",
    "source": "Greenhouse:sumup",
    "scraped_at": "2026-01-23T20:55:29.968839",
    "domain": "sumup.com",
    "description": "At SumUp, we are motivated by the purpose of levelling the playing field for small businesses. We empower small business owners by creating simple and affordable tools to manage payments, finance and customer relationships. We are a passionate team that thrives on human connection, autonomy and the desire to constantly learn, guided by our values: Founder’s Mentality, Team First, and We Care. We want to build an enduring organisation that is people-positive, disciplined and that constantly innovates from within. Agility is the essence of an enduring organisation and we strive to create an organisation that fosters it.\n\nIn Global Operations, we build the best customer experience in fintech. The Senior AI/ML Engineer role is critical for developing and deploying the next generation of AI-driven solutions that automate support and drastically improve the experience for both our merchants and support agents. You will be a key expert who builds and maintains the ML infrastructure and tooling that powers our core products using advanced AI/ML models. This role is a replacement, essential for maintaining momentum as we expand complex use cases like our AI Assistant and translation tools.\n\nWhat You'll Be Doing\n\nYou will be the dedicated technical leader for the Operations AI team, focused on designing, developing, and deploying high-performance, scalable ML/AI solutions in production environments.\n\nArchitect, design, develop, and deploy our AI solutions and systems into production environments, ensuring reliability, high performance, and scalability.\n\nTake ownership and technical leadership in the development and maintenance of main AI products, including the AI Assistant (automating ~40% of merchant requests), AI Translation (enabling cross-language agent service), and the AI Agent Copilot.\n\nDevelop and maintain ML infrastructure and pipelines to support efficient data processing, model training, serving, and continuous monitoring.\n\nOptimise and fine-tune machine learning ...",
    "salary": null,
    "job_type": null,
    "department": "Data Engineer/Scientist"
  },
  {
    "id": "7543954",
    "title": "Senior Reporting Data Analyst (Fluent French)",
    "company": "N26",
    "url": "https://n26.com/en-eu/careers/positions/7543954?gh_jid=7543954",
    "location": "Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-26T06:29:17-05:00",
    "source": "Greenhouse:n26",
    "scraped_at": "2026-01-23T16:01:57.985553",
    "domain": "n26.com",
    "description": "About the opportunity\n\nThe Senior Reporting Data Analyst plays a key role in supporting the French Regulatory Reporting team by developing, maintaining, and optimizing the data models, pipelines, and scripts used for French regulatory submissions. The role ensures high-quality data, reliable transformations, and seamless alignment between French regulatory requirements and our data/tech teams.\n\nIn this role, you will:\n\nWorking with the French Regulatory Reporting team who are our experts in regulatory reports, in order to match regulatory requirements to the data which is living in our DWH.\n\nBuild and automate data models.\n\nData profiling, finding the right data, requesting missing data, etc.\n\nConducting data quality investigation.\n\nDefine, build and maintain processes that deliver crucial data to internal and external stakeholders.\n\nAutomate everything what is possible.\n\nLearn about regulator reports and accounting principles.\n\nMaintain your work well documented, reproducible and reliable.\n\nWhat you need to be successful:\n\nBackground:\n\nMinimum 5 years of experience working with data in the financial industry or similar.\n\nFluent in English &amp; French.\n\nAdvanced knowledge of SQL is a must (Postgres or Redshift preferred).\n\nYou love working with data, and you become very creative when analyzing data.\n\nYou are independent problem solver who owns the process from the beginning till the end, however you also know how to recognize when to ask for a help.\n\nYou are curious, responsible, self-motivated, detail oriented empathic leader and a strong communicator.\n&nbsp;\n\nAdvanced SQL Skills:\n\nExpert-level proficiency in SQL for querying, data manipulation, and performance optimization.\n\nAbility to write complex SQL queries, stored procedures, CTEs, and window functions.\n\nStrong understanding of database normalization, indexing, and query performance tuning.\n&nbsp;\n\ndbt (Data Build Tool) Knowledge (optional but beneficial):\n\nProficiency with dbt for transforming, testing, and...",
    "salary": null,
    "job_type": null,
    "department": "European Markets"
  },
  {
    "id": "7494477003",
    "title": "Engineering Manager - AI",
    "company": "Doctolib",
    "url": "https://job-boards.greenhouse.io/doctolib/jobs/7494477003",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-17T05:03:26-05:00",
    "source": "Greenhouse:doctolib",
    "scraped_at": "2026-01-21T22:03:36.192907",
    "domain": "doctolib.com",
    "description": "Join our mission, join Doctolib!\n\nWhat you'll do&nbsp;\n\nDoctolib’s Engineering environment is rich and we are building innovative products and features aiming each day to ease doctors' and patient life.\n\nWe are looking for our next Engineering Manager - AI to join our tech domains in Berlin. You will join a team of hard working entrepreneurs, who are passionate about transforming healthcare and play an active role in shaping a fast-growing company from day one!\n\nTo go beyond the ad, please check our technical blog!\n\nAbout our tech environment\n\nOur solutions are built on a single fully cloud-native platform that supports web and mobile app interfaces, multiple languages, and is adapted to the country and healthcare specialty requirements. To address these challenges, we are modularizing our platform run in a distributed architecture through reusable components.&nbsp;\n\nOur stack is composed of Rails, TypeScript, Java, Python, Kotlin, Swift and React Native.\n\nWe leverage AI in an ethical manner across our products to empower patients and health professionals. Discover our AI vision here and learn about our first AI hackathon here!\n\nWho you are&nbsp;\n\nBefore you read on — if you don't have the exact profile described below, but you feel this job description matches your skill set, we still encourage you to apply.&nbsp;You will be both a technical leader and a people manager, coaching and training your team members while building an amazing engineering organization at Doctolib. In this role, you will:\n\nLead a high performing collaborative team of 5+ members to ensure business objectives are met as a team&nbsp;\n\nPartner with talent &amp; people teams to recruit, develop and retain talent\n\nBuild, lead, and empower a user centric team, that delivers best in class internal and external user satisfaction&nbsp;\n\nTogether with your product partner, define a mission, vision for your team and align on a clear roadmap to make it happen.&nbsp;\n\nBe the end-to-end owner of the team’s...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "4516967101",
    "title": "Deployed AI Engineer",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4516967101?gh_jid=4516967101",
    "location": "Munich - Berlin - London - Paris - Warsaw - Tallinn",
    "city": "Munich - Berlin - London - Paris - Warsaw - Tallinn",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-12T04:50:26-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-21T21:21:07.321822",
    "domain": "helsing.ai",
    "description": "Who we are\n\nHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.&nbsp;\n\nAs democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.&nbsp;\n\nWe are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers.&nbsp;We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.&nbsp;\n\nThe role\n\nSoftware only matters when it is actively being used and making a difference. As a Deployed AI Engineer, you will be at the heart of this - taking state-of-the-art software and integrating it into complex systems. You will be defining and executing against the end-to-end outcome and all steps on the way&nbsp;to delivering novel capabilities in some of the most challenging environments around.\n\nFor example: you collaborate directly with customer avionics engineers to understand the data structures and APIs used in aircraft mission control systems. Instead of being scared, you embrace the complexity of unfamiliar databases, APIs, or network protocols; you dig into the specification and use your creativity and ingenuity to implement adapters for integrating them with Helsing’s cloud infrastructure. By working closely with our partners and customers (both metaphorically and quite literally), you continuously evolve, improve, and operate Helsing software. You own the outcome end-to-end.\n\nThe day-to-day\n\nIn close collaboration with our product teams, you will discover and formalise customer requirements, identify bugs, and ship...",
    "salary": null,
    "job_type": null,
    "department": "Deployed Engineering"
  },
  {
    "id": "4233250101",
    "title": "Data Engineer ",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4233250101?gh_jid=4233250101",
    "location": "Berlin; London, England, United Kingdom; Munich",
    "city": "Berlin; London",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-12T04:50:25-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-21T21:21:07.321822",
    "domain": "helsing.ai",
    "description": "Who we are\n\nHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.\n\nAs democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.&nbsp;\n\nWe are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers. We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.\n\nThe role\n\nAt Helsing, data is the foundation of our AI capabilities. We build scalable systems that transform raw sensor and camera data into mission-critical datasets powering advanced AI algorithms. You will architect and build the data pipelines that bridge field data acquisition and AI development, working in an environment where off-the-shelf solutions rarely fit and custom systems are the norm.\n\nThis role requires moving fast while maintaining a long-term vision, balancing immediate impact with scalable architecture, and collaborating across teams to deliver flexible solutions that evolve with our needs. Over time you will become a recognized expert in building production data infrastructure for AI systems, shaping how Helsing processes and scales mission-critical data.\n\nThe day-to-day\n\nDesign and implement scalable data pipelines that ingest sensor and camera data, process large video datasets, and deliver AI-ready outputs with high throughput and reliability&nbsp;\n\nCollaborate with field operations, AI researchers, and ML engineers to understand data requirements and translate them into automated, production-grade solutions\n\nBuild the criti...",
    "salary": null,
    "job_type": null,
    "department": "AI & Engineering"
  },
  {
    "id": "4372802101",
    "title": "AI Research Engineer - Signal Processing",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4372802101?gh_jid=4372802101",
    "location": "Berlin; Munich",
    "city": "Berlin; Munich",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-12T04:50:24-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-21T21:21:07.320824",
    "domain": "helsing.ai",
    "description": "Who we are\n\nHelsing is a defence AI company with the mission is to protect our liberal democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards. We believe we have a responsibility to be thoughtful about the development and deployment of powerful technologies like AI and take this responsibility seriously.&nbsp;\n\nWe are an ambitious and committed team of software and deployment engineers, AI specialists and customer-facing programme managers.&nbsp;We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems today.\n\nWe embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.&nbsp;\n\nThe role\n\nAt Helsing, we deliver AI-based capabilities and the enabling foundation that allow machines to perceive and assist human decision-making.\n\nYou will have the unique opportunity to shape AI capabilities in one of the most challenging sectors, where high generalisation capabilities need to be paired with hardware constraints and robustness against adversarial attacks.\n\nYou will be part of a signal processing team, where you will build in-house solutions for signal processing problems that we face, in the sky or underwater.\n\nThe day-to-day\n\nYou will develop and extend the state-of-the-art in signal processing, applying and deploying the technology in real-world scenarios.\n\nYou will contribute to projects and will collaborate with people across several teams and backgrounds.\n\nYou should apply if you\n\nHold an MSc in signal processing, machine learning, robotics, communication engineering or related field with experience in conceptualising, implementing and thoroughly evaluating advanced AI-based systems\n\nHave excellent communication skills and the ability to report and present research findings clearly and efficien...",
    "salary": null,
    "job_type": null,
    "department": "AI & Engineering"
  },
  {
    "id": "4334842101",
    "title": "AI Research Engineer -  Computer Vision",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4334842101?gh_jid=4334842101",
    "location": "Berlin; London; Munich",
    "city": "Berlin; London; Munich",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-18T08:45:39-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-21T21:21:07.319327",
    "domain": "helsing.ai",
    "description": "Who we are\n\nHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.&nbsp;\n\nAs democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.&nbsp;\n\nWe are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers.&nbsp;We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.&nbsp;\n\nThe role\n\nAt Helsing we deliver AI-based capabilities and the enabling foundation that allow machines to perceive and assist human decision-making. You will have the unique opportunity to shape AI capabilities in one of the most challenging sectors, where high generalisation capabilities need to be paired with hardware constraints and robustness against adversarial attacks.\n\nYou will be part of a computer vision team, where you will be responsible for building computer vision models for object recognition and tracking, video understanding, scene matching, etc.\n\nThe day-to-day\n\nYou will develop computer vision models and pipelines that leverage and extend the latest state-of-the-art methods and architectures, as well as design experiments and conduct benchmarks to evaluate and improve their performance in real-world scenarios. \n\nYou will also apply and develop techniques to adapt them to the target hardware and constraints associated to the downstream ML/AI tasks. \n\nYou will contribute to impactful projects and will collaborate with people across several teams and backgrounds.\n\nYou should apply if you\n\nHold an MSc in computer scienc...",
    "salary": null,
    "job_type": null,
    "department": "AI & Engineering"
  },
  {
    "id": "4334849101",
    "title": "AI Research Engineer - AI Safety",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4334849101?gh_jid=4334849101",
    "location": "Berlin; London; Munich",
    "city": "Berlin; London; Munich",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-12T04:50:24-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-21T21:21:07.319327",
    "domain": "helsing.ai",
    "description": "Who we are\n\nAt Helsing we deliver AI-based capabilities and the enabling foundation that allow machines to perceive and assist human decision-making. You will have the unique opportunity to shape AI capabilities in one of the most challenging sectors, where high generalisation capabilities need to be paired with hardware constraints and robustness against adversarial attacks.\n\nYou will join a team focused on AI Assurance, where you will develop cutting-edge techniques for scalable evaluation of AI products across the company, design data collection and experimentation strategies to extract causal insights, and enhance responsible decision-making via uncertainty quantification and safety mechanisms.\n\nThe day-to-day\n\nYou will be responsible for defining operational domains and evaluating the reliability of the AI capabilities developed in-house. You will develop and extend the state-of-the-art in uncertainty quantification and uncertainty calibration. This will involve understanding the AI systems we build, interfacing with them, and evaluating their robustness in real-world and adversarial scenarios. You will contribute to impactful projects and will collaborate with people across several teams and backgrounds.\n\nYou should apply if you\n\nHold a STEM MSc with solid mathematical and statistical background.\n\nHave excellent communication skills and the ability to report and present research findings clearly and efficiently both internally and externally\n\nAre passionate about keeping up to date with current research and enjoy reimplementing / extending papers on state of the art Deep Learning-based approaches\n\nPossess solid software engineering skills, writing clean and well-structured code in Python and/or languages like Rust, Java, or modern C++, and experience deploying AI software to production including testing, QA, and monitoring\n\nNote: We operate at an intersection where women, as well as other minority groups, are systemically under-represented. We encourage you to...",
    "salary": null,
    "job_type": null,
    "department": "AI & Engineering"
  },
  {
    "id": "4676357101",
    "title": "AI Research Engineer - Reinforcement Learning",
    "company": "Helsing",
    "url": "https://helsing.ai/jobs/4676357101?gh_jid=4676357101",
    "location": "Berlin; Munich",
    "city": "Berlin; Munich",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-12T04:50:24-05:00",
    "source": "Greenhouse:helsing",
    "scraped_at": "2026-01-21T21:21:07.319327",
    "domain": "helsing.ai",
    "description": "Who we are\n\nHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.&nbsp;\n\nAs democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.&nbsp;\n\nWe are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers.&nbsp;We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.&nbsp;\n\nThe role\n\nAt Helsing we deliver AI-based capabilities and the enabling infrastructure that allow semi-autonomous platforms to localise, navigate, and perceive the world in real time. You will have the unique opportunity to shape the future of AI in one of the most challenging sectors, where performance needs to be paired up with high generalisation capabilities and strong robustness against adversarial attacks.\n\nYou’ll build the autonomy brain for a cutting-edge autonomous aerial platform that will actually take flight. you'll be developing state-of-the-art reinforcement learning agents into the operational systems of our own Unmanned Combat Aerial Vehicle (UCAV), the CA-1 Europa, part of the groundbreaking Centaur project. This is a unique opportunity to directly contribute to a novel autonomous system designed from the ground up.\n\nThe day-to-day\n\nYou'll build, train and integrate reinforcement learning agents into high-performance runtime systems, enabling real-time autonomous decision-making in flight.&nbsp;\n\nYou will contribute to our reinforcement learning stack by implementing, improving and extending the current state of the...",
    "salary": null,
    "job_type": null,
    "department": "AI & Engineering"
  },
  {
    "id": "4532553005",
    "title": "Machine Learning Software Engineer",
    "company": "Applied Intuition",
    "url": "https://boards.greenhouse.io/appliedintuition/jobs/4532553005?gh_jid=4532553005",
    "location": "Stuttgart, Baden-Württemberg, Germany",
    "city": "Stuttgart",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-01-14T17:31:02-05:00",
    "source": "Greenhouse:appliedintuition",
    "scraped_at": "2026-01-21T21:21:05.040266",
    "domain": "appliedintuition.com",
    "description": "About Applied Intuition\n\nApplied Intuition, Inc. is powering the future of physical AI. Founded in 2017 and now valued at $15 billion, the Silicon Valley company is creating the digital infrastructure needed to bring intelligence to every moving machine on the planet. Applied Intuition services the automotive, defense, trucking, construction, mining and agriculture industries in three core areas: tools and infrastructure, operating systems, and autonomy. Eighteen of the top 20 global automakers, as well as the United States military and its allies, trust the company’s solutions to deliver physical intelligence. Applied Intuition is headquartered in Sunnyvale, California, with offices in Washington, D.C.; San Diego; Ft. Walton Beach, Florida; Ann Arbor, Michigan; London; Stuttgart; Munich; Stockholm; Bangalore; Seoul; and Tokyo. Learn more at&nbsp;applied.co.\n\nWe are an in-office company, and our expectation is that employees primarily work from their Applied Intuition office 5 days a week. However, we also recognize the importance of flexibility and trust our employees to manage their schedules responsibly. This may include occasional remote work, starting the day with morning meetings from home before heading to the office, or leaving earlier when needed to accommodate family commitments.\nAbout the role\n\nWe are looking for software engineers with expertise in ML-first perception, prediction or planning for autonomous vehicles or mobile robots. Your contributions will focus on building out key ML capabilities of an autonomous vehicle stack.&nbsp;\n\nIn addition to your engineering contributions, by working in our dynamic and customer-focused team culture, you will contribute to and learn from best practices in the autonomy industry. We move fast and focus on excellence, for our products and for our business. If you are hands-on and looking for a place to have a multiplying effect on making autonomous systems a reality, Applied Intuition is the place for you!\n\nAt Appli...",
    "salary": null,
    "job_type": null,
    "department": "SDS Software Engineering"
  },
  {
    "id": "3043024",
    "title": "Programmatic Solutions Consultant , Amazon",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3043024",
    "location": "DE, BY, Munich",
    "city": "Munich",
    "country": "Germany",
    "posted_date": "July 24, 2025",
    "updated_time": "about 1 month",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-21T20:55:35.305476",
    "domain": null,
    "description": "Amazon Ads is dedicated to driving measurable outcomes for brand advertisers, agencies, authors, and entrepreneurs. Our ad solutions - including sponsored, display, video, and custom ads - leverage Amazon’s innovations and insights to find, attract, and engage intended audiences throughout their daily journeys. With a range of flexible pricing and buying models, including self-service, managed service, and programmatic ad buying, these solutions help businesses build brand awareness, increase product sales, and more. Our programmatic advertising platform, the Amazon Demand Side Platform (DSP), is becoming increasingly popular with major advertisers and agencies worldwide. We believe we understand display advertising better than anybody else and want to turn it into a science of its own that all users can leverage for their programmatic advertising.<br/><br/>Our Amazon DSP team is looking for a Programmatic Solutions Consultant to join Amazon Ads growing team based in Germany.<br/><br/>As a Programmatic Solutions Consultant, you will manage the end-to-end experience of our enterprise customer, known as programmatic trading desks. You will drive success by developing customer expertise in our programmatic advertising DSP. The Programmatic Solutions Consultant has experience in advertising technology and the programmatic advertising domain, and is leveraging this expertise to help our customers meet and exceed their business objectives. In this customer-facing role, you will work closely with programmatic traders at agencies/advertisers, as well as Amazon Ads internal sales, product, and support teams to address customer needs.<br/><br/>A typical PSC engagement with our customers could include onboarding new traders, delivering trainings on new product features, assisting a customer with a beta feature, consulting in business strategy and planning discussions, providing oversight in execution of campaign strategy, developing campaign optimization recommendations and monitoring their impact, conducting deep dives to determine root causes of issues and informing customers of the best course of action.<br/><br/>You will advocate for customer in internal forums, provide troubleshooting support and triage when needed, and simplify and propagate customer feedback to inform product and services design. PSCs operate as trusted advisors to customers every day, and ensure customers gradually develop into a proficient users of our DSP, who see Amazon DSP as their preferred means to their goals.<br/><br/>You will be passionate about understanding customer objectives, and address them using our book of services and engagement best practices, to drive adoption of Amazon technologies. Your ownership, curiosity, and domain knowledge will allow you to comprehensively understand the details of our offerings and be able to speak to these to our customers with passion, authority, empathy, and clarity.<br/><br/>Key job responsibilities<br/>- Owning the relationship with programmatic trading desk managers, engaging with multiple customer organizational levels to understand business objectives<br/>- Providing services such as onboarding, trade desk support plans, feature training, continuous product usage consultation, and industry best practices<br/>- Analyzing and interpreting data to identify improvement areas, root causes, and formulate enablement and adoption recommendations<br/>- Driving the evolution of Amazon DSP by assisting customers with product beta participation, capturing customer feedback, and collaborating closely with cross-functional Amazon teams (Product Management, Engineering, Analytics, and Specialists)<br/>- Defining and improving processes and tools for the Programmatic Solutions Consultant team to better serve customers<br/><br/>A day in the life<br/>- A typical PSC engagement with our customers could include onboarding new traders, delivering trainings on new product features, assisting a customer with a beta feature, consulting in business strategy and planning discussions, providing oversight in execution of campaign strategy, developing campaign optimization recommendations and monitoring their impact, conducting deep dives to determine root causes of issues and informing customers of the best course of action.<br/><br/>- You will advocate for customer in internal forums, provide troubleshooting support and triage when needed, and simplify and propagate customer feedback to inform product and services design. PSCs operate as trusted advisors to customers every day, and ensure customers gradually develop into a proficient users of our DSP, who see Amazon DSP as their preferred means to their goals.<br/><br/>- You will be passionate about understanding customer objectives, and address them using our book of services and engagement best practices, to drive adoption of Amazon technologies. Your ownership, curiosity, and domain knowledge will allow you to comprehensively understand the details of our offerings and be able to speak to these to our customers with passion, authority, empathy, and clarity.<br/><br/>About the team<br/>Here at Amazon Ads, we embrace our differences. We are committed to furthering our culture of inclusion. We have 13 employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust. <br/><br/>Our team puts a high value on work-life balance. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfilment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.<br/><br/>Our team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional and enable them to take on more complex tasks in the future.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "744000104395609",
    "title": "Data Scientist - (Logistics, Seamless Deliveries)",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000104395609",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2026-01-20T07:47:28.690Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-21T20:55:24.143537",
    "domain": "deliveryhero.com",
    "description": "We are on the lookout for a&#xa0;Data Scientist to join the Seamless Deliveries domain of the Customer Logistics tribe in our mission to deliver consistently amazing customer experiences.\nYou will work alongside other data professionals designing and deploying advanced models to solve complex problems, delivering revenue for Delivery Hero at the frontline of our growth & profitability journey.&#xa0;\nAt Delivery Hero, we are exploring ways to optimize our delivery times and perfect our forecasting and estimation abilities. We are developing and enhancing a range of products to better predict delivery times, optimize fleet operations, and improve the customer ordering experience..\nThe Customer Logistics tribe’s mission is to build products that make it easy for local brands to run efficient operations and deliver a delightful order experience to customers so they order on repeat.\nThe tribe comprises teams of skilled analysts, engineers, and scientists working together to deliver data&#xa0; solutions affecting every customer journey across all of Delivery Hero’s 70+ markets.\nIf you're a creative problem solver who is hungry for a new adventure, an international workplace is waiting for you in the heart of Berlin!\n\nDrive the development and implementation of advanced machine learning models for delivery time prediction, food prep time prediction, vendor consistency, etc. Collaborate with cross-functional teams to enhance the efficiency and performance of the machine learning models across the vertical.\n\nAnalyse large-scale datasets to understand and identify opportunities deploying sophisticated statistical techniques to improve decision making in Time Predictions.\n\nLead research initiatives to explore emerging trends and technologies in machine learning, contributing to the advancement of Delivery Hero's digital products and algorithms. Stay informed about industry developments and incorporate new methodologies and best practices into our data science workflows.\n\nServe...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "3137328",
    "title": "Sr. Programmatic Solutions Consultant, PSC - DE",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3137328",
    "location": "DE, BY, Munich",
    "city": "Munich",
    "country": "Germany",
    "posted_date": "December  4, 2025",
    "updated_time": "about 1 month",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-16T14:39:04.779796",
    "domain": null,
    "description": "Amazon Ads is dedicated to driving measurable outcomes for brand advertisers, agencies, authors, and entrepreneurs. Our ad solutions - including sponsored, display, video, and custom ads - leverage Amazon’s innovations and insights to find, attract, and engage intended audiences throughout their daily journeys. With a range of flexible pricing and buying models, including self-service, managed service, and programmatic ad buying, these solutions help businesses build brand awareness, increase product sales, and more. Our programmatic advertising platform, the Amazon Demand Side Platform (DSP), is becoming increasingly popular with major advertisers and agencies worldwide. We believe we understand display advertising better than anybody else and want to turn it into a science of its own that all users can leverage for their programmatic advertising.<br/><br/>Our Amazon DSP team is looking for a Senior Programmatic Solutions Consultant to join Amazon Ads growing team based in Munich and Hamburg.<br/><br/>As a Senior Programmatic Solutions Consultant, you will manage the end-to-end experience of our enterprise customer, known as programmatic trading desks. You will drive success by developing customer expertise in our programmatic advertising DSP. <br/><br/>The Programmatic Solutions Consultant has experience in advertising technology and the programmatic advertising domain, and is leveraging this expertise to help our customers meet and exceed their business objectives. In this customer-facing role, you will work closely with programmatic traders at agencies/advertisers, as well as Amazon Ads internal sales, product, and support teams to address customer needs.<br/><br/>Key job responsibilities<br/>- Owning the relationship with programmatic trading desks and their senior leadership, engaging with multiple customer organizational levels to understand business objectives<br/>- Providing services such as onboarding, trade desk support plans, feature training, continuous product usage consultation, and industry best practices<br/>- Analyzing and interpreting data to identify improvement areas, root causes, and formulate enablement and adoption recommendations<br/>- Driving the evolution of Amazon DSP by assisting customers with product beta participation, capturing customer feedback, and collaborating closely with cross-functional Amazon teams (Product Management, Engineering, Analytics, and Specialists)<br/>- Defining and improving processes and tools for the Programmatic Solutions Consultant team to better serve customers<br/><br/>A day in the life<br/>A typical PSC engagement with our customers could include onboarding new traders, delivering trainings on new product features, assisting a customer with a beta feature, consulting in business strategy and planning discussions, providing oversight in execution of campaign strategy, developing campaign optimization recommendations and monitoring their impact, conducting deep dives to determine root causes of issues and informing customers of the best course of action.<br/><br/>You will advocate for customer in internal forums, provide troubleshooting support and triage when needed, and simplify and propagate customer feedback to inform product and services design. PSCs operate as trusted advisors to customers every day, and ensure customers gradually develop into a proficient users of our DSP, who see Amazon DSP as their preferred means to their goals.<br/><br/>You will be passionate about understanding customer objectives, and address them using our book of services and engagement best practices, to drive adoption of Amazon technologies. Your ownership, curiosity, and domain knowledge will allow you to comprehensively understand the details of our offerings and be able to speak to these to our customers with passion, authority, empathy, and clarity.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "7340727",
    "title": "Applied Research Scientist",
    "company": "Grammarly",
    "url": "https://job-boards.greenhouse.io/grammarly/jobs/7340727",
    "location": "Germany; Hybrid",
    "city": "Germany; Hybrid",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2025-12-16T15:15:08-05:00",
    "source": "Greenhouse:grammarly",
    "scraped_at": "2026-01-15T20:14:09.920191",
    "domain": "grammarly.com",
    "description": "Superhuman offers a dynamic hybrid working model for this role. This flexible approach gives team members the best of both worlds: plenty of focus time along with in-person collaboration that helps foster trust, innovation, and a strong team culture.\n\nAbout Superhuman\n\nGrammarly is now part of Superhuman, the AI productivity platform on a mission to unlock the superhuman potential in everyone. The Superhuman suite of apps and agents brings AI wherever people work, integrating with over 1 million applications and websites. The company’s products include Grammarly’s writing assistance, Coda’s collaborative workspaces, Mail’s inbox management, and Go, the proactive AI assistant that understands context and delivers help automatically. Founded in 2009, Superhuman empowers over 40 million people, 50,000 organizations, and 3,000 educational institutions worldwide to eliminate busywork and focus on what matters. Learn more at&nbsp;superhuman.com and about our values here.\n\nThe Opportunity\n\nTo achieve our ambitious goals, we’re looking for an Applied Research Scientist with a keen interest and background in natural language processing (NLP), machine learning (ML), and deep learning (DL) to join our Agents team. The team builds user-facing features that work in all Superhuman applications. We help our users write better, faster, and more effectively while working in big groups. The person in this role will bring their unique perspective to our product development process by contributing to ideation and defining the solution space. Based on their deep grasp of ML/DL/NLP concepts, the Applied Researcher will define the approach to solving the complex problems. The role will also build the intelligent functionality of our product offerings.\n\nSuperhuman's engineers and researchers have the freedom to innovate and uncover breakthroughs—and, in turn, influence our product roadmap. The complexity of our technical challenges is growing rapidly as we scale our interfaces, algorithms,...",
    "salary": null,
    "job_type": null,
    "department": "Engineering"
  },
  {
    "id": "7434207",
    "title": "Senior Marketing Data Analyst",
    "company": "HelloFresh",
    "url": "https://careers.hellofresh.com/global/en/job/7434207?gh_jid=7434207",
    "location": "Berlin, Berlin, Germany",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": null,
    "updated_time": "2026-02-20T06:55:20-05:00",
    "source": "Greenhouse:hellofresh",
    "scraped_at": "2026-01-15T20:14:09.059864",
    "domain": "hellofresh.com",
    "description": "The role\n\nAs a Senior Marketing Data Analyst in our Global Marketing Analytics organisation, you will play a pivotal role in driving data-informed decision-making at HelloFresh. Based in our Berlin Headquarters, you’ll join the Market Insights team - an internal analytics function supporting senior leadership across 15+ HelloFresh markets spanning 3 continents.\n\nYou will turn data into strategic recommendations, challenge the status quo, and directly shape how our global brands grow and operate.\n\nWhat You’ll Do\n\nAct as a trusted advisor to Global Marketing leadership: understand their challenges, frame analytical problem statements, and translate insights into actionable strategic recommendations\n\nMeasure, benchmark, and monitor brand and market performance, proactively identifying opportunities to improve key Marketing and business KPIs\n\nInfluence and optimize Marketing budgets and planning processes by challenging assumptions and ensuring data-driven decision making\n\nLead high-impact analytical projects, often partnering directly with senior stakeholders to enhance performance frameworks, forecasting, growth strategies, and reporting ecosystems\n\nBuild and enhance reporting and visualization assets that support day-to-day decision-making and strengthen global performance oversight\n\nCollaborate with and mentor analysts within the team, fostering a high-performing and supportive analytics community\n\nStreamline analytical processes and workflows, championing scalable and automated solutions\n\nWhat You’ll Bring\n\nA motivated, collaborative mindset with strong team-working skills and a passion for solving complex business problems\n\n5+ years of experience in Marketing Analytics, Finance Analytics, or a related quantitative field—ideally in a fast-paced B2C or subscription business\n\nStrong understanding of Marketing and Growth metrics, and how they connect to overall business performance\n\nA results-oriented and structured approach, able to turn vague or ambiguous business q...",
    "salary": null,
    "job_type": null,
    "department": "Marketing"
  },
  {
    "id": "1283486501",
    "title": "Information Systems Security Engineer (m/f/d)- Sovereign Cloud Delivery Germany",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/St_-Leon-Rot-Information-Systems-Security-Engineer-%28mfd%29-Sovereign-Cloud-Delivery-Germany-68789/1283486501/",
    "location": "St. Leon-Rot, DE, 68789",
    "city": "St. Leon-Rot",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-01-14T21:12:18.405590",
    "domain": null,
    "description": ">\r\n\nWhat you will do\r\n\nConfigure, maintain, administer and deploy a wide range of cyber security technologies such as IDS/IPS, EDR/XDR, SIEM, SOAR, Cloud vulnerability assessment, cloud-native security technologies (CSPM, CNAPP, CASB, CIEM, etc…)\r\n\nProvide technical leadership in the architecture, design, deployment, management, configuration and use of Cyber Security technologies\r\n\nDevelop configuration controls and automations to identify compliance gaps\r\n\nIdentify gaps in our current processes, workflows, designs, and controls\r\n\nSolve complex problems using data driven recommendations for changes and improvements while considering people, processes, and technology\r\n\nProvide mentoring and contribute to the overall growth and development of the team\r\n\nWhat you will bring\r\n\nBachelor's degree, ideally in Cyber Security, Information Security, Computer Science, Engineering, Information Technology\r\n\nMinimum 3 years of practical experience in a Security Engineer role working with cloud technologies\r\n\nKnowledge of cloud security, vulnerability management, major security compliance and development frameworks and principles\r\n\nMastery in at least one of the SecDevOps practices, such as Security as Code, CI/CD, Infrastructure as Code, Secure Coding Practices, Cloud Governance and Compliance…\r\n\nExperience working with cloud native security platforms a plus - CNAPP, CWPP, CSPM, CIEM, etc...\r\n\nIn-depth technical knowledge of cloud platforms - AWS, Azure, and GCP.\r\n\nPrevious work experience with the various phases of security incident response\r\n\nExperience working in a dynamic environment requiring collaboration across multiple organizations\r\n\nStrong analytical and reasoning, problem-solving, and decision-making skills\r\n\nWillingness to expand and grow\r\n\nExcellent written, oral communication, and documentation skills\r\n\nA keen curiosity about all aspects of cyber security (especially in the Cloud)\r\n\nUse industry sources to stay current with known Cloud security issues\r\n\nPersonable,...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "R0043400",
    "title": "Machine Learning Engineer, CV",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/Vienna-Austria/Machine-Learning-Engineer--CV_R0043400-1",
    "location": "Vienna, Austria",
    "city": "Vienna",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.726106",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "R0043783",
    "title": "Lead Machine Learning Engineer, Gen AI",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/London-United-Kingdom/Machine-Learning-Engineer_R0043783",
    "location": "London, United Kingdom",
    "city": "London",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.725109",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "R0043784",
    "title": "Machine Learning Engineer, Gen AI",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/London-United-Kingdom/Machine-Learning-Engineer_R0043784",
    "location": "London, United Kingdom",
    "city": "London",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.725109",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "R0043787",
    "title": "Senior Machine Learning Engineer, Gen AI",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/London-United-Kingdom/Machine-Learning-Engineer_R0043787",
    "location": "London, United Kingdom",
    "city": "London",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.725109",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "R0043764",
    "title": "Machine Learning Engineering Manager, Gen AI",
    "company": "Snapchat",
    "url": "https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/London-United-Kingdom/Machine-Learning-Engineering-Manager_R0043764",
    "location": "London, United Kingdom",
    "city": "London",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SnapchatScraper",
    "scraped_at": "2026-01-13T22:51:01.725109",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "1265850501",
    "title": "Senior Sovereign Cloud Architect & Advisor (f/m/d)",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/St_-Leon-Rot-Senior-Sovereign-Cloud-Architect-&amp;-Advisor-%28fmd%29-68789/1265850501/",
    "location": "St. Leon-Rot, DE, 68789",
    "city": "St. Leon-Rot",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-01-12T09:09:47.586810",
    "domain": null,
    "description": "an>\r\n\nWhat you'll do\r\n\nAre you a cloud maestro who can orchestrate the hybrid/multi-cloud environment, having a visionary mindset to translate the customer needs to Sovereign cloud strategies with technical precision, strategic governance, and effective cross-team coordination.\r\n\nExpectation and Tasks\r\n\nPresent Sovereign Cloud offering, technical details, and engagement model, managed service offerings to customers and stakeholders.\r\n\nPresent the technical and value proposition for private cloud on various platforms (AWS, Azure, GCP, SCI etc.)\r\n\nEnable the customer to understand Sovereign cloud principles, operational aspects, and managed services\r\n\nAdvise on non-functional capabilities like Business Continuity, Security, Compliance\r\n\nProvide ongoing deal support by being part of VAT and a trusted advisor\r\n\nHandover to delivery for deployment / provisioning\r\n\nWhat you bring\r\n\nRequired Skills\r\n\n6+ years of customer facing and SAP consulting experience with high proficiency in customer communication and presentation\r\n\nGood understanding of SAP solution releases and dependencies \r\n\nGood understanding of the hyperscaler like AWS, Azure, GCP and SCI capabilities \r\n\nSAP HANA, S/4 HANA, SAP NetWeaver, OS/DB migration, SAP HANA, TOGAF certifications\r\n\nProficiency in SAP product portfolio, Industry solutions and offerings, specifically knowledge of SAP BTP and Integration\r\n\nSelf-sufficient and work under critical timelines, continuous learne\r\n\nWillingness to go through personal security clearance (Government process)\r\n\nPreferred Skills\r\n\nPrior experience in pre-sales \r\n\nExperience in service delivery, ITSM , SAP system operations and management\r\n\nCertification of the hyperscaler AWS, Azure, GCP \r\n\nThe position can also be filled in part time.\r\n\nMeet the team\r\n\nSovereign Cloud solutions help organizations comply with data privacy, residency, and sovereignty laws by keeping information systems within national borders.  SAP Sovereign Cloud Services is a specialized unit within ...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "1265850801",
    "title": "Expert Sovereign Cloud Architect & Advisor (f/m/d)",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/St_-Leon-Rot-Expert-Sovereign-Cloud-Architect-&amp;-Advisor-%28fmd%29-68789/1265850801/",
    "location": "St. Leon-Rot, DE, 68789",
    "city": "St. Leon-Rot",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-01-12T09:09:47.586791",
    "domain": null,
    "description": "an>\r\n\nWhat you'll do\r\n\nAre you a cloud maestro who can orchestrate the hybrid/multi-cloud environment, having a visionary mindset to translate the customer needs to Sovereign cloud strategies with technical precision, strategic governance, and effective cross-team coordination.\r\n\nExpectation and Tasks\r\n\nPresent Sovereign Cloud offering, technical details, and engagement model, managed service offerings to customers and stakeholders.\r\n\nPresent the technical and value proposition for private cloud on various platforms (AWS, Azure, GCP, SCI etc.)\r\n\nConduct customer assessment workshops to define the cloud roadmap from As-is to To-Be\r\n\nEnable the customer to understand Sovereign cloud principles, operational aspects, and managed services\r\n\nPlan the migration roadmap together with partners, system integrators and or SAP Professional Services\r\n\nAdvise on non-functional capabilities like Business Continuity, Security, Compliance\r\n\nOwn technical discussions with the customer and liaise internally\r\n\nProvide ongoing deal support by being part of VAT and a trusted advisor\r\n\nHandover to delivery for deployment / provisioning\r\n\nWhat you bring\r\n\nRequired Skills\r\n\n8+ years of customer facing and SAP consulting experience with high proficiency in customer communication and presentation\r\n\nGood understanding of SAP solution releases and dependencies\r\n\nSolid understanding of cloud and platform stacks like virtualization, compute, network, storage \r\n\nGood understanding of the hyperscaler like AWS, Azure, GCP and SCI capabilities \r\n\nSAP HANA, S/4 HANA, SAP NetWeaver, OS/DB migration, SAP HANA, TOGAF certification\r\n\nHigh proficiency in SAP product portfolio, Industry solutions and offerings, specifically high-level knowledge about SAP BTP and Integration\r\n\nSelf-sufficient and work under critical timelines, continuous learner\r\n\nWillingness to go through personal security clearance (Government process)\r\n\nPreferred Skills\r\n\nKnowledge of Cybersecurity, FIPS, Data Privacy laws \r\n\nPrior experi...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "1259638401",
    "title": "Sovereign Cloud Expert DevOps Engineer (f/m/d) - SAP SuccessFactors (HCM)",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/St_-Leon-Rot-Sovereign-Cloud-Expert-DevOps-Engineer-%28fmd%29-SAP-SuccessFactors-%28HCM%29-68789/1259638401/",
    "location": "St. Leon-Rot, DE, 68789",
    "city": "St. Leon-Rot",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-01-12T09:09:47.586777",
    "domain": null,
    "description": null,
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "1258190301",
    "title": "Network Engineer Expert (m/f/d) - Sovereign Cloud Germany",
    "company": "SAP",
    "url": "https://jobs.sap.com/job/St_-Leon-Rot-Network-Engineer-Expert-%28mfd%29-Sovereign-Cloud-Germany-68789/1258190301/",
    "location": "St. Leon-Rot, DE, 68789",
    "city": "St. Leon-Rot",
    "country": "Germany",
    "posted_date": null,
    "updated_time": null,
    "source": "SAPScraper",
    "scraped_at": "2026-01-12T09:09:47.586758",
    "domain": null,
    "description": "t network infrastructure to deliver exceptional support to our customers.\r\n\nWhat you'll do:\r\n\nOperate and maintain complex Hyperscaler/SAP Cloud Infrastructure networks, track significant problems, monitor performance, and perform upgrades as required.\r\n\nEngage with customers in network architecture discussions to meet their security requirements.  \r\n\nImprove our network concepts based on customer feedback.\r\n\nRespond to and resolve escalated customer requests in a timely fashion.\r\n\nParticipate in deep level incident troubleshooting.\r\n\nParticipate in complex change preparation and execution.\r\n\nOther support tasks, duties, and responsibilities, e.g., hardware installations, troubleshooting, and administration\r\n\nWhat you bring:\r\n\nBachelor's Degree in Computer Science, Information Systems, Computer Engineering, or related field\r\n\nStrong experience with Hyperscaler networking (AWS, Azure or GCP) and/or SAP Cloud Infrastructure.\r\n\nExperience managing networking for SAP’s solutions, e.g. S/4, BTP, etc.\r\n\nExperience implementing security on AWS with VPC, IAM, Security Groups, UTM solutions, NACLS, etc.)\r\n\nPerform and lead diagnostics of problems, troubleshoot and develop solutions on AWS, Azure & GCP\r\n\nImplement security requirements across all Cloud platforms\r\n\nA willingness to work in a 24/7 environment with on-call duties and flexibility to work in shifts is required, ensuring consistent coverage and support. The role includes an attractive remuneration package for shift work and on-call duties\r\n\nCommitment to maintaining daily office presence for efficient team collaboration\r\n\nDue to the potentially classified nature of our work, your willingness is required to subject yourself to a governmental security clearance process\r\n\n​\r\n\nBring out your best\nSAP innovations help more than four hundred thousand customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software,...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000089288603",
    "title": "Senior/Staff Data Analyst - People Analytics",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000089288603",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2025-10-22T15:15:02.853Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-12T09:09:41.241745",
    "domain": "deliveryhero.com",
    "description": "We are on the lookout for a Senior/Staff Data Analyst - People Analytics to join the People & Culture team on our journey to always deliver amazing experiences.&#xa0;\nJoin the team that champions the employee experience at Delivery Hero. As part of the People & Culture Team, you’ll help attract, develop, and retain top talent, creating a workplace where people feel valued, supported, and empowered to grow. With each initiative you support, you’ll be building a positive culture that fuels innovation, teamwork, and a sense of belonging across our global organization.\nYou'll collaborate closely with senior business stakeholders, People & Culture Department leaders, and regional P&C teams from across the world, transforming raw data into actionable intelligence. You’ll analyze people data, identify trends, and develop strategies for optimization. Your work will directly impact decision making at Delivery Hero, fueling organizational performance and enhancements in employee experience with the generation of advanced data insights and predictive intelligence. You’ll be a key contributor to improving our operational excellence and strategic planning.\nDevelop, maintain and improve analytical pipelines to ensure efficient data processing and reporting.\nProactively analyse people data to identify trends and establish key performance metrics to monitor areas for improvement and optimisation.&#xa0;\nPartner with stakeholders to understand their data needs and provide actionable insights.\nCommunicate findings and recommendations to stakeholders through clear and concise reports and presentations. Translating technical information into digestible content to drive action plans and decision-making.&#xa0;\nRaise the bar in the data analysis of employee attrition, org design, efficiency drivers, D&I and other key metrics that bring best practices to the People & Culture department.\nDrive data literacy training and upskill people&#xa0;partners and other key stakeholders in the use and u...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000097517559",
    "title": "Senior Software Engineer (Machine Learning) - Quick commerce",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000097517559",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2025-12-08T13:01:25.512Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-12T09:09:40.159185",
    "domain": "deliveryhero.com",
    "description": "We are on the lookout for a Senior Software Engineer (Machine Learning) to join the Quick Commerce Data Science team on our journey to always deliver amazing experiences.&#xa0;\nAs part of the Integrated Partners Science team, you’ll be part of the ideation, design, prototyping and deployment of Data Products that help solve and scale solutions for our local business partners. A couple examples are: recommendations system for item replacement and a Data Product to help reduce items being out of stock when a picker is fulfilling the orders.\nAs a Senior Software Engineer, your primary value lies in tackling problems at scale by building and maintaining the high-performance serving layer for our ML models. A core part of this is integrating multiple microservices in real-time to fetch external data, apply business rules, and enforce operational constraints to enrich model predictions and shape the final decision. This critical layer directly impacts the algorithm's logic, leading to best-in-class efficiency and service across the Delivery Hero network.\n\nScale and Perform: Architect and build solutions at scale, optimizing for low-latency performance and high efficiency in production.\n\nSystem Ownership: Take end-to-end ownership of the backend serving layer, from design through deployment and maintenance.\n\nCollaborate and Optimize: Work closely with Data Scientists, Analysts, and Data Engineers to understand needs and build solutions that optimize their workflows and transition models to production.\n\nInnovate and Suggest: Proactively suggest how the team can leverage new technologies and architectures to support new use cases.\n\nLeverage Cloud: Utilize modern technologies and public cloud infrastructure to build highly available systems for multiple teams using CI/CD and Infrastructure as Code.\n&#xa0;\nBe part of redefining how customers experience quick commerce. You’ll help build technology that scales our non-food offerings, reaching new market segments and driving reve...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000099127020",
    "title": "Senior Data Scientist - (Logistics, Workforce)",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000099127020",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2025-12-16T10:30:55.916Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-12T09:09:40.159148",
    "domain": "deliveryhero.com",
    "description": "We are looking for a Senior Data Scientist - Logistics, Workforce to join our Logistics team to help us create a fast, reliable and transparent delivery experience. You will make an impact in optimizing our on-demand last-mile delivery operations, involving hundreds of thousands of couriers and restaurants, improving the experience for millions orders per day in 70+ countries.&#xa0;\nYour mission:\n\nConceptualize the right modeling approach for challenges in the field of Logistics at scale, together with your squad lead and our stakeholders.\n\nInnovate new modeling solutions by drawing from fields like Machine Learning, Operations Research and&#xa0; Statistics that drive value for our business.\n\nPair-program with your squad to engineer solutions that automate the retraining of models and generation of predictions.\n\nProvide ideas in brainstorming sessions with your Data Science colleagues to solve the toughest modeling problems together.\n\nHelp defining data needs to bring value to the projects, collaborate with the data engineering and tech teams in planning their roadmap.\n\nWork with (semi-)structured data from our BigQuery DWH architecture and process with Spark where necessary.&#xa0;",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000099135684",
    "title": "Director, Data Science - Deep Learning & AI",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000099135684",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2025-12-16T11:21:12.813Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-12T09:09:40.159144",
    "domain": "deliveryhero.com",
    "description": "We are seeking a Director of Data Science, Deep Learning to lead our deep learning team within the AdTech space, specifically within the Vendor Data team, to shape the future of AI-driven ads and deals at Delivery Hero. In this pivotal role, you will jointly architect state-of-the-art deep learning models, influence AI strategy, and develop cutting-edge methodologies to significantly enhance the success of thousands of vendors - restaurants, shops, and local businesses - across our platform.\nAs a senior leader within the Vendor Team, you will be instrumental in building and optimising our AdTech products by leveraging advanced deep learning techniques. These AI models will play a pivotal role in our AdTech ecosystem, helping vendors to maximise visibility, enhance their conversion rate, and drive substantial revenue growth.\nOperating in nearly 70 countries, our AdTech infrastructure connects millions of businesses with their ideal customers daily. With AdTech projected to generate over €1 billion in revenue in 2024/25, your leadership in deep learning-driven data will be critical in shaping our profitability strategy and advancing our market position.\nKey Responsibilities:\n\nDeep Learning Mastery: Exceptional expertise in designing and implementing advanced deep learning architectures, particularly transformers and other sequence-based attention-driven AI models, generative ranking approaches, and long-term interest networks for sophisticated user personalisation in AdTech.\n\nRigorous Model Evaluation and Business Impact: Proficient in establishing comprehensive evaluation frameworks for deep learning models, encompassing both internal model-centric metrics (such as NCE, ROCAUC, PRAUC) and the meticulous measurement of business metrics during live A/B testing and experimentation.\n\nCross-Functional Leadership and Alignment: Demonstrated ability to collaborate and align effectively across diverse functions, including engineering, commercial, and product teams, to drive ...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000099336285",
    "title": "Principal Data Scientist - AdTech Ranking",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000099336285",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2025-12-17T12:14:55.613Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-12T09:09:40.159125",
    "domain": "deliveryhero.com",
    "description": "We are on the lookout for Principal Data Scientists to join the AdTech data science team (Ranking Team) on our journey to always deliver amazing experiences.\nAs part of our Vendor Team, you’ll be the driving force behind the success of thousands of restaurants, shops, and local businesses. Your contributions will empower vendors with advanced tools to manage their operations, boosting their visibility, and reach. Every feature you help build will create growth opportunities for businesses of all sizes, strengthening Delivery Hero’s ecosystem and impact.\nAt Delivery Hero, AdTech introduces people to new food they love and enables our partners to meet their future customers at the perfect moment. We have developed a range of products to offer advertising solutions for restaurants helping them to increase their visibility and reach, improve their order conversion, and eventually drive more sales by covering the entire marketing funnel. Operating across over 50 countries around the clock, our Ad Tech connects the ideal advertiser with the ideal customer millions of times every day. Ad Tech is a fundamental area for us on our path to profitability. our data science team is at the heart of this growth, powering personalisation, Ranking, relevance, and recommendation.&#xa0;\nYou will be a thought leader, driving innovation by designing and deploying our models to the forefront of technology to solve complex problems, delivering revenue for Delivery Hero at the frontline of our growth & profitability journey. In this role you will\n&#xa0;\nDrive transformative innovation in AI-powered ranking and bidding systems for digital advertising.\nLead the creation of advanced models and strategies that redefine auction dynamics, maximise advertiser ROI, and deliver exceptional user experiences.\nAs an expert and visionary, you will elevate our advertising intelligence capabilities, setting new industry benchmarks while shaping the future of data-driven decision-making at scale.",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "744000099345205",
    "title": "Staff Data Scientist - AdTech Ranking",
    "company": "Delivery Hero",
    "url": "https://jobs.smartrecruiters.com/DeliveryHero/744000099345205",
    "location": "Berlin, de",
    "city": "Berlin",
    "country": "de",
    "posted_date": "2025-12-17T13:12:23.927Z",
    "updated_time": null,
    "source": "SmartRecruiters:DeliveryHero",
    "scraped_at": "2026-01-12T09:09:40.159113",
    "domain": "deliveryhero.com",
    "description": "We are on the lookout for&#xa0;Staff Data Scientists&#xa0;to join the AdTech data science team (Ranking Team) on our journey to always deliver amazing experiences.\nAs part of our Vendor Team, you’ll be the driving force behind the success of thousands of restaurants, shops, and local businesses. Your contributions will empower vendors with advanced tools to manage their operations, boosting their visibility, and reach. Every feature you help build will create growth opportunities for businesses of all sizes, strengthening Delivery Hero’s ecosystem and impact.\nAt Delivery Hero, AdTech introduces people to new food they love and enables our partners to meet their future customers at the perfect moment. We have developed a range of products to offer advertising solutions for restaurants helping them to increase their visibility and reach, improve their order conversion, and eventually drive more sales by covering the entire marketing funnel. Operating across over 50 countries around the clock, our Ad Tech connects the ideal advertiser with the ideal customer millions of times every day. Ad Tech is a fundamental area for us on our path to profitability. our data science team is at the heart of this growth, powering personalisation, Ranking, relevance, and recommendation.&#xa0;\nYou will be a thought leader, driving innovation by designing and deploying our models to the forefront of technology to solve complex problems, delivering revenue for Delivery Hero at the frontline of our growth & profitability journey. In this role you will\nDrive transformative innovation in AI-powered ranking and bidding systems for digital advertising.\nLead the creation of advanced models and strategies that redefine auction dynamics, maximise advertiser ROI, and deliver exceptional user experiences.\nAs an expert and visionary, you will elevate our advertising intelligence capabilities, setting new industry benchmarks while shaping the future of data-driven decision-making at scale.\n&#xa0;\n&#x...",
    "salary": null,
    "job_type": null,
    "department": null
  },
  {
    "id": "2998387",
    "title": "Manager, Programmatic Solutions Consultants, Amazon Ads Global Sales, Programmatic Solutions Consultants",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/2998387",
    "location": "DE, HH, Hamburg",
    "city": "Hamburg",
    "country": "Germany",
    "posted_date": "June  3, 2025",
    "updated_time": "about 1 month",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233627",
    "domain": null,
    "description": "Amazon Ads is seeking an experienced Manager for our Programmatic Solutions Consultants team to join our growing business based in Germany (Hamburg or Munich).<br/><br/>Key job responsibilities<br/>Navigate a high level of ambiguity. You love whitespace, and treat this space as your own company. You identify key business problems to prioritize then present the solutions to solve them on behalf of the business.<br/>Take ownership of managing a team of Programmatic Solutions Consultants, including resource planning and driving success for the team’s customer category, possessing a complete understanding of internal and external variables that impact the business.<br/>Work tactically and strategically. Determines the right strategy and where to simplify or extend solutions for the best outcome of the assigned category.<br/>Be comfortable working with data to develop new opportunity areas, track program metrics, and use findings to influence business decisions.<br/>Set goals and direction for the team, ensuring alignment with broader business goals and vision.<br/>Hire, develop, and lead a team of technical and non-technical Programmatic Solutions Consultants.<br/>Thrive on technology and data and have expertise in monitoring and managing a services organization to maximum efficiency, productivity, and quality.<br/>Generate and implement big ideas to drive business improvement, innovation, and scale within the team and across the business as a whole. Lead cross functional collaboration to get big ideas implemented.<br/>Anticipate bottlenecks, assess risks, mitigate issues, provide escalation management, anticipate and make trade-offs.<br/>Have strong communication skills and experience working across diverse stakeholder groups.<br/>Represent Amazon when meeting with senior executive teams from top customers and build long term strategic relationships.<br/><br/>A day in the life<br/>You lead the frontline team tasked with enabling trading desk customers to be successful in using the Amazon DSP. <br/>As a results-oriented supervisor, you attend a meeting with client leadership to review customer certification and support plans. <br/>You join a call with Ad Tech Sales stakeholders to determine strategy and coverage for specific accounts. <br/>You meet with Product and partner teams to review a document you and your team wrote, proposing feature upgrades to unblock customer needs and influence roadmap prioritization.<br/>You attend a one-on-one with a direct report, and discuss where they are headed in their career path, as well as the rollout of a new tool.<br/>You prepare your section of a weekly business review document, to review data-driven insights and spark discussion with leadership on team wins and areas for improvement.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3041640",
    "title": "Principal Engineer, EC2",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3041640",
    "location": "DE, BE, Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "July 23, 2025",
    "updated_time": "7 days",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233625",
    "domain": null,
    "description": "As a Principal Engineer on EC2 in the Accelerated Nitro team, you will have the opportunity to make a significant impact on the core infrastructure powering Amazon Web Services. You will be at the forefront of developing the next generation of EC2 instance families, driving innovations in virtualization, hardware acceleration, and cloud computing.<br/><br/>The EC2 Accelerated Nitro team focuses on building highly efficient and secure hypervisors, as well as integrating advanced hardware accelerators like GPUs and FPGAs into the EC2 instance families. This enables us to deliver near bare-metal performance and support a wide range of workloads, from machine learning and high-performance computing to graphics processing.<br/><br/>In this role, you will:<br/><br/>   - Lead the Development of Core EC2 Capabilities: Spearhead the design and architecture of new EC2 instance features, from CPU scheduling and memory management to device emulation and PCIe subsystem integration. Your technical guidance will shape the roadmap and implementation across multiple global teams.<br/>   - Advance Virtualization Security: Drive security-focused initiatives that enhance the integrity and resilience of our virtualization platform, ensuring the highest standards of data protection for our customers.<br/>   - Mentor and Grow Engineering Talent: Leverage your deep technical expertise to develop other engineers, providing architecture reviews, design proposals, and hands-on coding support to elevate the skills of the broader team.<br/>   - Influence the Future of Cloud Computing: Contribute your thinking to shape the technological direction of EC2 instances and features, advocating for innovative solutions that deliver exceptional performance and value to our customers.<br/><br/>This role is exclusively based in our Berlin, Germany office. The successful candidate must be willing and able to be physically present in the Berlin office every day to collaborate closely with the cross-functional engineering and product teams driving the development of our next-generation EC2 instance families. Remote work arrangements or locating in another Amazon office are not possible for this role. This level of dedicated, on-site participation is essential to the effective execution and advancement of this strategic cloud computing initiative.<br/><br/>To excel in this role, you will need a proven track record as a solid technical Principal Engineer, with expertise in low-level system software, hardware acceleration, and cloud infrastructure. You should also possess strong leadership abilities, the capacity to thrive in a fast-paced, startup-like environment, and a passion for mentoring and developing engineering talent.<br/><br/>If you are excited by the prospect of redefining the boundaries of cloud computing, and are able to commit to full-time, in-person work in our Berlin office, we encourage you to apply for this transformative Principal Engineer opportunity on the EC2 Accelerated Nitro team.<br/><br/>This is your opportunity to drive strategic programs with visibility to the highest levels of the company, while working with new technologies and talented, passionate teams. Are you ready to redefine the economics of large-scale computing?<br/><br/>Utility Computing (UC) AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon's Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS's services and features apart in the industry. As a member of the UC organization, you'll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS. Within AWS UC, Amazon Dedicated Cloud (ADC) roles engage with AWS customers who require specialized security solutions for their cloud services.<br/><br/><br/>Key job responsibilities<br/>    - Deliver new EC2 instance platforms by giving technical guidance to multiple teams across different time zones and locations, and working closely with product managers and technical program managers.<br/>    - Drive virtualization-related security initiatives.<br/>    - Design and architect new EC2 instance features and deliver them by growing other engineers.<br/>    - Influence and contribute to the technological roadmap of EC2 instances and features, through compelling customer justification.<br/>    - Improve the efficiency of their organization by offering technical solutions to operational bottlenecks.<br/><br/><br/>A day in the life<br/>As a Principal Engineer in the EC2 Accelerated Platforms and Hypervisor organization, you'll drive technical excellence across multiple high-impact initiatives. Your typical day includes:<br/> - Technical Leadership: Overseeing strategic projects while collaborating with internal teams, external partners, and customers to provide technical vision for next-generation EC2 instance types and hypervisor features.<br/> - Design and Innovation: Creating prototypes that validate concepts and establish timelines, developing design documents that guide engineering efforts across organizations.<br/> - Hands-on Engineering: Actively participating in development, debugging, and release management to deliver customer value on schedule.<br/> - Strategic Planning: Partnering with management on progress reporting and future planning to effectively prioritize initiatives across the organization.<br/><br/><br/>About the team<br/>The EC2 Accelerated Nitro team has a bold mission: to leave no customer workload on-premises and build the most feature-rich virtualization platform in the cloud. The team develops new EC2 instance families powered by the latest hardware accelerators, enabling customers to run their most demanding workloads with unparalleled performance, efficiency, and cost-effectiveness. Simultaneously, the team enhances the Nitro virtualization system, pushing the boundaries of cloud computing through innovations in memory management, security, and live migration, giving customers unprecedented flexibility, reliability, and control.<br/><br/>At the core of the team's two-fold mission is a relentless drive to engineer new capabilities that eliminate any remaining barriers for customers to fully embrace the cloud. The team solves high-impact, technically complex challenges that are shaping the future of cloud computing, from developing the next generation of hardware-accelerated instance types to building the most feature-rich virtualization technology available.<br/>If you are excited by the prospect of redefining the boundaries of cloud infrastructure and enabling customers to run any workload in the cloud, we encourage you to explore this transformative Principal Engineer opportunity on the EC2 Accelerated Nitro team.<br/><br/>About AWS<br/>Diverse Experiences <br/>Amazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. <br/><br/>Why AWS <br/>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/>Work/Life Balance <br/>We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. <br/>Inclusive Team Culture <br/>Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.<br/>Mentorship and Career Growth<br/>We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. <br/>",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3115016",
    "title": "2026 Applied Scientist Intern, Amazon University Talent Acquisition",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3115016",
    "location": "DE, BE, Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "October 24, 2025",
    "updated_time": "17 days",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233607",
    "domain": null,
    "description": "Are you a MS or PhD student interested in a 2026 internship in the field of machine learning, deep learning, generative AI, large language models, speech technology, robotics, computer vision, optimization, operations research, quantum computing, automated reasoning, or formal methods? If so, we want to hear from you!<br/><br/>We are looking for students interested in using a variety of domain expertise to invent, design and implement state-of-the-art solutions for never-before-solved problems.<br/><br/>You can find more information about the Amazon Science community as well as our interview process via the links below;<br/><br/>https://www.amazon.science/<br/><br/>https://amazon.jobs/content/en/career-programs/university/science<br/><br/>https://amazon.jobs/content/en/how-we-hire/university-roles/applied-science<br/><br/>Key job responsibilities<br/>As an Applied Science Intern, you will own the design and development of end-to-end systems. You’ll have the opportunity to write technical white papers, create roadmaps and drive production level projects that will support Amazon Science.<br/><br/>You will work closely with Amazon scientists and other science interns to develop solutions and deploy them into production. You will have the opportunity to design new algorithms, models, or other technical solutions whilst experiencing Amazon’s customer focused culture.<br/><br/>The ideal intern must have the ability to work with diverse groups of people and cross-functional teams to solve complex business problems. <br/><br/>A day in the life<br/>At Amazon, you will grow into the high impact person you know you’re ready to be. Every day will be filled with developing new skills and achieving personal growth.<br/><br/>How often can you say that your work changes the world? At Amazon, you’ll say it often. Join us and define tomorrow.<br/><br/>Some more benefits of an Amazon Science internship include;<br/><br/>• All of our internships offer a competitive stipend/salary<br/>• Interns are paired with an experienced manager and mentor(s)<br/>• Interns receive invitations to different events such as intern program initiatives or site events<br/>• Interns can build their professional and personal network with other Amazon Scientists<br/>• Interns can potentially publish work at top tier conferences each year<br/><br/>About the team<br/>Applicants will be reviewed on a rolling basis and are assigned to teams aligned with their research interests and experience prior to interviews.<br/><br/>Start dates are available throughout the year and durations can vary in length from 3-6 months for full time internships.<br/><br/>This role may available across multiple locations in the EMEA region (Austria, Estonia, France, Germany, Ireland, Israel, Italy, Jordan, Luxembourg, Netherlands, Poland, Romania, South Africa, Spain, Sweden, UAE, and UK).<br/><br/>Please note these are not remote internships.",
    "salary": null,
    "job_type": "full-time",
    "department": null
  },
  {
    "id": "3137915",
    "title": "Postdoctoral Scientist, Amazon Robotics",
    "company": "Amazon",
    "url": "https://www.amazon.jobs/en/jobs/3137915",
    "location": "DE, BE, Berlin",
    "city": "Berlin",
    "country": "Germany",
    "posted_date": "December  5, 2025",
    "updated_time": "3 months",
    "source": "AmazonScraper",
    "scraped_at": "2026-01-12T09:09:38.233596",
    "domain": null,
    "description": "Amazon is looking for talented Postdoctoral Scientists to join our Robotics team for a one-year, full-time research position. Postdoctoral Scientists will innovate in key areas of computer vision and manipulation challenges in Amazon warehouses.<br/><br/>The Amazon Robotics team seeks to automate the picking activities in Amazon AR Sortable FCs by retrofitting into existing stations. The team develops robotic manipulators, both the related hardware and software (including machine learning approaches). The team was formed in 2022 and is based in Berlin.<br/><br/>Our team focuses on solving computer vision and manipulation challenges in Amazon warehouses. For example, how can robots interact with the fabric pods used to store items. The technical challenges include 3D scene understand for items in clutter, identification of target items in the scene, and placement and/or removal of target items. As the solution space is open ended, the team is looking for postdoc candidates who are excited to apply and advance the state-of-the-art algorithms to this domain.<br/><br/><br/><br/><br/>Key job responsibilities<br/>Key job responsibilities<br/>In this role you will:<br/><br/>• Work closely with a senior science advisor, collaborate with other scientists and engineers, and be part of Amazon’s vibrant and diverse global science community.<br/>• Publish your innovation in top-tier academic venues and hone your presentation skills.<br/>• Be inspired by challenges and opportunities to invent cutting-edge techniques in your area(s) of expertise. ",
    "salary": null,
    "job_type": "full-time",
    "department": null
  }
]